#pragma once

/**
 * Name: TL
 * Version: 0525
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class NcPlatformSdk.GenericPlatformNcWebBrowser
	 * Size -> 0x0098 (FullSize[0x00C0] - InheritedSize[0x0028])
	 */
	class UGenericPlatformNcWebBrowser : public UObject
	{
	public:
		unsigned char                                              UnknownData_J11Q[0x98];                                  // 0x0028(0x0098) MISSED OFFSET (PADDING)

	public:
		void OnWebBrowserClosed__DelegateSignature(bool HasError, const class FString& ErrorMsg);
		void OnUrlChanged__DelegateSignature(const class FText& Text);
		void OnBeforePopup__DelegateSignature(const class FString& URL, const class FString& Frame);
		void BroadcastOnWebBrowserClosed(bool HasError, const class FString& ErrorMsg);
		void BroadcastOnUrlChanged(const class FText& InText);
		void BroadcastOnBeforePopup(const class FString& InUrl, const class FString& Frame);
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcWidgetBase
	 * Size -> 0x01A0 (FullSize[0x0400] - InheritedSize[0x0260])
	 */
	class UNcWidgetBase : public UUserWidget
	{
	public:
		unsigned char                                              UnknownData_BEBQ[0x10];                                  // 0x0260(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ENcWidgetColorType                                         Color;                                                   // 0x0270(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GYIB[0x18F];                                 // 0x0271(0x018F) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcModalWidget
	 * Size -> 0x0130 (FullSize[0x0530] - InheritedSize[0x0400])
	 */
	class UNcModalWidget : public UNcWidgetBase
	{
	public:
		unsigned char                                              UnknownData_XOMA[0x18];                                  // 0x0400(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UNcWidget_Template*                                  NcWidget_Template;                                       // 0x0418(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UNcTouchBlockerWidget*                               TouchBlockerWidget;                                      // 0x0420(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_O7AO[0x8];                                   // 0x0428(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UNcButtonInfoBarWidget*                              ButtonInfoBar;                                           // 0x0430(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_7ZZ1[0xF8];                                  // 0x0438(0x00F8) MISSED OFFSET (PADDING)

	public:
		void OnClickTemplateCloseButton();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.LoginViaPlayncWidget
	 * Size -> 0x0078 (FullSize[0x05A8] - InheritedSize[0x0530])
	 */
	class ULoginViaPlayncWidget : public UNcModalWidget
	{
	public:
		unsigned char                                              UnknownData_23QN[0x30];                                  // 0x0530(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UButton*                                             CloseButton;                                             // 0x0560(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UButton*                                             LoginButton;                                             // 0x0568(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UComboBoxString*                                     AccountType;                                             // 0x0570(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UEditableText*                                       IdText;                                                  // 0x0578(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UEditableText*                                       PasswordText;                                            // 0x0580(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UCircularThrobber*                                   Indicator;                                               // 0x0588(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UGridPanel*                                          NotifyPanel;                                             // 0x0590(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          NotifyTextBlock;                                         // 0x0598(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_0IWP[0x8];                                   // 0x05A0(0x0008) MISSED OFFSET (PADDING)

	public:
		void Show();
		void OnTextChanged(const class FText& Text);
		void OnClickLogin();
		void OnClickClose();
		void NativeConstruct();
		void Hide();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAlertWidget
	 * Size -> 0x0028 (FullSize[0x0558] - InheritedSize[0x0530])
	 */
	class UNcAlertWidget : public UNcModalWidget
	{
	public:
		unsigned char                                              UnknownData_I2OV[0x8];                                   // 0x0530(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UNcRichTextBlock*                                    MessageTextBlock;                                        // 0x0538(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcBorder*                                           ContentBorder;                                           // 0x0540(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UScrollBox*                                          ContentScrollBox;                                        // 0x0548(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            ContentSizeBox;                                          // 0x0550(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAgeSelectWidget
	 * Size -> 0x0030 (FullSize[0x0588] - InheritedSize[0x0558])
	 */
	class UNcAgeSelectWidget : public UNcAlertWidget
	{
	public:
		unsigned char                                              UnknownData_378P[0x18];                                  // 0x0558(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UNcRichTextBlock*                                    UnderlineButtonText;                                     // 0x0570(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcButton*                                           UnderlineButton;                                         // 0x0578(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UVerticalBox*                                        BottomSlot;                                              // 0x0580(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void OnClickUnderLineButtonHandler();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAgsIdentityAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcAgsIdentityAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAgsNotificationAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcAgsNotificationAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAgsSdkAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcAgsSdkAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAgsSessionAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcAgsSessionAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAgsSettingsAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcAgsSettingsAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAlertWithBottomAreaWidget
	 * Size -> 0x0048 (FullSize[0x05A0] - InheritedSize[0x0558])
	 */
	class UNcAlertWithBottomAreaWidget : public UNcAlertWidget
	{
	public:
		unsigned char                                              UnknownData_3GZO[0x18];                                  // 0x0558(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UNcRichTextBlock*                                    BottomButtonText;                                        // 0x0570(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          BottomText;                                              // 0x0578(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             BottomTextSpacer;                                        // 0x0580(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             BottomSpacer;                                            // 0x0588(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcButton*                                           BottomButton;                                            // 0x0590(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UVerticalBox*                                        BottomSlot;                                              // 0x0598(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void OnClickBottomButtonHandler();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAssetLoader
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class UNcAssetLoader : public UObject
	{
	public:
		class UClass*                                              ReferencerBPClass;                                       // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcAssetReferencer*                                  Referencer;                                              // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAssetReferencer
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UNcAssetReferencer : public UObject
	{
	public:
		unsigned char                                              NcWidgetBlueprintClassesMap[0x50];                       // 0x0028(0x0050) UNKNOWN PROPERTY: MapProperty

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAuthAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcAuthAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcInputTextAlertWidget
	 * Size -> 0x0028 (FullSize[0x0558] - InheritedSize[0x0530])
	 */
	class UNcInputTextAlertWidget : public UNcModalWidget
	{
	public:
		unsigned char                                              UnknownData_OK2J[0x8];                                   // 0x0530(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UEditableTextBox*                                    NameInput;                                               // 0x0538(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UNcBorder*                                           NameInputBorder;                                         // 0x0540(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UNcRichTextBlock*                                    MessageTextBlock;                                        // 0x0548(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            NameInputSizeBox;                                        // 0x0550(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void RefreshInputText();
		void OnTextChanged(const class FText& Text);
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAuthenticationNumberInputWidget
	 * Size -> 0x00A0 (FullSize[0x05F8] - InheritedSize[0x0558])
	 */
	class UNcAuthenticationNumberInputWidget : public UNcInputTextAlertWidget
	{
	public:
		unsigned char                                              UnknownData_DBKG[0x30];                                  // 0x0558(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UHorizontalBox*                                      InputFieldSubInfoHorizontalBox;                          // 0x0588(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          TimeLimitText;                                           // 0x0590(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UButton*                                             RetryButton;                                             // 0x0598(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcRichTextBlock*                                    RetryText;                                               // 0x05A0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      FootSectionHorizontalBox;                                // 0x05A8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          TextDescription;                                         // 0x05B0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UButton*                                             ManageInfoButton;                                        // 0x05B8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcRichTextBlock*                                    ManageInfoText;                                          // 0x05C0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             TimeLimitSpacer;                                         // 0x05C8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             FootSectionSpacer;                                       // 0x05D0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UVerticalBox*                                        FootSectionVerticalBox;                                  // 0x05D8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_VZB2[0x18];                                  // 0x05E0(0x0018) MISSED OFFSET (PADDING)

	public:
		void UpdateWarningState(bool bIsWarning);
		void BroadcastOnClickRetry();
		void BroadcastOnClickManageInfo();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcAuthTypeSelectorWidget
	 * Size -> 0x0100 (FullSize[0x0630] - InheritedSize[0x0530])
	 */
	class UNcAuthTypeSelectorWidget : public UNcModalWidget
	{
	public:
		unsigned char                                              UnknownData_2ETV[0x18];                                  // 0x0530(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTexture2D*                                          DeviceImageLightTexture;                                 // 0x0548(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UBorder*                                             Background;                                              // 0x0550(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      CloseHorizontalBox;                                      // 0x0558(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UButton*                                             CloseButton;                                             // 0x0560(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            AlertSizeBox;                                            // 0x0568(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          AlertTitle;                                              // 0x0570(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          AlertDescription;                                        // 0x0578(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      ButtonHorizontalBox;                                     // 0x0580(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            RegisterDeviceButtonSizeBox;                             // 0x0588(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UBorder*                                             RegisterDeviceButtonBorder;                              // 0x0590(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcButton*                                           RegisterDeviceButton;                                    // 0x0598(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      RegisterDeviceButtonContent;                             // 0x05A0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             Spacer1;                                                 // 0x05A8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UImage*                                              DeviceImage;                                             // 0x05B0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          RegisterDeviceButtonText;                                // 0x05B8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UImage*                                              RegisterDeviceBracket;                                   // 0x05C0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             Spacer2;                                                 // 0x05C8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          RegisterDeviceDescription;                               // 0x05D0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             ButtonSpacer;                                            // 0x05D8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            PurpleAuthButtonSizeBox;                                 // 0x05E0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UBorder*                                             PurpleAuthButtonBorder;                                  // 0x05E8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcButton*                                           PurpleAuthButton;                                        // 0x05F0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      PurpleAuthButtonContent;                                 // 0x05F8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             Spacer3;                                                 // 0x0600(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UImage*                                              PurpleImage;                                             // 0x0608(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          PurpleAuthButtonText;                                    // 0x0610(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UImage*                                              PurpleAuthBracket;                                       // 0x0618(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             Spacer4;                                                 // 0x0620(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          PurpleAuthDescription;                                   // 0x0628(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void BroadcastOnClickRegisterDevice();
		void BroadcastOnClickPurpleAuth();
		void BroadcastOnClickClose();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBackupAuthAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcBackupAuthAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBaseAnimationDialogWidget
	 * Size -> 0x0068 (FullSize[0x0468] - InheritedSize[0x0400])
	 */
	class UNcBaseAnimationDialogWidget : public UNcWidgetBase
	{
	public:
		struct FAnimationDialogAnimation                           ShowAnimation;                                           // 0x0400(0x0018) Edit, NativeAccessSpecifierPublic
		struct FAnimationDialogAnimation                           HideAnimation;                                           // 0x0418(0x0018) Edit, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_USO6[0x38];                                  // 0x0430(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder
	 * Size -> 0x0038 (FullSize[0x02A8] - InheritedSize[0x0270])
	 */
	class UNcBorder : public UBorder
	{
	public:
		unsigned char                                              UnknownData_ZWFI[0x8];                                   // 0x0270(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ENcWidgetBorderType                                        BorderType;                                              // 0x0278(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UV3U[0x3];                                   // 0x0279(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLinearColor                                        WidgetColor;                                             // 0x027C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWillChangeColorWhenChildIsFocused;                      // 0x028C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A4BC[0x3];                                   // 0x028D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLinearColor                                        FocusedColor;                                            // 0x0290(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BorderRadius;                                            // 0x02A0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TL8A[0x4];                                   // 0x02A4(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_Background
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_Background : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_Box
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_Box : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_Line1
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_Line1 : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_Line2
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_Line2 : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_PointText
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_PointText : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_Text1
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_Text1 : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcBorder_Text2
	 * Size -> 0x0000 (FullSize[0x02A8] - InheritedSize[0x02A8])
	 */
	class UNcBorder_Text2 : public UNcBorder
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcButton
	 * Size -> 0x0068 (FullSize[0x0490] - InheritedSize[0x0428])
	 */
	class UNcButton : public UButton
	{
	public:
		ENcWidgetBorderType                                        BorderType;                                              // 0x0428(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JF89[0x3];                                   // 0x0429(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLinearColor                                        NormalColorType;                                         // 0x042C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        HoveredColorType;                                        // 0x043C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        PressedColorType;                                        // 0x044C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        DisabledColorType;                                       // 0x045C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BorderRadius;                                            // 0x046C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        NormalButtonTextColor;                                   // 0x0470(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        DisabledButtonTextColor;                                 // 0x0480(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcButtonInfoBarWidget
	 * Size -> 0x0020 (FullSize[0x0420] - InheritedSize[0x0400])
	 */
	class UNcButtonInfoBarWidget : public UNcWidgetBase
	{
	public:
		class UCanvasPanel*                                        InfoPanel;                                               // 0x0400(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      InfoHorizontalBox;                                       // 0x0408(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_LC5C[0x10];                                  // 0x0410(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcButtonInfoSlotWidget
	 * Size -> 0x0048 (FullSize[0x0448] - InheritedSize[0x0400])
	 */
	class UNcButtonInfoSlotWidget : public UNcWidgetBase
	{
	public:
		class UImage*                                              ButtonImage;                                             // 0x0400(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          ButtonText;                                              // 0x0408(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             SlotSpacer;                                              // 0x0410(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             InterSpacer;                                             // 0x0418(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_EE2D[0x28];                                  // 0x0420(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcButton_Button1
	 * Size -> 0x0000 (FullSize[0x0490] - InheritedSize[0x0490])
	 */
	class UNcButton_Button1 : public UNcButton
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcButton_Button2
	 * Size -> 0x0000 (FullSize[0x0490] - InheritedSize[0x0490])
	 */
	class UNcButton_Button2 : public UNcButton
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcButton_Button3
	 * Size -> 0x0000 (FullSize[0x0490] - InheritedSize[0x0490])
	 */
	class UNcButton_Button3 : public UNcButton
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcCampaignAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcCampaignAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcCheckBox
	 * Size -> 0x0048 (FullSize[0x0448] - InheritedSize[0x0400])
	 */
	class UNcCheckBox : public UNcWidgetBase
	{
	public:
		unsigned char                                              UnknownData_U6NJ[0x18];                                  // 0x0400(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLinearColor                                        UncheckedColor;                                          // 0x0418(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        CheckedColor;                                            // 0x0428(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UImage*                                              Background;                                              // 0x0438(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UCheckBox*                                           CheckBox;                                                // 0x0440(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void BroadcastCheckStateChanged(bool bIsChecked);
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcCoinPaymentAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcCoinPaymentAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcConfigurationAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcConfigurationAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcConsoleAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcConsoleAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcCountrySelectWidget
	 * Size -> 0x0088 (FullSize[0x05B8] - InheritedSize[0x0530])
	 */
	class UNcCountrySelectWidget : public UNcModalWidget
	{
	public:
		class UNcBorder*                                           CountrySelectorBorder;                                   // 0x0530(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UComboBoxString*                                     CountrySelector;                                         // 0x0538(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            CountrySelectorSizeBox;                                  // 0x0540(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_GM2Y[0x70];                                  // 0x0548(0x0070) MISSED OFFSET (PADDING)

	public:
		void SetSelectedOptionToInitialCountry();
		void SetInitialCountry(const class FString& CountryCode);
		void OnCountrySelectChanged(const class FString& SelectedItem, ESelectInfo SelectionType);
		void LockSelection();
		class FString GetSelectedCountry();
		void AddCountry(const class FString& CountryCode, const class FString& EnglishName);
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcCouponAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcCouponAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcCustomButtonWidget
	 * Size -> 0x0028 (FullSize[0x0428] - InheritedSize[0x0400])
	 */
	class UNcCustomButtonWidget : public UNcWidgetBase
	{
	public:
		class UNcButton*                                           CustomButton;                                            // 0x0400(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UImage*                                              CustomButtonLeftIcon;                                    // 0x0408(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UImage*                                              CustomButtonRightIcon;                                   // 0x0410(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcRichTextBlock*                                    CustomButtonText;                                        // 0x0418(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcBorder*                                           ButtonBorder;                                            // 0x0420(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcDailyStampAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcDailyStampAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcDeviceListSlotWidget
	 * Size -> 0x0108 (FullSize[0x0508] - InheritedSize[0x0400])
	 */
	class UNcDeviceListSlotWidget : public UNcWidgetBase
	{
	public:
		unsigned char                                              UnknownData_NAUF[0x60];                                  // 0x0400(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCanvasPanel*                                        SlotPanel;                                               // 0x0460(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UButton*                                             ButtonDelete;                                            // 0x0468(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UButton*                                             ButtonChangeName;                                        // 0x0470(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcRichTextBlock*                                    TextDeviceName;                                          // 0x0478(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTextBlock*                                          TextRegistrationDate;                                    // 0x0480(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            DeviceNameSizeBox;                                       // 0x0488(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UCanvasPanel*                                        VerticalLineCanvas;                                      // 0x0490(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcBorder*                                           Background;                                              // 0x0498(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcBorder*                                           TopLine;                                                 // 0x04A0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcBorder*                                           BottomLine;                                              // 0x04A8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNcBorder*                                           VerticalLine;                                            // 0x04B0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USizeBox*                                            MainSizeBox;                                             // 0x04B8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      MainHorizontalBox;                                       // 0x04C0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      RegistrationDateHorizontalBox;                           // 0x04C8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBox*                                      ButtonsHorizontalBox;                                    // 0x04D0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             TopSpacer;                                               // 0x04D8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             BottomSpacer;                                            // 0x04E0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             InterSpacer;                                             // 0x04E8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             Spacer1;                                                 // 0x04F0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             Spacer2;                                                 // 0x04F8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpacer*                                             DeviceNameSpacer;                                        // 0x0500(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void BroadcastOnClickDelete();
		void BroadcastOnClickChangeName();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcDeviceListWidget
	 * Size -> 0x0130 (FullSize[0x0660] - InheritedSize[0x0530])
	 */
	class UNcDeviceListWidget : public UNcModalWidget
	{
	public:
		unsigned char                                              UnknownData_NMI6[0x70];                                  // 0x0530(0x0070) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTextBlock*                                          TextTitle;                                               // 0x05A0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          TextSelectDevice;                                        // 0x05A8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          TextNote1;                                               // 0x05B0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          TextNote2;                                               // 0x05B8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          TextNote3;                                               // 0x05C0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          TextNote4;                                               // 0x05C8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USizeBox*                                            ScrollContentsSizeBox;                                   // 0x05D0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UScrollBox*                                          ContentScroll;                                           // 0x05D8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UVerticalBox*                                        DeviceListBox;                                           // 0x05E0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHorizontalBox*                                      Note1HorizontalBox;                                      // 0x05E8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHorizontalBox*                                      Note2HorizontalBox;                                      // 0x05F0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHorizontalBox*                                      Note3HorizontalBox;                                      // 0x05F8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHorizontalBox*                                      Note4HorizontalBox;                                      // 0x0600(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          Note1Header;                                             // 0x0608(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          Note2Header;                                             // 0x0610(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          Note3Header;                                             // 0x0618(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          Note4Header;                                             // 0x0620(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpacer*                                             Note1Spacer;                                             // 0x0628(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpacer*                                             Note2Spacer;                                             // 0x0630(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpacer*                                             Note3Spacer;                                             // 0x0638(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USpacer*                                             Note4Spacer;                                             // 0x0640(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCanvasPanel*                                        InquireCanvas;                                           // 0x0648(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UButton*                                             ContactButton;                                           // 0x0650(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UNcRichTextBlock*                                    TextContact;                                             // 0x0658(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		void BroadcastOnClickChangePhoneNumberButton();
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcDimmedWidget
	 * Size -> 0x0008 (FullSize[0x0538] - InheritedSize[0x0530])
	 */
	class UNcDimmedWidget : public UNcModalWidget
	{
	public:
		class UNcBorder*                                           Background;                                              // 0x0530(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcExtraAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UNcExtraAPI : public UBlueprintFunctionLibrary
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcGeneralWebViewWidget
	 * Size -> 0x00B0 (FullSize[0x05E0] - InheritedSize[0x0530])
	 */
	class UNcGeneralWebViewWidget : public UNcModalWidget
	{
	public:
		unsigned char                                              UnknownData_2BQ9[0x78];                                  // 0x0530(0x0078) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCanvasPanel*                                        WindowPanel;                                             // 0x05A8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UHorizontalBox*                                      CloseHorizontalBox;                                      // 0x05B0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USpacer*                                             CloseSpacer;                                             // 0x05B8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UButton*                                             CloseButton;                                             // 0x05C0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UNcWebBrowser*                                       Window;                                                  // 0x05C8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_0SQE[0x10];                                  // 0x05D0(0x0010) MISSED OFFSET (PADDING)

	public:
		void Show(int32_t InZOrder);
		void SetSupportsTransparency(bool InSupportsTransparency);
		void LoadURL(const class FString& InUrl);
		void HandleOnWebBrowserClosed(bool HasError, const class FString& ErrorMsg);
		class FString GetUrl();
		void ExecuteJavascript(const class FString& JavascriptExp);
		void BroadcastOnUrlChanged(const class FText& InText);
		void BroadcastOnClickClose();
		void BroadcastOnBeforePopup(const class FString& InUrl, const class FString& Frame);
		static UClass* StaticClass();
	};

	/**
	 * Class NcPlatformSdk.NcGoogleAchievementAPI
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
