#pragma once

/**
 * Name: TL
 * Version: 0525
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function TLClient.LEWidgetBPLibrary.GetFPS
	 */
	struct ULEWidgetBPLibrary_GetFPS_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.StopScene
	 */
	struct ATLCustomSceneControlActor_StopScene_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.StopLevelSequence
	 */
	struct ATLCustomSceneControlActor_StopLevelSequence_Params
	{
	public:
		class FName                                                InKey;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.StopCurrentScene
	 */
	struct ATLCustomSceneControlActor_StopCurrentScene_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.StopAllLevelSequence
	 */
	struct ATLCustomSceneControlActor_StopAllLevelSequence_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.SpawnSceneActor
	 */
	struct ATLCustomSceneControlActor_SpawnSceneActor_Params
	{
	public:
		class UClass*                                              ActorClass;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TagID;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.SpawnDomeActor
	 */
	struct ATLCustomSceneControlActor_SpawnDomeActor_Params
	{
	public:
		class UClass*                                              InDomeActorClass;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ShowUIAll
	 */
	struct ATLCustomSceneControlActor_ShowUIAll_Params
	{
	public:
		bool                                                       bInShow;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.SetModelRotationOffset
	 */
	struct ATLCustomSceneControlActor_SetModelRotationOffset_Params
	{
	public:
		struct FRotator                                            InOffsetRotation;                                        // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.SetMapRoom
	 */
	struct ATLCustomSceneControlActor_SetMapRoom_Params
	{
	public:
		class FName                                                InID;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.SetHiddenState
	 */
	struct ATLCustomSceneControlActor_SetHiddenState_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.SetCameraRotation
	 */
	struct ATLCustomSceneControlActor_SetCameraRotation_Params
	{
	public:
		struct FRotator                                            CameraRotation;                                          // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ResetCustomSceneCameraModelRotation
	 */
	struct ATLCustomSceneControlActor_ResetCustomSceneCameraModelRotation_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ResetCustomCameraTargetObject
	 */
	struct ATLCustomSceneControlActor_ResetCustomCameraTargetObject_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.PlaySceneContiByModelTag
	 */
	struct ATLCustomSceneControlActor_PlaySceneContiByModelTag_Params
	{
	public:
		class FName                                                TargetModelTag;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSoftObjectPath                                     InSceneContiPath;                                        // 0x0008(0x0018)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bMaintainCurrentSCT;                                     // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bForcePlay;                                              // 0x0021(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.PlaySceneContiByModelIndex
	 */
	struct ATLCustomSceneControlActor_PlaySceneContiByModelIndex_Params
	{
	public:
		int32_t                                                    TargetModelIndex;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_TY7W[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSoftObjectPath                                     InSceneContiPath;                                        // 0x0008(0x0018)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bMaintainCurrentSCT;                                     // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bForcePlay;                                              // 0x0021(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.PlayLevelSequenceWithStopCallback
	 */
	struct ATLCustomSceneControlActor_PlayLevelSequenceWithStopCallback_Params
	{
	public:
		class FName                                                InGroupKey;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ULevelSequence*                                      InSequence;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                InFunctionName;                                          // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bLoop;                                                   // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSkippable;                                            // 0x0019(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bAtCurrentPOV;                                           // 0x001A(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_W6H7[0x5];                                   // 0x001B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class ULevelSequencePlayer*                                ReturnValue;                                             // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.PlayLevelSequenceWithDynamicStopCallback
	 */
	struct ATLCustomSceneControlActor_PlayLevelSequenceWithDynamicStopCallback_Params
	{
	public:
		class FName                                                InGroupKey;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ULevelSequence*                                      InSequence;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnStop;                                                  // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bIsSkippable;                                            // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bAtCurrentPOV;                                           // 0x0021(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_HW92[0x6];                                   // 0x0022(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class ULevelSequencePlayer*                                ReturnValue;                                             // 0x0028(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.PlayLevelSequence
	 */
	struct ATLCustomSceneControlActor_PlayLevelSequence_Params
	{
	public:
		class FName                                                InKey;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ULevelSequence*                                      InSequence;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bLoop;                                                   // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSkippable;                                            // 0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bAtCurrentPOV;                                           // 0x0012(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bPauseAtEnd;                                             // 0x0013(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MCBH[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class ULevelSequencePlayer*                                ReturnValue;                                             // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.OnStopScene
	 */
	struct ATLCustomSceneControlActor_OnStopScene_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.OnStartScene
	 */
	struct ATLCustomSceneControlActor_OnStartScene_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.OnCutsceneStopped_Cleanup
	 */
	struct ATLCustomSceneControlActor_OnCutsceneStopped_Cleanup_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.OnCustomCameraActivated
	 */
	struct ATLCustomSceneControlActor_OnCustomCameraActivated_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.OnCameraTransitionComplete
	 */
	struct ATLCustomSceneControlActor_OnCameraTransitionComplete_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.IsPlayingLevelSequence
	 */
	struct ATLCustomSceneControlActor_IsPlayingLevelSequence_Params
	{
	public:
		class FName                                                InKey;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.IsBlendingCameraTarget
	 */
	struct ATLCustomSceneControlActor_IsBlendingCameraTarget_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.GetModelActorByTag
	 */
	struct ATLCustomSceneControlActor_GetModelActorByTag_Params
	{
	public:
		class FName                                                TargetModelTag;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.GetModelActorByIndex
	 */
	struct ATLCustomSceneControlActor_GetModelActorByIndex_Params
	{
	public:
		int32_t                                                    TargetModelIndex;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_96HT[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.DestroySceneActor
	 */
	struct ATLCustomSceneControlActor_DestroySceneActor_Params
	{
	public:
		class FName                                                TagID;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.DestroyMapRoom
	 */
	struct ATLCustomSceneControlActor_DestroyMapRoom_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.DeactivateMapEnvironmentAffector
	 */
	struct ATLCustomSceneControlActor_DeactivateMapEnvironmentAffector_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.CustomSceneEvent
	 */
	struct ATLCustomSceneControlActor_CustomSceneEvent_Params
	{
	public:
		class FName                                                InID;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ClearHiddenState
	 */
	struct ATLCustomSceneControlActor_ClearHiddenState_Params
	{	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ChangeHiveByModelTag
	 */
	struct ATLCustomSceneControlActor_ChangeHiveByModelTag_Params
	{
	public:
		class FName                                                TargetModelTag;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UHiveEntityData*                                     HiveEntity;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ChangeHiveByModelIndex
	 */
	struct ATLCustomSceneControlActor_ChangeHiveByModelIndex_Params
	{
	public:
		int32_t                                                    TargetModelIndex;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_SPE0[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UHiveEntityData*                                     HiveEntity;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ChangeHive
	 */
	struct ATLCustomSceneControlActor_ChangeHive_Params
	{
	public:
		class UHiveEntityData*                                     HiveEntity;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ChangeEnvironmentSequence
	 */
	struct ATLCustomSceneControlActor_ChangeEnvironmentSequence_Params
	{
	public:
		class FName                                                InActivationTag;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ULevelSequence*                                      Sequence;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ChangeCameraTarget
	 */
	struct ATLCustomSceneControlActor_ChangeCameraTarget_Params
	{
	public:
		class FName                                                CameraTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bWarp;                                                   // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bForceChange;                                            // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000A(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ActivateMapEnvironmentAffector
	 */
	struct ATLCustomSceneControlActor_ActivateMapEnvironmentAffector_Params
	{
	public:
		class FName                                                InActivationTag;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bOverrideBlendDuration;                                  // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_KE5Q[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      BlendDuration;                                           // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ActivateCustomSceneCameraWithTargetTag
	 */
	struct ATLCustomSceneControlActor_ActivateCustomSceneCameraWithTargetTag_Params
	{
	public:
		class FName                                                TargetObjectTag;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bEnableAdvance;                                          // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bEnableZoom;                                             // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_GZW2[0x2];                                   // 0x000A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector2D                                           CameraCenterOffset;                                      // 0x000C(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      CameraDistOffset;                                        // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomSceneControlActor.ActivateCustomSceneCameraWithFixedTarget
	 */
	struct ATLCustomSceneControlActor_ActivateCustomSceneCameraWithFixedTarget_Params
	{
	public:
		class AActor*                                              Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            CameraRotation;                                          // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector2D                                           CameraCenterOffset;                                      // 0x0014(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      CameraDistOffset;                                        // 0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLCustomizeSceneControlActor.StopCustomizeCommonActionTree
	 */
	struct ATLCustomizeSceneControlActor_StopCustomizeCommonActionTree_Params
	{
	public:
		class FName                                                IgnoreGroupName;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.TryDeleteSelectedCharacter
	 */
	struct ATLGameLobbyActor_TryDeleteSelectedCharacter_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.StartLobbyScene
	 */
	struct ATLGameLobbyActor_StartLobbyScene_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.SkipEnvTransition
	 */
	struct ATLGameLobbyActor_SkipEnvTransition_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.SetSelectedCharacterID
	 */
	struct ATLGameLobbyActor_SetSelectedCharacterID_Params
	{
	public:
		int32_t                                                    InSelectedCharacterID;                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.SetPendingEnterNewCharacter
	 */
	struct ATLGameLobbyActor_SetPendingEnterNewCharacter_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.SetLobbyReadyToPlay
	 */
	struct ATLGameLobbyActor_SetLobbyReadyToPlay_Params
	{
	public:
		bool                                                       bInReady;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.SetIngameUIStage
	 */
	struct ATLGameLobbyActor_SetIngameUIStage_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.SendCutsceneEnd
	 */
	struct ATLGameLobbyActor_SendCutsceneEnd_Params
	{
	public:
		class FName                                                CutSceneID;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.RequestSelectCharacter
	 */
	struct ATLGameLobbyActor_RequestSelectCharacter_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.RequestExitGame
	 */
	struct ATLGameLobbyActor_RequestExitGame_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.RequestEndGameLobby
	 */
	struct ATLGameLobbyActor_RequestEndGameLobby_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.PlayRealmSelectAT
	 */
	struct ATLGameLobbyActor_PlayRealmSelectAT_Params
	{
	public:
		class FName                                                InConditionKey;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.PlayCredit
	 */
	struct ATLGameLobbyActor_PlayCredit_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnUpdateWorldServerDatas
	 */
	struct ATLGameLobbyActor_OnUpdateWorldServerDatas_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnUpdateWorldServerAlive
	 */
	struct ATLGameLobbyActor_OnUpdateWorldServerAlive_Params
	{
	public:
		int32_t                                                    InServerID;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bInAlive;                                                // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnUpdateCharacterDatas_Native
	 */
	struct ATLGameLobbyActor_OnUpdateCharacterDatas_Native_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnUpdateCharacterDatas
	 */
	struct ATLGameLobbyActor_OnUpdateCharacterDatas_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnStartGameLobby
	 */
	struct ATLGameLobbyActor_OnStartGameLobby_Params
	{
	public:
		ETLGameLobbyEnterReason                                    InEnterReason;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnStartCutscene
	 */
	struct ATLGameLobbyActor_OnStartCutscene_Params
	{
	public:
		class FName                                                InCursceneId;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bInSkippable;                                            // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnServerSelectComplete
	 */
	struct ATLGameLobbyActor_OnServerSelectComplete_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnReadyToPlay
	 */
	struct ATLGameLobbyActor_OnReadyToPlay_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnPostServerSelectSequenceFinished
	 */
	struct ATLGameLobbyActor_OnPostServerSelectSequenceFinished_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnNightmareCutsceneFinished
	 */
	struct ATLGameLobbyActor_OnNightmareCutsceneFinished_Params
	{
	public:
		class FName                                                CutSceneID;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ExclusiveTag;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ECutscenePlayResult                                        PlayResult;                                              // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnNewCharacterValidation
	 */
	struct ATLGameLobbyActor_OnNewCharacterValidation_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnMyPCEnter
	 */
	struct ATLGameLobbyActor_OnMyPCEnter_Params
	{
	public:
		bool                                                       bQuickConnect;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnLobbyStateTransitionStart_Event
	 */
	struct ATLGameLobbyActor_OnLobbyStateTransitionStart_Event_Params
	{
	public:
		ELobbySceneState                                           NewState;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ELobbySceneState                                           PreviousState;                                           // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnLobbyStateChange_Event
	 */
	struct ATLGameLobbyActor_OnLobbyStateChange_Event_Params
	{
	public:
		ELobbySceneState                                           NewState;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ELobbySceneState                                           PreviousState;                                           // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnLobbyLevelLoaded
	 */
	struct ATLGameLobbyActor_OnLobbyLevelLoaded_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnGameEnterSctFinished
	 */
	struct ATLGameLobbyActor_OnGameEnterSctFinished_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnEndGameLobby
	 */
	struct ATLGameLobbyActor_OnEndGameLobby_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnCustomizeInCutsceneEnd
	 */
	struct ATLGameLobbyActor_OnCustomizeInCutsceneEnd_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnCreditFinishCallback
	 */
	struct ATLGameLobbyActor_OnCreditFinishCallback_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.OnCreateWidget
	 */
	struct ATLGameLobbyActor_OnCreateWidget_Params
	{
	public:
		class UTLUserWidgetFrame*                                  UserWidgetFrame;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.LoadLobbySceneMap
	 */
	struct ATLGameLobbyActor_LoadLobbySceneMap_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.IsTestLobby
	 */
	struct ATLGameLobbyActor_IsTestLobby_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.IsReadyToPlay
	 */
	struct ATLGameLobbyActor_IsReadyToPlay_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.IsPendingEnterNewCharacter
	 */
	struct ATLGameLobbyActor_IsPendingEnterNewCharacter_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.HideWidgetComponent
	 */
	struct ATLGameLobbyActor_HideWidgetComponent_Params
	{
	public:
		bool                                                       bHide;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.HandleCustomizeWidgetCreated
	 */
	struct ATLGameLobbyActor_HandleCustomizeWidgetCreated_Params
	{
	public:
		class UTLUserWidgetFrame*                                  Widget;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.GetWorldServerDatas
	 */
	struct ATLGameLobbyActor_GetWorldServerDatas_Params
	{
	public:
		TArray<struct FTLWorldServerData>                          ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.GetSelectedCharacterID
	 */
	struct ATLGameLobbyActor_GetSelectedCharacterID_Params
	{
	public:
		int64_t                                                    ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.GetSelectedCharacterData
	 */
	struct ATLGameLobbyActor_GetSelectedCharacterData_Params
	{
	public:
		struct FTLCharacterData                                    ReturnValue;                                             // 0x0000(0x01B0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.GetHomeServerDatas
	 */
	struct ATLGameLobbyActor_GetHomeServerDatas_Params
	{
	public:
		TArray<struct FTLHomeServerData>                           ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.GetCharacterDatas
	 */
	struct ATLGameLobbyActor_GetCharacterDatas_Params
	{
	public:
		TArray<struct FTLCharacterData>                            ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.FadeoutBlackscreen
	 */
	struct ATLGameLobbyActor_FadeoutBlackscreen_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.FadeinBlackscreen
	 */
	struct ATLGameLobbyActor_FadeinBlackscreen_Params
	{
	public:
		class UObject*                                             InObject;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                InFunctionName;                                          // 0x0008(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.DestroySelf
	 */
	struct ATLGameLobbyActor_DestroySelf_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.CustomizeTestFunction
	 */
	struct ATLGameLobbyActor_CustomizeTestFunction_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.CompleteStateChange
	 */
	struct ATLGameLobbyActor_CompleteStateChange_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.CheckCharacterSlotAvailable
	 */
	struct ATLGameLobbyActor_CheckCharacterSlotAvailable_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.ChangeToGameCamera
	 */
	struct ATLGameLobbyActor_ChangeToGameCamera_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.ChangeLobbyState
	 */
	struct ATLGameLobbyActor_ChangeLobbyState_Params
	{
	public:
		ELobbySceneState                                           NextState;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bImmediate;                                              // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ETLLobbyStateChangeReason                                  InReason;                                                // 0x0002(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLGameLobbyActor.CancelDeleteSelectedCharacter
	 */
	struct ATLGameLobbyActor_CancelDeleteSelectedCharacter_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.BlackscreenFadeInFinished
	 */
	struct ATLGameLobbyActor_BlackscreenFadeInFinished_Params
	{	};

	/**
	 * Function TLClient.TLGameLobbyActor.BlackscreenFadeInFinishCallback
	 */
	struct ATLGameLobbyActor_BlackscreenFadeInFinishCallback_Params
	{	};

	/**
	 * Function TLClient.TLBeautyshopControlActor.TestSetPolymorphID
	 */
	struct ATLBeautyshopControlActor_TestSetPolymorphID_Params
	{
	public:
		int32_t                                                    InPolymorphID;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ETLGender                                                  InGender;                                                // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.SupportsSeekingBink
	 */
	struct UTLBinkBlueprintLibrary_SupportsSeekingBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.SupportsScrubbingBink
	 */
	struct UTLBinkBlueprintLibrary_SupportsScrubbingBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.SupportsRateBink
	 */
	struct UTLBinkBlueprintLibrary_SupportsRateBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Rate;                                                    // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Unthinned;                                               // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.StopBink
	 */
	struct UTLBinkBlueprintLibrary_StopBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.SetRateBink
	 */
	struct UTLBinkBlueprintLibrary_SetRateBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Rate;                                                    // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.SetLoopingBink
	 */
	struct UTLBinkBlueprintLibrary_SetLoopingBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       InLooping;                                               // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.SeekBink
	 */
	struct UTLBinkBlueprintLibrary_SeekBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTimespan                                           InTime;                                                  // 0x0008(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.RewindBink
	 */
	struct UTLBinkBlueprintLibrary_RewindBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.PlayBink
	 */
	struct UTLBinkBlueprintLibrary_PlayBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.PauseBink
	 */
	struct UTLBinkBlueprintLibrary_PauseBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.OpenUrlBink
	 */
	struct UTLBinkBlueprintLibrary_OpenUrlBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              NewURL;                                                  // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.OpenBink
	 */
	struct UTLBinkBlueprintLibrary_OpenBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              NewURL;                                                  // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.IsStoppedBink
	 */
	struct UTLBinkBlueprintLibrary_IsStoppedBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.IsPlayingBink
	 */
	struct UTLBinkBlueprintLibrary_IsPlayingBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.IsPausedBink
	 */
	struct UTLBinkBlueprintLibrary_IsPausedBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.IsLoopingBink
	 */
	struct UTLBinkBlueprintLibrary_IsLoopingBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.GetUrlBink
	 */
	struct UTLBinkBlueprintLibrary_GetUrlBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.GetTimeBink
	 */
	struct UTLBinkBlueprintLibrary_GetTimeBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTimespan                                           ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.GetRateBink
	 */
	struct UTLBinkBlueprintLibrary_GetRateBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.GetDurationBink
	 */
	struct UTLBinkBlueprintLibrary_GetDurationBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTimespan                                           ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function TLClient.TLBinkBlueprintLibrary.DrawBink
	 */
	struct UTLBinkBlueprintLibrary_DrawBink_Params
	{
	public:
		class UBinkMediaPlayer*                                    InBinkMediaPlayer;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UTexture*                                            Texture;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       tonemap;                                                 // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_ZNO9[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    out_nits;                                                // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Alpha;                                                   // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       srgb_decode;                                             // 0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       HDR;                                                     // 0x001D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
