#pragma once

/**
 * Name: TL
 * Version: 0525
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum TLScheme.ETLCursorType
	 */
	enum class ETLCursorType : uint8_t
	{
		None                 = 0,
		Default              = 1,
		UseFo                = 2,
		Talk                 = 3,
		Hit                  = 4,
		Looting              = 5,
		UseFoDisable         = 6,
		TalkDisable          = 7,
		LootingDisable       = 8,
		Move                 = 9,
		Hidden               = 10,
		TwoDepth             = 11,
		TwoDepthDisable      = 12,
		WorldPinEditNormal   = 13,
		WorldPinEditDisable  = 14,
		AutoPathFollow       = 15,
		GamepadWorldmap      = 16,
		Rotate               = 17,
		InspectionMove       = 18,
		InspectionSelect     = 19,
		InspectionWipe       = 20,
		InspectionControl    = 21,
		Search               = 22,
		Teleport             = 23,
		HuntingAreaInfo      = 24,
		IndoorMap            = 25,
		CustomizeLookAt      = 26,
		CustomizeLookAtPause = 27,
		UIMovable            = 28,
		UIMoving             = 29,
		MAX                  = 30
	};

	/**
	 * Enum TLScheme.ECutscenePlayResult
	 */
	enum class ECutscenePlayResult : uint8_t
	{
		Failed      = 0,
		Interrupted = 1,
		Completed   = 2,
		MAX         = 3
	};

	/**
	 * Enum TLScheme.EItemGrade
	 */
	enum class EItemGrade : uint8_t
	{
		kError     = 0,
		kMisc      = 1,
		kC         = 2,
		kB         = 3,
		kA         = 4,
		kAA        = 5,
		kAAA       = 6,
		kS         = 7,
		kSS        = 8,
		kSSS       = 9,
		kEndOfEnum = 10,
		MAX        = 11
	};

	/**
	 * Enum TLScheme.EItemCategory
	 */
	enum class EItemCategory : uint8_t
	{
		kNone                       = 0,
		kDagger                     = 1,
		kSword                      = 2,
		kShield                     = 3,
		kSword2h                    = 4,
		kStaff                      = 5,
		kBow                        = 6,
		kCrossbow                   = 7,
		kGrimoire                   = 8,
		kWand                       = 9,
		kScroll                     = 10,
		kSpear                      = 11,
		kHead                       = 12,
		kChest                      = 13,
		kHands                      = 14,
		kLegs                       = 15,
		kFeet                       = 16,
		kCloak                      = 17,
		kNecklace                   = 18,
		kEarring                    = 19,
		kRing                       = 20,
		kBracelet                   = 21,
		kAmmo                       = 22,
		kSeal                       = 23,
		kCrest                      = 24,
		kShirt                      = 25,
		kFishingRod                 = 26,
		kBelt                       = 27,
		kPotion                     = 28,
		kUnselectableFixedPackage   = 29,
		kUnselectableRandomPackage  = 30,
		kSelectableFixedPackage     = 31,
		kSelectableRandomPackage    = 32,
		kFood                       = 33,
		kMagicScroll                = 34,
		kReturnScroll               = 35,
		kEnchantScroll              = 36,
		kSkillCustom                = 37,
		kSkillScroll                = 38,
		kWaypointScroll             = 39,
		kTeleportScroll             = 40,
		kPolymorphScroll            = 41,
		kPolymorphRandomScroll      = 42,
		kPolymorphStone             = 43,
		kMagicDollStone             = 44,
		kMagicDollBookScroll        = 45,
		kStatReset                  = 46,
		kContractScroll             = 47,
		kDecomposeEquip             = 48,
		kDecomposeSkillScroll       = 49,
		kGuildHomeTeleportScroll    = 50,
		kExp                        = 51,
		kKey                        = 52,
		kRune                       = 53,
		kPowder                     = 54,
		kMisc                       = 55,
		kMaterial                   = 56,
		kPass                       = 57,
		kCraftingRecipe             = 58,
		kEventMisc                  = 59,
		kGathering                  = 60,
		kGuildFlag                  = 61,
		kSkillMisc                  = 62,
		kPolymorphPiece             = 63,
		kMagicdollPiece             = 64,
		kRubbingScroll              = 65,
		kGold                       = 66,
		kDiamond                    = 67,
		kPolymorphEnchantStr        = 68,
		kPolymorphEnchantDex        = 69,
		kPolymorphEnchantCon        = 70,
		kPolymorphEnchantInt        = 71,
		kPolymorphEnchantWis        = 72,
		kPolymorphEnchantCha        = 73,
		kPolymorphEnchantControl    = 74,
		kPolymorphEnchantAttack     = 75,
		kPolymorphEnchantMove       = 76,
		kPolymorphEnchantDefense    = 77,
		kPolymorphEnchantWeak       = 78,
		kVirtualMiscContract        = 79,
		kVirtualMiscCodexInspection = 80,
		kVirtualMiscCodex           = 81,
		kDummy                      = 82,
		kWeaponMastery              = 83,
		kDungeonPointStone          = 84,
		kSeasonPass                 = 85,
		kTreasureBoxKey             = 86,
		kTimeLimitDungeonCharger    = 87,
		kGrowthPass                 = 88,
		kGacha                      = 89,
		kGachaTrigger               = 90,
		kSkillPoint                 = 91,
		kSkillEnchantAttack         = 92,
		kSkillEnchantMove           = 93,
		kSkillEnchantDebuff         = 94,
		kSkillEnchantBuff           = 95,
		kSkillEnchantRecovery       = 96,
		kSkillEnchantCommon         = 97,
		kVowRingTarget              = 98,
		kVowRingAll                 = 99,
		kSocialMotion               = 100,
		kPotionElixir               = 101,
		kPotionHeal                 = 102,
		kPotionLeaf                 = 103,
		kEnchantPoint               = 104,
		kMaterialMain               = 105,
		kMaterialPowder             = 106,
		kMaterialSkillpaper         = 107,
		kMaterialJewel              = 108,
		kMaterialSub                = 109,
		kMaterialFood               = 110,
		kMaterialEtc                = 111,
		kSkillPointCommon           = 112,
		kEndOfEnum                  = 113,
		MAX                         = 114
	};

	/**
	 * Enum TLScheme.EItemType
	 */
	enum class EItemType : uint8_t
	{
		kNone   = 0,
		kEquip  = 1,
		kUsable = 2,
		kMisc   = 3,
		kMoney  = 4,
		kAmmo   = 5,
		kKey    = 6,
		kDummy  = 7,
		MAX     = 8
	};

	/**
	 * Enum TLScheme.ETLPolymorphUICategory
	 */
	enum class ETLPolymorphUICategory : uint8_t
	{
		COMBAT     = 0,
		MOBILITY   = 1,
		CAMOUFLAGE = 2,
		NONE       = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ETLPolymorphPictogramType
	 */
	enum class ETLPolymorphPictogramType : uint8_t
	{
		None            = 0,
		Dash            = 1,
		Glide           = 2,
		Swim            = 3,
		SiegeWeapon     = 4,
		Usurper         = 5,
		Overlord        = 6,
		SiegeTaxCarrier = 7,
		MAX             = 8
	};

	/**
	 * Enum TLScheme.ETLPolymorphCategory
	 */
	enum class ETLPolymorphCategory : uint8_t
	{
		POLYMORPH_FORCING     = 0,
		POLYMORPH_INTERACTION = 1,
		POLYMORPH_STONE       = 2,
		POLYMORPH_SCROLL      = 3,
		MAX                   = 4,
		NONE                  = 5
	};

	/**
	 * Enum TLScheme.ETLMobiltyType
	 */
	enum class ETLMobiltyType : uint8_t
	{
		kNone      = 0,
		kGliding   = 1,
		kDash      = 2,
		kSwimming  = 3,
		kEndOfEnum = 4,
		MAX        = 5
	};

	/**
	 * Enum TLScheme.ETLPolymorphMainWeaponType
	 */
	enum class ETLPolymorphMainWeaponType : uint8_t
	{
		kNone      = 0,
		kDagger    = 1,
		kSword     = 2,
		kSword2h   = 3,
		kStaff     = 4,
		kBow       = 5,
		kCrossBow  = 6,
		kWand      = 7,
		kSpear     = 8,
		kEndOfEnum = 9,
		MAX        = 10
	};

	/**
	 * Enum TLScheme.ETLSpecialPolymorphType
	 */
	enum class ETLSpecialPolymorphType : uint8_t
	{
		kNone        = 0,
		kMobility    = 1,
		kSiegeWeapon = 2,
		kSocial      = 3,
		kTemporary   = 4,
		kEndOfEnum   = 5,
		MAX          = 6
	};

	/**
	 * Enum TLScheme.ETLBodySize
	 */
	enum class ETLBodySize : uint8_t
	{
		Small      = 0,
		Medium     = 1,
		Large      = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ECooldownGroup
	 */
	enum class ECooldownGroup : uint8_t
	{
		kError                             = 0,
		kNone                              = 1,
		kHeroPermanentStart                = 2,
		kHeroPermanent_01                  = 3,
		kHeroPermanent_02                  = 4,
		kHeroPermanent_03                  = 5,
		kHeroPermanent_04                  = 6,
		kHeroPermanent_05                  = 7,
		kHeroPermanent_06                  = 8,
		kHeroPermanent_07                  = 9,
		kHeroPermanent_08                  = 10,
		kHeroPermanent_09                  = 11,
		kHeroPermanent                     = 12,
		kHeroPermanent01                   = 13,
		kHeroPermanent02                   = 14,
		kHeroPermanent03                   = 15,
		kHeroPermanent04                   = 16,
		kHeroPermanent05                   = 17,
		kHeroPermanent06                   = 18,
		kHeroPermanent07                   = 19,
		kHeroPermanent08                   = 20,
		kHeroPermanent09                   = 21,
		kHeroPermanent10                   = 22,
		kHeroPermanent11                   = 23,
		kHeroPermanent12                   = 24,
		kHeroPermanent13                   = 25,
		kHeroPermanent14                   = 26,
		kHeroPermanent15                   = 27,
		kHeroPermanent16                   = 28,
		kHeroPermanent17                   = 29,
		kHeroPermanent18                   = 30,
		kHeroPermanent19                   = 31,
		kHeroPermanent20                   = 32,
		kHeroPermanentEnd                  = 33,
		kHeroTemporaryStart                = 34,
		kHeroTemporary_01                  = 35,
		kHeroTemporary_02                  = 36,
		kHeroTemporary_03                  = 37,
		kHeroTemporary_04                  = 38,
		kHeroTemporary_05                  = 39,
		kHeroTemporary_06                  = 40,
		kHeroTemporary_07                  = 41,
		kHeroTemporary_08                  = 42,
		kHeroTemporary_09                  = 43,
		kHeroTemporary                     = 44,
		kHeroTemporary01                   = 45,
		kHeroTemporary02                   = 46,
		kHeroTemporary03                   = 47,
		kHeroTemporary04                   = 48,
		kHeroTemporary05                   = 49,
		kHeroTemporary06                   = 50,
		kHeroTemporary07                   = 51,
		kHeroTemporary08                   = 52,
		kHeroTemporary09                   = 53,
		kHeroTemporary10                   = 54,
		kHeroTemporary11                   = 55,
		kHeroTemporary12                   = 56,
		kHeroTemporary13                   = 57,
		kHeroTemporary14                   = 58,
		kHeroTemporary15                   = 59,
		kHeroTemporary16                   = 60,
		kHeroTemporary17                   = 61,
		kHeroTemporary18                   = 62,
		kHeroTemporary19                   = 63,
		kHeroTemporary20                   = 64,
		kHeroTemporary21                   = 65,
		kHeroTemporary22                   = 66,
		kHeroTemporary23                   = 67,
		kHeroTemporary24                   = 68,
		kHeroTemporary25                   = 69,
		kHeroTemporary26                   = 70,
		kHeroTemporary27                   = 71,
		kHeroTemporary28                   = 72,
		kHeroTemporary29                   = 73,
		kHeroTemporary30                   = 74,
		kHeroTemporary31                   = 75,
		kHeroTemporary32                   = 76,
		kHeroTemporary33                   = 77,
		kHeroTemporary34                   = 78,
		kHeroTemporary35                   = 79,
		kHeroTemporary36                   = 80,
		kHeroTemporary37                   = 81,
		kHeroTemporary38                   = 82,
		kHeroTemporary39                   = 83,
		kHeroTemporary40                   = 84,
		kHeroTemporary41                   = 85,
		kHeroTemporary42                   = 86,
		kHeroTemporary43                   = 87,
		kHeroTemporary44                   = 88,
		kHeroTemporary45                   = 89,
		kHeroTemporary46                   = 90,
		kHeroTemporary47                   = 91,
		kHeroTemporary48                   = 92,
		kHeroTemporary49                   = 93,
		kHeroTemporary50                   = 94,
		kHeroTemporary51                   = 95,
		kHeroTemporary52                   = 96,
		kHeroTemporary53                   = 97,
		kHeroTemporary54                   = 98,
		kHeroTemporary55                   = 99,
		kHeroTemporary56                   = 100,
		kHeroTemporary57                   = 101,
		kHeroTemporary58                   = 102,
		kHeroTemporary59                   = 103,
		kHeroTemporary60                   = 104,
		kHeroTemporary61                   = 105,
		kHeroTemporary62                   = 106,
		kHeroTemporary63                   = 107,
		kHeroTemporary64                   = 108,
		kHeroTemporary65                   = 109,
		kHeroTemporary66                   = 110,
		kHeroTemporary67                   = 111,
		kHeroTemporary68                   = 112,
		kHeroTemporary69                   = 113,
		kHeroTemporary70                   = 114,
		kHeroTemporary71                   = 115,
		kHeroTemporary72                   = 116,
		kHeroTemporary73                   = 117,
		kHeroTemporary74                   = 118,
		kHeroTemporary75                   = 119,
		kHeroTemporary76                   = 120,
		kHeroTemporary77                   = 121,
		kHeroTemporary78                   = 122,
		kHeroTemporary79                   = 123,
		kHeroTemporaryEnd                  = 124,
		kItemTemporaryStart                = 125,
		kItemTemporary_01                  = 126,
		kItemTemporary_02                  = 127,
		kItemTemporary_03                  = 128,
		kItemTemporary_04                  = 129,
		kItemTemporary_05                  = 130,
		kItemTemporary_06                  = 131,
		kItemTemporary_07                  = 132,
		kItemTemporary_08                  = 133,
		kItemTemporary_09                  = 134,
		kItemTemporary                     = 135,
		kItemTemporary01                   = 136,
		kItemTemporary02                   = 137,
		kItemTemporary03                   = 138,
		kItemTemporary04                   = 139,
		kItemTemporary05                   = 140,
		kItemTemporary06                   = 141,
		kItemTemporary07                   = 142,
		kItemTemporary08                   = 143,
		kItemTemporary09                   = 144,
		kItemTemporary10                   = 145,
		kItemTemporaryEnd                  = 146,
		kItemPermanentStart                = 147,
		kItemPermanent_01                  = 148,
		kItemPermanent_02                  = 149,
		kItemPermanent_03                  = 150,
		kItemPermanent_04                  = 151,
		kItemPermanent_05                  = 152,
		kItemPermanent_06                  = 153,
		kItemPermanent_07                  = 154,
		kItemPermanent_08                  = 155,
		kItemPermanent_09                  = 156,
		kItemPermanent                     = 157,
		kItemPermanentEnd                  = 158,
		kSystemTemporaryStart              = 159,
		kSystem_Resurrection_01            = 160,
		kSystem_Resurrection_02            = 161,
		kSystem_Mount01                    = 162,
		kSystem_Mount02                    = 163,
		kSystem_Gliding                    = 164,
		kSystem_Dash                       = 165,
		kSystem_Swimming                   = 166,
		kSystemTemporaryEnd                = 167,
		kSystemPermanentStart              = 168,
		kSystem_Combat_Polymorph           = 169,
		kSystemPermanentEnd                = 170,
		kGlobalCooldownGroupForPacketStart = 171,
		MAX                                = 172
	};

	/**
	 * Enum TLScheme.ETLBodyType
	 */
	enum class ETLBodyType : uint8_t
	{
		kNone  = 0,
		kSmall = 1,
		kLarge = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.EPcStatsType
	 */
	enum class EPcStatsType : uint8_t
	{
		kNone                                 = 0,
		kSTR                                  = 1,
		kDEX                                  = 2,
		kINT                                  = 3,
		kPER                                  = 4,
		kAttackPowerMainHand                  = 5,
		kAttackPowerOffHand                   = 6,
		kBonusAttackPowerMainHand             = 7,
		kBonusAttackPowerOffHand              = 8,
		kAttackPowerModifier                  = 9,
		kAttackSpeedMainHand                  = 10,
		kAttackSpeedOffHand                   = 11,
		kAttackSpeedModifier                  = 12,
		kAttackSpeedModifierOffHand           = 13,
		kAttackRangeMainHand                  = 14,
		kAttackRangeOffHand                   = 15,
		kAttackRangeModifier                  = 16,
		kHpMax                                = 17,
		kHpMaxModifier                        = 18,
		kHpRegen                              = 19,
		kHpRegenModifier                      = 20,
		kPotionHealModifier                   = 21,
		kMagicDollHealModifier                = 22,
		kMeleeArmor                           = 23,
		kRangeArmor                           = 24,
		kMagicArmor                           = 25,
		kArmorModifier                        = 26,
		kAttackRating                         = 27,
		kShieldBlockChance                    = 28,
		kShieldBlockChancePenetration         = 29,
		kShieldBlockEfficiency                = 30,
		kCostMax                              = 31,
		kCostRegen                            = 32,
		kCostRegenModifier                    = 33,
		kCostSpend                            = 34,
		kCostConsumptionModifier              = 35,
		kMeleeCriticalAttack                  = 36,
		kRangeCriticalAttack                  = 37,
		kMagicCriticalAttack                  = 38,
		kMeleeCriticalDefense                 = 39,
		kRangeCriticalDefense                 = 40,
		kMagicCriticalDefense                 = 41,
		kMeleeDoubleAttack                    = 42,
		kRangeDoubleAttack                    = 43,
		kMagicDoubleAttack                    = 44,
		kMeleeDoubleDefense                   = 45,
		kRangeDoubleDefense                   = 46,
		kMagicDoubleDefense                   = 47,
		kMeleeAccuracy                        = 48,
		kRangeAccuracy                        = 49,
		kMagicAccuracy                        = 50,
		kMeleeEvasion                         = 51,
		kRangeEvasion                         = 52,
		kMagicEvasion                         = 53,
		kBossBonusAttackPower                 = 54,
		kBossDamageReduction                  = 55,
		kBossMeleeCriticalAttack              = 56,
		kBossRangeCriticalAttack              = 57,
		kBossMagicCriticalAttack              = 58,
		kBossMeleeCriticalDefense             = 59,
		kBossRangeCriticalDefense             = 60,
		kBossMagicCriticalDefense             = 61,
		kBossMeleeDoubleAttack                = 62,
		kBossRangeDoubleAttack                = 63,
		kBossMagicDoubleAttack                = 64,
		kBossMeleeDoubleDefense               = 65,
		kBossRangeDoubleDefense               = 66,
		kBossMagicDoubleDefense               = 67,
		kBossMeleeAccuracy                    = 68,
		kBossRangeAccuracy                    = 69,
		kBossMagicAccuracy                    = 70,
		kBossMeleeEvasion                     = 71,
		kBossRangeEvasion                     = 72,
		kBossMagicEvasion                     = 73,
		kPvPMeleeCriticalAttack               = 74,
		kPvPRangeCriticalAttack               = 75,
		kPvPMagicCriticalAttack               = 76,
		kPvPMeleeCriticalDefense              = 77,
		kPvPRangeCriticalDefense              = 78,
		kPvPMagicCriticalDefense              = 79,
		kPvPMeleeDoubleAttack                 = 80,
		kPvPRangeDoubleAttack                 = 81,
		kPvPMagicDoubleAttack                 = 82,
		kPvPMeleeDoubleDefense                = 83,
		kPvPRangeDoubleDefense                = 84,
		kPvPMagicDoubleDefense                = 85,
		kPvPMeleeAccuracy                     = 86,
		kPvPRangeAccuracy                     = 87,
		kPvPMagicAccuracy                     = 88,
		kPvPMeleeEvasion                      = 89,
		kPvPRangeEvasion                      = 90,
		kPvPMagicEvasion                      = 91,
		kMeleeDamageDealtModifier             = 92,
		kRangeDamageDealtModifier             = 93,
		kMagicDamageDealtModifier             = 94,
		kMeleeDamageTakenModifier             = 95,
		kRangeDamageTakenModifier             = 96,
		kMagicDamageTakenModifier             = 97,
		kCriticalDamageDealtModifier          = 98,
		kPvPDamageDealtModifier               = 99,
		kPvPDamageTakenModifier               = 100,
		kSkillPowerAmplification              = 101,
		kSkillPowerResistance                 = 102,
		kBuffGivenDurationModifier            = 103,
		kDebuffTakenDurationModifier          = 104,
		kAuraEffectBoost                      = 105,
		kAuraEffectBoostModifier              = 106,
		kAuraRadiusModifier                   = 107,
		kDamageReduction                      = 108,
		kGrankusDamageReduction               = 109,
		kEinardenDamageReduction              = 110,
		kDragonDamageReduction                = 111,
		kDemonDamageReduction                 = 112,
		kUndeadDamageReduction                = 113,
		kCreationDamageReduction              = 114,
		kSpiritDamageReduction                = 115,
		kAnimalDamageReduction                = 116,
		kInsectDamageReduction                = 117,
		kPlantDamageReduction                 = 118,
		kDamageReductionPenetration           = 119,
		kBonusGrankusAttackPower              = 120,
		kBonusEinardenAttackPower             = 121,
		kBonusDragonAttackPower               = 122,
		kBonusDemonAttackPower                = 123,
		kBonusUndeadAttackPower               = 124,
		kBonusCreationAttackPower             = 125,
		kBonusSpiritAttackPower               = 126,
		kBonusAnimalAttackPower               = 127,
		kBonusInsectAttackPower               = 128,
		kBonusPlantAttackPower                = 129,
		kWeakenAccuracy                       = 130,
		kWeakenTolerance                      = 131,
		kStunAccuracy                         = 132,
		kStunTolerance                        = 133,
		kPetrificationAccuracy                = 134,
		kPetrificationTolerance               = 135,
		kSleepAccuracy                        = 136,
		kSleepTolerance                       = 137,
		kSilenceAccuracy                      = 138,
		kSilenceTolerance                     = 139,
		kBindAccuracy                         = 140,
		kBindTolerance                        = 141,
		kBlindAccuracy                        = 142,
		kBlindTolerance                       = 143,
		kCollideAmplification                 = 144,
		kCollideResistance                    = 145,
		kWeakenCriticalAttack                 = 146,
		kWeakenCriticalDefense                = 147,
		kStunCriticalAttack                   = 148,
		kStunCriticalDefense                  = 149,
		kPetrificationCriticalAttack          = 150,
		kPetrificationCriticalDefense         = 151,
		kSleepCriticalAttack                  = 152,
		kSleepCriticalDefense                 = 153,
		kSilenceCriticalAttack                = 154,
		kSilenceCriticalDefense               = 155,
		kBindCriticalAttack                   = 156,
		kBindCriticalDefense                  = 157,
		kBlindCriticalAttack                  = 158,
		kBlindCriticalDefense                 = 159,
		kWeakenDoubleAttack                   = 160,
		kWeakenDoubleDefense                  = 161,
		kStunDoubleAttack                     = 162,
		kStunDoubleDefense                    = 163,
		kPetrificationDoubleAttack            = 164,
		kPetrificationDoubleDefense           = 165,
		kSleepDoubleAttack                    = 166,
		kSleepDoubleDefense                   = 167,
		kSilenceDoubleAttack                  = 168,
		kSilenceDoubleDefense                 = 169,
		kBindDoubleAttack                     = 170,
		kBindDoubleDefense                    = 171,
		kBlindDoubleAttack                    = 172,
		kBlindDoubleDefense                   = 173,
		kStunImmune                           = 174,
		kPetrificationImmune                  = 175,
		kSleepImmune                          = 176,
		kSilenceImmune                        = 177,
		kBindImmune                           = 178,
		kBlindImmune                          = 179,
		kCollideImmune                        = 180,
		kMoveSpeed                            = 181,
		kMoveSpeedModifier                    = 182,
		kDashFastMoveSpeedModifier            = 183,
		kDashNormalMoveSpeedModifier          = 184,
		kSwimFastMoveSpeedModifier            = 185,
		kSwimNormalMoveSpeedModifier          = 186,
		kGlideFastMoveSpeedModifier           = 187,
		kGlideNormalMoveSpeedModifier         = 188,
		kBelongingWeightCap                   = 189,
		kHealTakenModifier                    = 190,
		kDamageBoostChance                    = 191,
		kDamageBoostScale                     = 192,
		kPrimeAttackDamageBoostChance         = 193,
		kPrimeAttackDamageBoostScale          = 194,
		kAdjustExpAcquired                    = 195,
		kAdjustGoldAcquired                   = 196,
		kAdjustItemDrop                       = 197,
		kAdjustGoldDrop                       = 198,
		kAdjustResourceDrop                   = 199,
		kEarnWeaponMasteryExpModifier         = 200,
		kEarnDungeonPointModifier             = 201,
		kSpendDungeonPointModifier            = 202,
		kGatheringSpeed                       = 203,
		kGatheringSpeedModifier               = 204,
		kGatheringDoubleChance                = 205,
		kGatheringCriticalChance              = 206,
		kAggroModifier                        = 207,
		kHealModifier                         = 208,
		kSkillHealTakenModifier               = 209,
		kSkillCooldownModifier                = 210,
		kGlobalSkillCooldownModifier          = 211,
		kWildPolymorphSkillCooldownModifier   = 212,
		kPolymorphDuration                    = 213,
		kStaminaMax                           = 214,
		kStaminaRegen                         = 215,
		kStaminaRegenModifier                 = 216,
		kStaminaConsumption                   = 217,
		kStaminaConsumptionModifier           = 218,
		kHittedStopDurationModifier           = 219,
		kHittedStopPreventChance              = 220,
		kCompletelyHitChance                  = 221,
		kHp                                   = 222,
		kCost                                 = 223,
		kStamina                              = 224,
		kBelongingWeight                      = 225,
		kClientDualAttackChance               = 226,
		kClientCombatPower                    = 227,
		kEvasion                              = 228,
		kDeactivatedWeaponAttackRangeMainHand = 229,
		kDeactivatedWeaponAttackRangeOffHand  = 230,
		kDeactivatedWeaponAttackRangeModifier = 231,
		kEndOfEnum                            = 232,
		MAX                                   = 233
	};

	/**
	 * Enum TLScheme.ETLUIStatsValueType
	 */
	enum class ETLUIStatsValueType : uint8_t
	{
		PcStats    = 0,
		CustomText = 1,
		MAX        = 2
	};

	/**
	 * Enum TLScheme.ETLPolymorphLayer
	 */
	enum class ETLPolymorphLayer : uint8_t
	{
		Default   = 0,
		Normal    = 1,
		Special   = 2,
		Grave     = 3,
		EndOfEnum = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.EPolymorphGrade
	 */
	enum class EPolymorphGrade : uint8_t
	{
		kC         = 0,
		kB         = 1,
		kA         = 2,
		kAA        = 3,
		kAAA       = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ETLMagicDollReactionType
	 */
	enum class ETLMagicDollReactionType : uint8_t
	{
		PlaySceneConti              = 0,
		StopMovingAndPlaySceneConti = 1,
		ActionCustom                = 2,
		MAX                         = 3
	};

	/**
	 * Enum TLScheme.ETLMagicDollEmotion
	 */
	enum class ETLMagicDollEmotion : uint8_t
	{
		Boast   = 0,
		Cute    = 1,
		Comfort = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.ETLMagicPortalDistance
	 */
	enum class ETLMagicPortalDistance : uint8_t
	{
		NearDistance   = 0,
		MiddleDistance = 1,
		LongDistance   = 2,
		MAX            = 3
	};

	/**
	 * Enum TLScheme.ETLConditionEquipment
	 */
	enum class ETLConditionEquipment : uint8_t
	{
		None     = 0,
		Any      = 1,
		MainHand = 2,
		OffHand  = 3,
		Head     = 4,
		Back     = 5,
		Chest    = 6,
		Legs     = 7,
		Hands    = 8,
		Feet     = 9,
		Ear1     = 10,
		Ear2     = 11,
		Neck     = 12,
		Wrist    = 13,
		Finger1  = 14,
		Finger2  = 15,
		Seal1    = 16,
		Seal2    = 17,
		Seal3    = 18,
		Seal4    = 19,
		Seal5    = 20,
		Ammo     = 21,
		Max      = 22
	};

	/**
	 * Enum TLScheme.ETLConditionAnyYesNo
	 */
	enum class ETLConditionAnyYesNo : uint8_t
	{
		None = 0,
		Any  = 1,
		Yes  = 2,
		No   = 3,
		Max  = 4
	};

	/**
	 * Enum TLScheme.ETLConditionAlignment
	 */
	enum class ETLConditionAlignment : uint8_t
	{
		None                 = 0,
		Any                  = 1,
		Lawful               = 2,
		Neutral              = 3,
		Chaotic              = 4,
		LawfulInSelfDefense  = 5,
		NeutralInSelfDefense = 6,
		Max                  = 7
	};

	/**
	 * Enum TLScheme.ETLConditionWeather
	 */
	enum class ETLConditionWeather : uint8_t
	{
		None    = 0,
		Any     = 1,
		Normal  = 2,
		Rain    = 3,
		Thunder = 4,
		Snow    = 5,
		Indoor  = 6,
		Max     = 7
	};

	/**
	 * Enum TLScheme.ETLConditionTimeOfDay
	 */
	enum class ETLConditionTimeOfDay : uint8_t
	{
		None    = 0,
		Any     = 1,
		Sunrise = 2,
		Day     = 3,
		Sunset  = 4,
		Night   = 5,
		Max     = 6
	};

	/**
	 * Enum TLScheme.ETLCraftingResultType
	 */
	enum class ETLCraftingResultType : uint8_t
	{
		Success         = 0,
		CriticalSuccess = 1,
		Failure         = 2,
		MAX             = 3
	};

	/**
	 * Enum TLScheme.EEnchantResultType
	 */
	enum class EEnchantResultType : uint8_t
	{
		C    = 0,
		B    = 1,
		A    = 2,
		S    = 3,
		F    = 4,
		None = 5,
		MAX  = 6
	};

	/**
	 * Enum TLScheme.ETLMagicDollZOffsetApply
	 */
	enum class ETLMagicDollZOffsetApply : uint8_t
	{
		Set                = 0,
		ScaleToOwnerHeight = 1,
		LongDistance       = 2,
		MAX                = 3
	};

	/**
	 * Enum TLScheme.ESpeciesGroup
	 */
	enum class ESpeciesGroup : uint8_t
	{
		kNone      = 0,
		kGrankus   = 1,
		kEinarden  = 2,
		kDragon    = 3,
		kDemon     = 4,
		kUndead    = 5,
		kCreation  = 6,
		kSpirit    = 7,
		kAnimal    = 8,
		kInsect    = 9,
		kPlant     = 10,
		kEndOfEnum = 11,
		MAX        = 12
	};

	/**
	 * Enum TLScheme.EMagicDollGrade
	 */
	enum class EMagicDollGrade : uint8_t
	{
		kC         = 0,
		kB         = 1,
		kA         = 2,
		kAA        = 3,
		kAAA       = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.EMapRegionType
	 */
	enum class EMapRegionType : uint8_t
	{
		kPeace     = 0,
		kConflict  = 1,
		kSafety    = 2,
		kFreeDuel  = 3,
		kWar       = 4,
		kCombat    = 5,
		kEndOfEnum = 6,
		MAX        = 7
	};

	/**
	 * Enum TLScheme.ESkillSlot
	 */
	enum class ESkillSlot : uint8_t
	{
		kButton01          = 0,
		kButton02          = 1,
		kButton03          = 2,
		kButton04          = 3,
		kButton05          = 4,
		kButton06          = 5,
		kButton07          = 6,
		kButton08          = 7,
		kButton09          = 8,
		kButton10          = 9,
		kButton11          = 10,
		kButton12          = 11,
		kButton13          = 12,
		kButton14          = 13,
		kButton15          = 14,
		kButton16          = 15,
		kButton17          = 16,
		kButton18          = 17,
		kButton19          = 18,
		kButton20          = 19,
		kButton21          = 20,
		kButton22          = 21,
		kButton23          = 22,
		kButton24          = 23,
		kButton25          = 24,
		kButton26          = 25,
		kButton27          = 26,
		kButton28          = 27,
		kButton29          = 28,
		kButton30          = 29,
		kButton31          = 30,
		kButton32          = 31,
		kButton33          = 32,
		kButton34          = 33,
		kButton35          = 34,
		kButton36          = 35,
		kButton37          = 36,
		kButton38          = 37,
		kButton39          = 38,
		kButton40          = 39,
		kButton41          = 40,
		kAura01            = 41,
		kAura02            = 42,
		kAura03            = 43,
		kAura04            = 44,
		kAura05            = 45,
		kRanker1           = 46,
		kRanker2           = 47,
		kRanker3           = 48,
		kPolymorph         = 49,
		kDash              = 50,
		kWaitRiding        = 51,
		kNotAssigned       = 52,
		kEndOfEnum         = 53,
		kError             = 54,
		kPassiveSkillStart = 55,
		kAuraSkillStart    = 56,
		kPassiveSkillEnd   = 57,
		kRankerSkillStart  = 58,
		kRankerSkillEnd    = 59,
		MAX                = 60
	};

	/**
	 * Enum TLScheme.EWeaponCategory
	 */
	enum class EWeaponCategory : uint8_t
	{
		kNone      = 0,
		kDagger    = 1,
		kSword     = 2,
		kShield    = 3,
		kSword2h   = 4,
		kStaff     = 5,
		kBow       = 6,
		kCrossbow  = 7,
		kGrimoire  = 8,
		kWand      = 9,
		kScroll    = 10,
		kSpear     = 11,
		kEndOfEnum = 12,
		MAX        = 13
	};

	/**
	 * Enum TLScheme.EBool
	 */
	enum class EBool : uint8_t
	{
		F   = 0,
		T   = 1,
		MAX = 2
	};

	/**
	 * Enum TLScheme.EMoneyType
	 */
	enum class EMoneyType : uint8_t
	{
		kGold             = 0,
		kContractCoin     = 1,
		kGuildCoin        = 2,
		kBmCoin           = 3,
		kLostAndFoundCoin = 4,
		kSocialCoin       = 5,
		kDiamond          = 6,
		kMax              = 7,
		kNone             = 8,
		MAX               = 9
	};

	/**
	 * Enum TLScheme.ETradeCategory
	 */
	enum class ETradeCategory : uint8_t
	{
		kError                   = 0,
		kSword                   = 1,
		kShield                  = 2,
		kSword2h                 = 3,
		kDagger                  = 4,
		kBow                     = 5,
		kCrossbow                = 6,
		kStaff                   = 7,
		kWand                    = 8,
		kGrimoire                = 9,
		kHead                    = 10,
		kChest                   = 11,
		kHands                   = 12,
		kLegs                    = 13,
		kFeet                    = 14,
		kCloak                   = 15,
		kEarring                 = 16,
		kNecklace                = 17,
		kBelt                    = 18,
		kBracelet                = 19,
		kRing                    = 20,
		kSeal                    = 21,
		kCrest                   = 22,
		kEnchantScroll           = 23,
		kFood                    = 24,
		kPotion                  = 25,
		kCraftingRecipe          = 26,
		kMaterial                = 27,
		kMisc                    = 28,
		kScroll                  = 29,
		kShirt                   = 30,
		kContractScroll          = 31,
		kSkillScrollCommon       = 32,
		kSkillScrollSword        = 33,
		kSkillScrollShield       = 34,
		kSkillScrollDagger       = 35,
		kSkillScrollCrossbow     = 36,
		kSkillScrollWand         = 37,
		kSkillScrollGrimoire     = 38,
		kSkillScrollSword2h      = 39,
		kSkillScrollBow          = 40,
		kSkillScrollStaff        = 41,
		kSkillScrollScroll       = 42,
		kPolymorphEnchantCommon  = 43,
		kPolymorphEnchantStr     = 44,
		kPolymorphEnchantDex     = 45,
		kPolymorphEnchantCon     = 46,
		kPolymorphEnchantInt     = 47,
		kPolymorphEnchantWis     = 48,
		kPolymorphEnchantCha     = 49,
		kWeaponMastery           = 50,
		kPolymorphEnchantControl = 51,
		kPolymorphEnchantAttack  = 52,
		kPolymorphEnchantMove    = 53,
		kPolymorphEnchantDefense = 54,
		kPolymorphEnchantWeak    = 55,
		kSpear                   = 56,
		kPotionElixir            = 57,
		kPotionHeal              = 58,
		kPotionLeaf              = 59,
		kEnchantPoint            = 60,
		kMaterialMain            = 61,
		kMaterialPowder          = 62,
		kMaterialSkillpaper      = 63,
		kMaterialJewel           = 64,
		kMaterialSub             = 65,
		kMaterialFood            = 66,
		kMaterialEtc             = 67,
		kSkillPointCommon        = 68,
		kMax                     = 69,
		kNone                    = 70,
		MAX                      = 71
	};

	/**
	 * Enum TLScheme.ETLSetAliveSource
	 */
	enum class ETLSetAliveSource : uint8_t
	{
		None        = 0,
		EnterPacket = 1,
		Playing     = 2,
		MAX         = 3
	};

	/**
	 * Enum TLScheme.EFoSubType
	 */
	enum class EFoSubType : uint8_t
	{
		None          = 0,
		Mineral       = 1,
		Herb          = 2,
		Wood          = 3,
		Cactus        = 4,
		Mushroom      = 5,
		Throne        = 6,
		Resurrection  = 7,
		Plunder       = 8,
		Investigation = 9,
		TimeTravel    = 10,
		Outpost       = 11,
		Hook          = 12,
		DropFo        = 13,
		UnderCover    = 14,
		GuildSkillFo  = 15,
		kEndOfEnum    = 16,
		MAX           = 17
	};

	/**
	 * Enum TLScheme.ETLCreatureRank
	 */
	enum class ETLCreatureRank : uint8_t
	{
		NoRank     = 0,
		Solo       = 1,
		SoloElite  = 2,
		Party      = 3,
		PartyElite = 4,
		Boss       = 5,
		BossWorld  = 6,
		EndOfEnum  = 7,
		MAX        = 8
	};

	/**
	 * Enum TLScheme.EWorldObjectType
	 */
	enum class EWorldObjectType : uint8_t
	{
		None      = 0,
		PC        = 1,
		NPC       = 2,
		FO        = 3,
		Item      = 4,
		Area      = 5,
		Global    = 6,
		Effect    = 7,
		Carrier   = 8,
		MagicDoll = 9,
		MAX       = 10
	};

	/**
	 * Enum TLScheme.ECriminalType
	 */
	enum class ECriminalType : uint8_t
	{
		kNeutral              = 0,
		kLawfulInSelfDefense  = 1,
		kNeutralInSelfDefense = 2,
		kChaotic              = 3,
		kLawful               = 4,
		kEndOfEnum            = 5,
		MAX                   = 6
	};

	/**
	 * Enum TLScheme.ETLRewardGroup
	 */
	enum class ETLRewardGroup : uint8_t
	{
		A    = 0,
		B    = 1,
		C    = 2,
		D    = 3,
		E    = 4,
		F    = 5,
		G    = 6,
		H    = 7,
		I    = 8,
		J    = 9,
		Side = 10,
		MAX  = 11
	};

	/**
	 * Enum TLScheme.EEquipCategory
	 */
	enum class EEquipCategory : uint8_t
	{
		kMainHand   = 0,
		kOffHand    = 1,
		kHead       = 2,
		kBack       = 3,
		kChest      = 4,
		kLegs       = 5,
		kHands      = 6,
		kFeet       = 7,
		kEar1       = 8,
		kEar2       = 9,
		kNeck       = 10,
		kWrist      = 11,
		kFinger1    = 12,
		kFinger2    = 13,
		kSeal       = 14,
		kCrest      = 15,
		kShirt      = 16,
		kBelt       = 17,
		kFishingRod = 18,
		kAmmo       = 19,
		kEndOfEnum  = 20,
		MAX         = 21
	};

	/**
	 * Enum TLScheme.ETLContentsOpenType
	 */
	enum class ETLContentsOpenType : uint8_t
	{
		NONE                    = 0,
		GUILD                   = 1,
		CODEX                   = 2,
		COLLECTION              = 3,
		MAGIC_DOLL              = 4,
		POLYMORPH               = 5,
		CRAFT                   = 6,
		WORLD_MAP               = 7,
		MINI_MAP                = 8,
		RANKING                 = 9,
		MARKET                  = 10,
		CONTRACT                = 11,
		CONTRACT_GUILD          = 12,
		COMBAT_ASSIST           = 13,
		TARGET_SCANNER          = 14,
		CHATTING                = 15,
		SKILL                   = 16,
		MEMORIAL                = 17,
		PVP_RECORD              = 18,
		WEAPON_MASTERY          = 19,
		PC_RELATIONSHIP         = 20,
		INVENTORY               = 21,
		CHARACTER               = 22,
		GUILDUNION              = 23,
		HERPY_MK1               = 24,
		HERPY_MK2               = 25,
		HERPY_MK3               = 26,
		HERPY_MK4               = 27,
		HERPY_MK5               = 28,
		HERPY_MK6               = 29,
		HERPY_COMPLETE          = 30,
		TIMETABLE               = 31,
		WEAPONSWAP              = 32,
		ATTENDANCE              = 33,
		ABYSS_POINT             = 34,
		POST                    = 35,
		MOBILITY_POLYMORPH      = 36,
		PURCHASE                = 37,
		PartyAssist             = 38,
		AUTO_PATH               = 39,
		MONEY                   = 40,
		PIN                     = 41,
		SAVEPLACE               = 42,
		COMPASS                 = 43,
		CONTENTS_WINDOW         = 44,
		HUB_MENU                = 45,
		SEASON_PASS             = 46,
		TIMELIMIT_DUNGEON       = 47,
		GUILDHOME               = 48,
		RETURNWARP              = 49,
		ENCHANT                 = 50,
		GATHERING               = 51,
		TREASURE_BOX            = 52,
		CONTENTS_ALARM          = 53,
		MAGIC_DOLL_AUTO_PICK_UP = 54,
		CODEX_ACHIEVEMENT       = 55,
		CODEX_COLLECTION        = 56,
		GROWTHPASS              = 57,
		WORLD_CHAT              = 58,
		SYSTEM_HERPY_COMPLETE   = 59,
		FIXED_QUICKSLOT         = 60,
		HUD_CUSTOMIZE           = 61,
		BOUTIQUE                = 62,
		COUPON                  = 63,
		ROTATION_EVENT          = 64,
		EVETN_CALENDAR          = 65,
		WORLD_EVENT             = 66,
		CONTRACT_BM             = 67,
		PARTY                   = 68,
		TYPE_MAX                = 69,
		MAX                     = 70
	};

	/**
	 * Enum TLScheme.ESlotType
	 */
	enum class ESlotType : uint8_t
	{
		kError                 = 0,
		kQuickSlotPrimeSkill   = 1,
		kQuickSlotSkill        = 2,
		kQuickSlotPassiveSkill = 3,
		kQuickSlotAuraSkill    = 4,
		kQuickSlotSpecialSkill = 5,
		kQuickSlotItem         = 6,
		kInventory             = 7,
		kEquipment             = 8,
		kRestoration           = 9,
		kCrafting              = 10,
		kCraftingResult        = 11,
		kDeathPenalty          = 12,
		kEnchant               = 13,
		kSkillSetPassive       = 14,
		kSkillSetActive        = 15,
		kSkillSetAura          = 16,
		kPolymorph             = 17,
		MAX                    = 18
	};

	/**
	 * Enum TLScheme.ETLTopLevelAnalogCursorState
	 */
	enum class ETLTopLevelAnalogCursorState : uint8_t
	{
		None             = 0,
		Show             = 1,
		Hide             = 2,
		ShowAndForceMove = 3,
		MAX              = 4
	};

	/**
	 * Enum TLScheme.ETLUIPlatform
	 */
	enum class ETLUIPlatform : uint8_t
	{
		PC        = 0,
		Console   = 1,
		Mobile    = 2,
		EndOfEnum = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ETutorialActiveType
	 */
	enum class ETutorialActiveType : uint8_t
	{
		kNormal             = 0,
		kPopupWindow        = 1,
		kHudMainMenu        = 2,
		kWidget             = 3,
		kCustom             = 4,
		kSubType            = 5,
		kSystemMessageGuide = 6,
		MAX                 = 7
	};

	/**
	 * Enum TLScheme.ETLPolymorphEntryType
	 */
	enum class ETLPolymorphEntryType : uint8_t
	{
		Combat    = 0,
		Dash      = 1,
		Glide     = 2,
		Swim      = 3,
		Social    = 4,
		None      = 5,
		EndOfEnum = 6,
		MAX       = 7
	};

	/**
	 * Enum TLScheme.ETLKeyIconType
	 */
	enum class ETLKeyIconType : uint8_t
	{
		Default  = 0,
		Small    = 1,
		Tutorial = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.EActionKeyVisibleType
	 */
	enum class EActionKeyVisibleType : uint8_t
	{
		kAlwaysChangeIcon      = 0,
		kAlways                = 1,
		kChangeIcon            = 2,
		kOnlyGamepad           = 3,
		kOnlyKeyboardMouse     = 4,
		kIconOnlyGamepad       = 5,
		kIconOnlyKeyboardMouse = 6,
		kDoNotChangeVislbe     = 7,
		MAX                    = 8
	};

	/**
	 * Enum TLScheme.ETLContentsMarkerType
	 */
	enum class ETLContentsMarkerType : uint8_t
	{
		kNone             = 0,
		kDynamicEvent     = 1,
		kInsGuideEvent    = 2,
		kCodexAdventure   = 3,
		kCodexAchievement = 4,
		kNpcContract      = 5,
		kItemContract     = 6,
		kGuildContract    = 7,
		kResourceObject   = 8,
		kInfinityDungeon  = 9,
		kMax              = 10,
		MAX               = 11
	};

	/**
	 * Enum TLScheme.EItemAttrType
	 */
	enum class EItemAttrType : uint8_t
	{
		kNone                         = 0,
		kAttackSpeed                  = 1,
		kAttackRange                  = 2,
		kHpMax                        = 3,
		kCostMax                      = 4,
		kCostRegen                    = 5,
		kArmorClass                   = 6,
		kPotionHealModifier           = 7,
		kAttackPower                  = 8,
		kMeleeAccuracy                = 9,
		kRangeAccuracy                = 10,
		kMagicAccuracy                = 11,
		kCriticalAttack               = 12,
		kCriticalDefense              = 13,
		kDamageReduction              = 14,
		kShieldBlockChance            = 15,
		kBlockEfficiency              = 16,
		kAttackRating                 = 17,
		kSTR                          = 18,
		kDEX                          = 19,
		kINT                          = 20,
		kPER                          = 21,
		kAttackRangeMod               = 22,
		kAttackSpeedMod               = 23,
		kHpRegen                      = 24,
		kCostConsumptionModifier      = 25,
		kStaminaMax                   = 26,
		kStaminaRegen                 = 27,
		kSkillCooldownModifier        = 28,
		kMoveSpeedMod                 = 29,
		kFireAmplification            = 30,
		kWaterAmplification           = 31,
		kWindAmplification            = 32,
		kEarthAmplification           = 33,
		kFireResistance               = 34,
		kWaterResistance              = 35,
		kWindResistance               = 36,
		kEarthResistance              = 37,
		kAdjustExpAcquired            = 38,
		kAdjustGoldAcquired           = 39,
		kAdjustGoldDrop               = 40,
		kAdjustItemDrop               = 41,
		kAdjustResourceDrop           = 42,
		kCollideAmplification         = 43,
		kCollideResistance            = 44,
		kMeleeEvasion                 = 45,
		kRangeEvasion                 = 46,
		kMagicEvasion                 = 47,
		kDamageReductionPenetration   = 48,
		kBelongingWeightCap           = 49,
		kBonusAttackPower             = 50,
		kGrankusBonusAttackPower      = 51,
		kEinardenBonusAttackPower     = 52,
		kDragonBonusAttackPower       = 53,
		kDemonBonusAttackPower        = 54,
		kUndeadBonusAttackPower       = 55,
		kCreationBonusAttackPower     = 56,
		kSpiritBonusAttackPower       = 57,
		kAnimalBonusAttackPower       = 58,
		kInsectBonusAttackPower       = 59,
		kPlantBonusAttackPower        = 60,
		kGrankusDamageReduction       = 61,
		kEinardenDamageReduction      = 62,
		kDragonDamageReduction        = 63,
		kDemonDamageReduction         = 64,
		kUndeadDamageReduction        = 65,
		kCreationDamageReduction      = 66,
		kSpiritDamageReduction        = 67,
		kAnimalDamageReduction        = 68,
		kInsectDamageReduction        = 69,
		kPlantDamageReduction         = 70,
		kWeakenAccuracy               = 71,
		kStunAccuracy                 = 72,
		kPetrificationAccuracy        = 73,
		kSleepAccuracy                = 74,
		kSilenceAccuracy              = 75,
		kBindAccuracy                 = 76,
		kBlindAccuracy                = 77,
		kWeakenTolerance              = 78,
		kStunTolerance                = 79,
		kPetrificationTolerance       = 80,
		kSleepTolerance               = 81,
		kSilenceTolerance             = 82,
		kBindTolerance                = 83,
		kBlindTolerance               = 84,
		kDoubleAttack                 = 85,
		kDoubleDefense                = 86,
		kAttackPowerModifier          = 87,
		kMagicDollHealModifier        = 88,
		kMeleeArmor                   = 89,
		kRangeArmor                   = 90,
		kMagicArmor                   = 91,
		kMeleeCriticalAttack          = 92,
		kRangeCriticalAttack          = 93,
		kMagicCriticalAttack          = 94,
		kMeleeCriticalDefense         = 95,
		kRangeCriticalDefense         = 96,
		kMagicCriticalDefense         = 97,
		kMeleeDoubleAttack            = 98,
		kRangeDoubleAttack            = 99,
		kMagicDoubleAttack            = 100,
		kMeleeDoubleDefense           = 101,
		kRangeDoubleDefense           = 102,
		kMagicDoubleDefense           = 103,
		kBossMeleeCriticalAttack      = 104,
		kBossRangeCriticalAttack      = 105,
		kBossMagicCriticalAttack      = 106,
		kBossMeleeCriticalDefense     = 107,
		kBossRangeCriticalDefense     = 108,
		kBossMagicCriticalDefense     = 109,
		kBossMeleeDoubleAttack        = 110,
		kBossRangeDoubleAttack        = 111,
		kBossMagicDoubleAttack        = 112,
		kBossMeleeDoubleDefense       = 113,
		kBossRangeDoubleDefense       = 114,
		kBossMagicDoubleDefense       = 115,
		kPvPMeleeCriticalAttack       = 116,
		kPvPRangeCriticalAttack       = 117,
		kPvPMagicCriticalAttack       = 118,
		kPvPMeleeCriticalDefense      = 119,
		kPvPRangeCriticalDefense      = 120,
		kPvPMagicCriticalDefense      = 121,
		kPvPMeleeDoubleAttack         = 122,
		kPvPRangeDoubleAttack         = 123,
		kPvPMagicDoubleAttack         = 124,
		kPvPMeleeDoubleDefense        = 125,
		kPvPRangeDoubleDefense        = 126,
		kPvPMagicDoubleDefense        = 127,
		kDashFastMoveSpeedModifier    = 128,
		kDashNormalMoveSpeedModifier  = 129,
		kSwimFastMoveSpeedModifier    = 130,
		kSwimNormalMoveSpeedModifier  = 131,
		kGlideFastMoveSpeedModifier   = 132,
		kGlideNormalMoveSpeedModifier = 133,
		kAttackPowerMainHand          = 134,
		kAttackPowerOffHand           = 135,
		kBonusAttackPowerMainHand     = 136,
		kBonusAttackPowerOffHand      = 137,
		kAttackSpeedMainHand          = 138,
		kAttackSpeedOffHand           = 139,
		kAttackRangeMainHand          = 140,
		kAttackRangeOffHand           = 141,
		kEndOfEnum                    = 142,
		MAX                           = 143
	};

	/**
	 * Enum TLScheme.EItemTraitStats
	 */
	enum class EItemTraitStats : uint8_t
	{
		kNone                               = 0,
		kSTR                                = 1,
		kDEX                                = 2,
		kINT                                = 3,
		kPER                                = 4,
		kAttackPowerMainhand                = 5,
		kAttackPowerOffhand                 = 6,
		kBonusAttackPowerMainhand           = 7,
		kBonusAttackPowerOffhand            = 8,
		kAttackPowerModifier                = 9,
		kAttackSpeedMain                    = 10,
		kAttackSpeedOff                     = 11,
		kAttackSpeedModifier                = 12,
		kAttackSpeedModifierOffHand         = 13,
		kAttackRangeMain                    = 14,
		kAttackRangeOff                     = 15,
		kAttackRangeModifier                = 16,
		kHpMax                              = 17,
		kHpMaxModifier                      = 18,
		kHpRegen                            = 19,
		kHpRegenModifier                    = 20,
		kPotionHealModifier                 = 21,
		kMagicDollHealModifier              = 22,
		kMeleeArmor                         = 23,
		kRangeArmor                         = 24,
		kMagicArmor                         = 25,
		kArmorModifier                      = 26,
		kAttackRating                       = 27,
		kShieldBlockChance                  = 28,
		kShieldBlockChancePenetration       = 29,
		kShieldBlockEfficiency              = 30,
		kCostMax                            = 31,
		kCostRegen                          = 32,
		kCostRegenModifier                  = 33,
		kCostSpend                          = 34,
		kCostConsumptionModifier            = 35,
		kMeleeCriticalAttack                = 36,
		kRangeCriticalAttack                = 37,
		kMagicCriticalAttack                = 38,
		kMeleeCriticalDefense               = 39,
		kRangeCriticalDefense               = 40,
		kMagicCriticalDefense               = 41,
		kMeleeDoubleAttack                  = 42,
		kRangeDoubleAttack                  = 43,
		kMagicDoubleAttack                  = 44,
		kMeleeDoubleDefense                 = 45,
		kRangeDoubleDefense                 = 46,
		kMagicDoubleDefense                 = 47,
		kMeleeAccuracy                      = 48,
		kRangeAccuracy                      = 49,
		kMagicAccuracy                      = 50,
		kMeleeEvasion                       = 51,
		kRangeEvasion                       = 52,
		kMagicEvasion                       = 53,
		kBossBonusAttackPower               = 54,
		kBossDamageReduction                = 55,
		kBossMeleeCriticalAttack            = 56,
		kBossRangeCriticalAttack            = 57,
		kBossMagicCriticalAttack            = 58,
		kBossMeleeCriticalDefense           = 59,
		kBossRangeCriticalDefense           = 60,
		kBossMagicCriticalDefense           = 61,
		kBossMeleeDoubleAttack              = 62,
		kBossRangeDoubleAttack              = 63,
		kBossMagicDoubleAttack              = 64,
		kBossMeleeDoubleDefense             = 65,
		kBossRangeDoubleDefense             = 66,
		kBossMagicDoubleDefense             = 67,
		kBossMeleeAccuracy                  = 68,
		kBossRangeAccuracy                  = 69,
		kBossMagicAccuracy                  = 70,
		kBossMeleeEvasion                   = 71,
		kBossRangeEvasion                   = 72,
		kBossMagicEvasion                   = 73,
		kPvPMeleeCriticalAttack             = 74,
		kPvPRangeCriticalAttack             = 75,
		kPvPMagicCriticalAttack             = 76,
		kPvPMeleeCriticalDefense            = 77,
		kPvPRangeCriticalDefense            = 78,
		kPvPMagicCriticalDefense            = 79,
		kPvPMeleeDoubleAttack               = 80,
		kPvPRangeDoubleAttack               = 81,
		kPvPMagicDoubleAttack               = 82,
		kPvPMeleeDoubleDefense              = 83,
		kPvPRangeDoubleDefense              = 84,
		kPvPMagicDoubleDefense              = 85,
		kPvPMeleeAccuracy                   = 86,
		kPvPRangeAccuracy                   = 87,
		kPvPMagicAccuracy                   = 88,
		kPvPMeleeEvasion                    = 89,
		kPvPRangeEvasion                    = 90,
		kPvPMagicEvasion                    = 91,
		kMeleeDamageDealtModifier           = 92,
		kRangeDamageDealtModifier           = 93,
		kMagicDamageDealtModifier           = 94,
		kMeleeDamageTakenModifier           = 95,
		kRangeDamageTakenModifier           = 96,
		kMagicDamageTakenModifier           = 97,
		kCriticalDamageDealtModifier        = 98,
		kPvPDamageDealtModifier             = 99,
		kPvPDamageTakenModifier             = 100,
		kSkillPowerAmplification            = 101,
		kSkillPowerResistance               = 102,
		kBuffGivenDurationModifier          = 103,
		kDebuffTakenDurationModifier        = 104,
		kAuraEffectBoost                    = 105,
		kAuraEffectBoostModifier            = 106,
		kAuraRadiusModifier                 = 107,
		kDamageReduction                    = 108,
		kGrankusDamageReduction             = 109,
		kEinardenDamageReduction            = 110,
		kDragonDamageReduction              = 111,
		kDemonDamageReduction               = 112,
		kUndeadDamageReduction              = 113,
		kCreationDamageReduction            = 114,
		kSpiritDamageReduction              = 115,
		kAnimalDamageReduction              = 116,
		kInsectDamageReduction              = 117,
		kPlantDamageReduction               = 118,
		kDamageReductionPenetration         = 119,
		kBonusGrankusAttackPower            = 120,
		kBonusEinardenAttackPower           = 121,
		kBonusDragonAttackPower             = 122,
		kBonusDemonAttackPower              = 123,
		kBonusUndeadAttackPower             = 124,
		kBonusCreationAttackPower           = 125,
		kBonusSpiritAttackPower             = 126,
		kBonusAnimalAttackPower             = 127,
		kBonusInsectAttackPower             = 128,
		kBonusPlantAttackPower              = 129,
		kWeakenAccuracy                     = 130,
		kWeakenTolerance                    = 131,
		kStunAccuracy                       = 132,
		kStunTolerance                      = 133,
		kPetrificationAccuracy              = 134,
		kPetrificationTolerance             = 135,
		kSleepAccuracy                      = 136,
		kSleepTolerance                     = 137,
		kSilenceAccuracy                    = 138,
		kSilenceTolerance                   = 139,
		kBindAccuracy                       = 140,
		kBindTolerance                      = 141,
		kBlindAccuracy                      = 142,
		kBlindTolerance                     = 143,
		kCollideAmplification               = 144,
		kCollideResistance                  = 145,
		kWeakenCriticalAttack               = 146,
		kWeakenCriticalDefense              = 147,
		kStunCriticalAttack                 = 148,
		kStunCriticalDefense                = 149,
		kPetrificationCriticalAttack        = 150,
		kPetrificationCriticalDefense       = 151,
		kSleepCriticalAttack                = 152,
		kSleepCriticalDefense               = 153,
		kSilenceCriticalAttack              = 154,
		kSilenceCriticalDefense             = 155,
		kBindCriticalAttack                 = 156,
		kBindCriticalDefense                = 157,
		kBlindCriticalAttack                = 158,
		kBlindCriticalDefense               = 159,
		kWeakenDoubleAttack                 = 160,
		kWeakenDoubleDefense                = 161,
		kStunDoubleAttack                   = 162,
		kStunDoubleDefense                  = 163,
		kPetrificationDoubleAttack          = 164,
		kPetrificationDoubleDefense         = 165,
		kSleepDoubleAttack                  = 166,
		kSleepDoubleDefense                 = 167,
		kSilenceDoubleAttack                = 168,
		kSilenceDoubleDefense               = 169,
		kBindDoubleAttack                   = 170,
		kBindDoubleDefense                  = 171,
		kBlindDoubleAttack                  = 172,
		kBlindDoubleDefense                 = 173,
		kStunImmune                         = 174,
		kPetrificationImmune                = 175,
		kSleepImmune                        = 176,
		kSilenceImmune                      = 177,
		kBindImmune                         = 178,
		kBlindImmune                        = 179,
		kCollideImmune                      = 180,
		kMoveSpeed                          = 181,
		kMoveSpeedModifier                  = 182,
		kDashFastMoveSpeedModifier          = 183,
		kDashNormalMoveSpeedModifier        = 184,
		kSwimFastMoveSpeedModifier          = 185,
		kSwimNormalMoveSpeedModifier        = 186,
		kGlideFastMoveSpeedModifier         = 187,
		kGlideNormalMoveSpeedModifier       = 188,
		kBelongingWeightCap                 = 189,
		kHealTakenModifier                  = 190,
		kDamageBoostChance                  = 191,
		kDamageBoostScale                   = 192,
		kPrimeAttackDamageBoostChance       = 193,
		kPrimeAttackDamageBoostScale        = 194,
		kAdjustExpAcquired                  = 195,
		kAdjustGoldAcquired                 = 196,
		kAdjustItemDrop                     = 197,
		kAdjustGoldDrop                     = 198,
		kAdjustResourceDrop                 = 199,
		kEarnWeaponMasteryExpModifier       = 200,
		kEarnDungeonPointModifier           = 201,
		kSpendDungeonPointModifier          = 202,
		kGatheringSpeed                     = 203,
		kGatheringSpeedModifier             = 204,
		kGatheringDoubleChance              = 205,
		kGatheringCriticalChance            = 206,
		kAggroModifier                      = 207,
		kHealModifier                       = 208,
		kSkillHealTakenModifier             = 209,
		kSkillCooldownModifier              = 210,
		kGlobalSkillCooldownModifier        = 211,
		kWildPolymorphSkillCooldownModifier = 212,
		kPolymorphDuration                  = 213,
		kStaminaMax                         = 214,
		kStaminaRegen                       = 215,
		kStaminaRegenModifier               = 216,
		kStaminaConsumption                 = 217,
		kStaminaConsumptionModifier         = 218,
		kHittedStopDurationModifier         = 219,
		kHittedStopPreventChance            = 220,
		kCompletelyHitChance                = 221,
		kHp                                 = 222,
		kCost                               = 223,
		kStamina                            = 224,
		kBelongingWeight                    = 225,
		kEndOfEnum                          = 226,
		MAX                                 = 227
	};

	/**
	 * Enum TLScheme.EItemExtraStat
	 */
	enum class EItemExtraStat : uint8_t
	{
		kNone                       = 0,
		kSTR                        = 1,
		kDEX                        = 2,
		kINT                        = 3,
		kPER                        = 4,
		kAttackRangeModifier        = 5,
		kAttackSpeedModifier        = 6,
		kCriticalAttack             = 7,
		kCriticalDefense            = 8,
		kHpMax                      = 9,
		kHpRegen                    = 10,
		kCostMax                    = 11,
		kCostRegen                  = 12,
		kCostConsumptionModifier    = 13,
		kStaminaMax                 = 14,
		kStaminaRegen               = 15,
		kSkillCooldownModifier      = 16,
		kMoveSpeedModifier          = 17,
		kFireAmplification          = 18,
		kWaterAmplification         = 19,
		kWindAmplification          = 20,
		kEarthAmplification         = 21,
		kFireResistance             = 22,
		kWaterResistance            = 23,
		kWindResistance             = 24,
		kEarthResistance            = 25,
		kAdjustExpAcquired          = 26,
		kAdjustGoldAcquired         = 27,
		kAdjustGoldDrop             = 28,
		kAdjustItemDrop             = 29,
		kAdjustResourceDrop         = 30,
		kPotionHealModifier         = 31,
		kCollideAmplification       = 32,
		kCollideResistance          = 33,
		kMeleeAccuracy              = 34,
		kRangeAccuracy              = 35,
		kMagicAccuracy              = 36,
		kMeleeEvasion               = 37,
		kRangeEvasion               = 38,
		kMagicEvasion               = 39,
		kDamageReduction            = 40,
		kDamageReductionPenetration = 41,
		kBelongingWeightCap         = 42,
		kShieldBlockChance          = 43,
		kBonusAttackPower           = 44,
		kBonusGrankusAttackPower    = 45,
		kBonusEinardenAttackPower   = 46,
		kBonusDragonAttackPower     = 47,
		kBonusDemonAttackPower      = 48,
		kBonusUndeadAttackPower     = 49,
		kBonusCreationAttackPower   = 50,
		kBonusSpiritAttackPower     = 51,
		kBonusAnimalAttackPower     = 52,
		kBonusInsectAttackPower     = 53,
		kBonusPlantAttackPower      = 54,
		kGrankusDamageReduction     = 55,
		kEinardenDamageReduction    = 56,
		kDragonDamageReduction      = 57,
		kDemonDamageReduction       = 58,
		kUndeadDamageReduction      = 59,
		kCreationDamageReduction    = 60,
		kSpiritDamageReduction      = 61,
		kAnimalDamageReduction      = 62,
		kInsectDamageReduction      = 63,
		kPlantDamageReduction       = 64,
		kWeakenAccuracy             = 65,
		kStunAccuracy               = 66,
		kPetrificationAccuracy      = 67,
		kSleepAccuracy              = 68,
		kSilenceAccuracy            = 69,
		kBindAccuracy               = 70,
		kBlindAccuracy              = 71,
		kWeakenTolerance            = 72,
		kStunTolerance              = 73,
		kPetrificationTolerance     = 74,
		kSleepTolerance             = 75,
		kSilenceTolerance           = 76,
		kBindTolerance              = 77,
		kBlindTolerance             = 78,
		kArmorClass                 = 79,
		kAttackRating               = 80,
		kDoubleAttack               = 81,
		kDoubleDefense              = 82,
		kMeleeArmor                 = 83,
		kRangeArmor                 = 84,
		kMagicArmor                 = 85,
		kMeleeCriticalAttack        = 86,
		kRangeCriticalAttack        = 87,
		kMagicCriticalAttack        = 88,
		kMeleeCriticalDefense       = 89,
		kRangeCriticalDefense       = 90,
		kMagicCriticalDefense       = 91,
		kMeleeDoubleAttack          = 92,
		kRangeDoubleAttack          = 93,
		kMagicDoubleAttack          = 94,
		kMeleeDoubleDefense         = 95,
		kRangeDoubleDefense         = 96,
		kMagicDoubleDefense         = 97,
		kBossMeleeCriticalAttack    = 98,
		kBossRangeCriticalAttack    = 99,
		kBossMagicCriticalAttack    = 100,
		kBossMeleeCriticalDefense   = 101,
		kBossRangeCriticalDefense   = 102,
		kBossMagicCriticalDefense   = 103,
		kBossMeleeDoubleAttack      = 104,
		kBossRangeDoubleAttack      = 105,
		kBossMagicDoubleAttack      = 106,
		kBossMeleeDoubleDefense     = 107,
		kBossRangeDoubleDefense     = 108,
		kBossMagicDoubleDefense     = 109,
		kAttackPowerMainHand        = 110,
		kAttackPowerOffHand         = 111,
		kBonusAttackPowerMainHand   = 112,
		kBonusAttackPowerOffHand    = 113,
		kEndOfEnum                  = 114,
		MAX                         = 115
	};

	/**
	 * Enum TLScheme.EItemMainStat
	 */
	enum class EItemMainStat : uint8_t
	{
		kNone                     = 0,
		kAttackSpeed              = 1,
		kAttackRange              = 2,
		kHpMax                    = 3,
		kCostMax                  = 4,
		kCostRegen                = 5,
		kArmorClass               = 6,
		kPotionHealModifier       = 7,
		kAttackPower              = 8,
		kBonusAttackPower         = 9,
		kMeleeAccuracy            = 10,
		kRangeAccuracy            = 11,
		kMagicAccuracy            = 12,
		kCriticalAttack           = 13,
		kDamageReduction          = 14,
		kShieldBlockChance        = 15,
		kBlockEfficiency          = 16,
		kAttackRating             = 17,
		kAttackPowerMainHand      = 18,
		kAttackPowerOffHand       = 19,
		kBonusAttackPowerMainHand = 20,
		kBonusAttackPowerOffHand  = 21,
		kAttackSpeedMainHand      = 22,
		kAttackSpeedOffHand       = 23,
		kAttackRangeMainHand      = 24,
		kAttackRangeOffHand       = 25,
		kAttackPowerModifier      = 26,
		kMeleeArmor               = 27,
		kRangeArmor               = 28,
		kMagicArmor               = 29,
		kMeleeEvasion             = 30,
		kRangeEvasion             = 31,
		kMagicEvasion             = 32,
		kEndOfEnum                = 33,
		MAX                       = 34
	};

	/**
	 * Enum TLScheme.ETLEyeColorApplyMode
	 */
	enum class ETLEyeColorApplyMode : uint8_t
	{
		BothSide = 0,
		EachSide = 1,
		MAX      = 2
	};

	/**
	 * Enum TLScheme.EGuildRaidResurrectionType
	 */
	enum class EGuildRaidResurrectionType : uint8_t
	{
		kGuildRaid = 0,
		kGuildHome = 1,
		MAX        = 2
	};

	/**
	 * Enum TLScheme.EHudWidgetKey
	 */
	enum class EHudWidgetKey : uint8_t
	{
		None                = 0,
		MainMenu            = 1,
		ChatViewer          = 2,
		ChatToggleButton    = 3,
		Currency            = 4,
		PCInfo              = 5,
		Party               = 6,
		BossTaget           = 7,
		Minimap             = 8,
		ContentsViewer      = 9,
		TargetScan          = 10,
		Acquirement         = 11,
		FixedQuickslot      = 12,
		SkillQuickslot      = 13,
		CombatPolymorph     = 14,
		CombatControl       = 15,
		Compass             = 16,
		Fightback           = 17,
		PartyAssist         = 18,
		PVPMessage          = 19,
		QuickButtonGroup    = 20,
		TargetGroup         = 21,
		MainMenuCenter      = 22,
		ReturnPointButton   = 23,
		InventoryButton     = 24,
		TimelineDialog      = 25,
		TempInventoryButton = 26,
		RealTime            = 27,
		MAX                 = 28
	};

	/**
	 * Enum TLScheme.EGuildRewardBoxContentsType
	 */
	enum class EGuildRewardBoxContentsType : uint8_t
	{
		None                 = 0,
		GuildContract        = 1,
		GuildRaid            = 2,
		PersonalDynamicEvent = 3,
		GuildDynamicEvent    = 4,
		RotationEvent        = 5,
		WorldBoss            = 6,
		TaxDelivery          = 7,
		BMShop               = 8,
		Max                  = 9
	};

	/**
	 * Enum TLScheme.ETLSkillIconType
	 */
	enum class ETLSkillIconType : uint8_t
	{
		kActive  = 0,
		kPassive = 1,
		kPrime   = 2,
		kItem    = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.ETLSkillObjectType
	 */
	enum class ETLSkillObjectType : uint8_t
	{
		Normal = 0,
		Guild  = 1,
		MAX    = 2
	};

	/**
	 * Enum TLScheme.EMapEventShapeType
	 */
	enum class EMapEventShapeType : uint8_t
	{
		DynamicEventRegion = 0,
		SiegeWarfareShape  = 1,
		OccupationShape    = 2,
		WorldBossShape     = 3,
		TaxDeliveryShape   = 4,
		MapAreaShape       = 5,
		FieldBossShape     = 6,
		MAX                = 7
	};

	/**
	 * Enum TLScheme.EPurchaseNavigationEntry
	 */
	enum class EPurchaseNavigationEntry : uint8_t
	{
		SeasonPass = 0,
		GrowthPass = 1,
		Max        = 2,
		None       = 3
	};

	/**
	 * Enum TLScheme.EShopCurrencyType
	 */
	enum class EShopCurrencyType : uint8_t
	{
		Money = 0,
		Item  = 1,
		MAX   = 2
	};

	/**
	 * Enum TLScheme.EChatHyperlinkType
	 */
	enum class EChatHyperlinkType : uint8_t
	{
		Character           = 0,
		Item                = 1,
		Skill               = 2,
		NPC                 = 3,
		Guild               = 4,
		Map                 = 5,
		CallClan            = 6,
		Pin                 = 7,
		Polymorph           = 8,
		MagicDoll           = 9,
		GuildAttackedMember = 10,
		PcSubtitle          = 11,
		Zone                = 12,
		Contract            = 13,
		GuildContract       = 14,
		ItemCollection      = 15,
		Memorial            = 16,
		Url                 = 17,
		PartyInvate         = 18,
		MAX                 = 19
	};

	/**
	 * Enum TLScheme.ECastingEndReason
	 */
	enum class ECastingEndReason : uint8_t
	{
		Success = 0,
		Cancel  = 1,
		Fail    = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.ETLContentsListSortType
	 */
	enum class ETLContentsListSortType : uint8_t
	{
		Default  = 0,
		Acquired = 1,
		Grade    = 2,
		Name     = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.ETLUITargetPriority
	 */
	enum class ETLUITargetPriority : uint8_t
	{
		NpcFirst = 0,
		PcFirst  = 1,
		All      = 2,
		NpcOnly  = 3,
		PcOnly   = 4,
		MAX      = 5
	};

	/**
	 * Enum TLScheme.EEventCalenderType
	 */
	enum class EEventCalenderType : uint8_t
	{
		None           = 0,
		SeasonPass     = 1,
		RotationEvent  = 2,
		FixedTermEvent = 3,
		EndOfEnum      = 4,
		MAX            = 5
	};

	/**
	 * Enum TLScheme.EGuildRaidButtonState
	 */
	enum class EGuildRaidButtonState : uint8_t
	{
		Deactivate = 0,
		Enter      = 1,
		Change     = 2,
		MAX        = 3
	};

	/**
	 * Enum TLScheme.EGuildRaidState
	 */
	enum class EGuildRaidState : uint8_t
	{
		Deactivate = 0,
		Activate   = 1,
		Start      = 2,
		Complete   = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.EPcPlatformType
	 */
	enum class EPcPlatformType : uint8_t
	{
		Unknown     = 0,
		PC          = 1,
		Playstation = 2,
		XBox        = 3,
		Mobile      = 4,
		Steam       = 5,
		MAX         = 6
	};

	/**
	 * Enum TLScheme.ETLPolymorphUIContentType
	 */
	enum class ETLPolymorphUIContentType : uint8_t
	{
		Combat           = 0,
		Dash             = 1,
		Glide            = 2,
		Swim             = 3,
		Social           = 4,
		Collection       = 5,
		GrowthCollection = 6,
		MAX              = 7
	};

	/**
	 * Enum TLScheme.ETLAutoStatus
	 */
	enum class ETLAutoStatus : uint8_t
	{
		None           = 0,
		AutoCombat     = 1,
		AutoPathFollow = 2,
		MAX            = 3
	};

	/**
	 * Enum TLScheme.EPartySettingType
	 */
	enum class EPartySettingType : uint8_t
	{
		None         = 0,
		ItemReward   = 1,
		PinAuthority = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETLAbnormalStateUIType
	 */
	enum class ETLAbnormalStateUIType : uint8_t
	{
		My             = 0,
		Target         = 1,
		FriendlyTarget = 2,
		Custom         = 3,
		MAX            = 4
	};

	/**
	 * Enum TLScheme.ETLAbnormalStateUITab
	 */
	enum class ETLAbnormalStateUITab : uint8_t
	{
		My             = 0,
		Target         = 1,
		Party          = 2,
		FriendlyTarget = 3,
		MAX            = 4
	};

	/**
	 * Enum TLScheme.ETLTargetUIType
	 */
	enum class ETLTargetUIType : uint8_t
	{
		Target         = 0,
		FriendlyTarget = 1,
		BossTarget     = 2,
		MAX            = 3
	};

	/**
	 * Enum TLScheme.ETLMagicDollStringDialogType
	 */
	enum class ETLMagicDollStringDialogType : uint8_t
	{
		Normal              = 0,
		NormalTreasureBox   = 1,
		AdvancedTreasureBox = 2,
		MAX                 = 3
	};

	/**
	 * Enum TLScheme.ETLMagicDollExpressionVoiceType
	 */
	enum class ETLMagicDollExpressionVoiceType : uint8_t
	{
		None           = 0,
		ExpVoiceType1  = 1,
		ExpVoiceType2  = 2,
		ExpVoiceType3  = 3,
		ExpVoiceType4  = 4,
		ExpVoiceType5  = 5,
		ExpVoiceType6  = 6,
		ExpVoiceType7  = 7,
		ExpVoiceType8  = 8,
		ExpVoiceType9  = 9,
		ExpVoiceType10 = 10,
		ExpVoiceType11 = 11,
		ExpVoiceType12 = 12,
		ExpVoiceType13 = 13,
		ExpVoiceType14 = 14,
		ExpVoiceType15 = 15,
		MAX            = 16
	};

	/**
	 * Enum TLScheme.ETLExpressionVoiceType
	 */
	enum class ETLExpressionVoiceType : uint8_t
	{
		None         = 0,
		Pleasure     = 1,
		Gladness     = 2,
		Anger        = 3,
		Annoyance    = 4,
		Sadness      = 5,
		Resignation  = 6,
		Enjoyment    = 7,
		Comfort      = 8,
		Request      = 9,
		Monologue    = 10,
		Question     = 11,
		Doubt        = 12,
		Affirmation  = 13,
		Relief       = 14,
		Surprise     = 15,
		Astonishment = 16,
		Retort       = 17,
		Refutation   = 18,
		MAX          = 19
	};

	/**
	 * Enum TLScheme.ETLSpecialMoveSpeedMode
	 */
	enum class ETLSpecialMoveSpeedMode : uint8_t
	{
		Normal       = 0,
		Fast         = 1,
		Slow         = 2,
		DropDown     = 3,
		PowerLanding = 4,
		MAX          = 5
	};

	/**
	 * Enum TLScheme.ETLWeaponMasterySlotState
	 */
	enum class ETLWeaponMasterySlotState : uint8_t
	{
		Empty = 0,
		Close = 1,
		Open  = 2,
		MAX   = 3
	};

	/**
	 * Enum TLScheme.ETLWeaponSlotType
	 */
	enum class ETLWeaponSlotType : uint8_t
	{
		MainHand          = 0,
		OffHand           = 1,
		WeaponSlotTypeMax = 2,
		MAX               = 3
	};

	/**
	 * Enum TLScheme.ETLFixWorldTargetPositionType
	 */
	enum class ETLFixWorldTargetPositionType : uint8_t
	{
		None      = 0,
		LeftFix   = 1,
		RightFix  = 2,
		EndofEnum = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ETLCardinalPoint
	 */
	enum class ETLCardinalPoint : uint8_t
	{
		None      = 0,
		East      = 1,
		West      = 2,
		South     = 3,
		North     = 4,
		EndofEnum = 5,
		MAX       = 6
	};

	/**
	 * Enum TLScheme.ETLNameplateDistanceGroup
	 */
	enum class ETLNameplateDistanceGroup : uint8_t
	{
		None   = 0,
		GroupA = 1,
		GroupB = 2,
		GroupC = 3,
		GroupD = 4,
		MAX    = 5
	};

	/**
	 * Enum TLScheme.EHpBarType
	 */
	enum class EHpBarType : uint8_t
	{
		None                   = 0,
		MyPc                   = 1,
		PartyMember            = 2,
		DEBoss                 = 3,
		WorldBoss              = 4,
		SiegePolymorphOtherPc  = 5,
		SiegePolymorphFriendly = 6,
		SiegePolymorphMyPc     = 7,
		CastleDoor             = 8,
		OtherPc                = 9,
		NPC                    = 10,
		FO                     = 11,
		Friendly               = 12,
		EndofEnum              = 13,
		MAX                    = 14
	};

	/**
	 * Enum TLScheme.ETLSkillSetUI
	 */
	enum class ETLSkillSetUI : uint8_t
	{
		None           = 0,
		QuickSlot      = 1,
		SkillSetWidget = 2,
		EndOfEnum      = 3,
		MAX            = 4
	};

	/**
	 * Enum TLScheme.EContractState
	 */
	enum class EContractState : uint8_t
	{
		kNone        = 0,
		kNotContract = 1,
		kContracted  = 2,
		kCompleted   = 3,
		EndOfEnum    = 4,
		MAX          = 5
	};

	/**
	 * Enum TLScheme.EFloaterType
	 */
	enum class EFloaterType : uint8_t
	{
		Damage    = 0,
		Abnormal  = 1,
		EndOfEnum = 2,
		MAX       = 3
	};

	/**
	 * Enum TLScheme.EFloaterCategory
	 */
	enum class EFloaterCategory : uint8_t
	{
		Glancing                     = 0,
		ShieldHit                    = 1,
		DamageShieldHit              = 2,
		Immuned                      = 3,
		CriticalHit                  = 4,
		GreatHit                     = 5,
		NormalHit                    = 6,
		Counter                      = 7,
		Miss                         = 8,
		CriticalHeal                 = 9,
		NormalHeal                   = 10,
		AbnormalGood                 = 11,
		AbnormalBad                  = 12,
		DoubleCriticalHit            = 13,
		DoubleHit                    = 14,
		NormalDefenseByDefenseAction = 15,
		HeavyDefenseByDefenseAction  = 16,
		CriticalHealDouble           = 17,
		NormalHealDouble             = 18,
		ContinuousHit                = 19,
		ContinuousHeal               = 20,
		Debug                        = 21,
		EndOfEnum                    = 22,
		MAX                          = 23
	};

	/**
	 * Enum TLScheme.ETLFixTargetSource
	 */
	enum class ETLFixTargetSource : uint8_t
	{
		None              = 0,
		Normal            = 1,
		PartyAssist       = 2,
		AutoCombat        = 3,
		Interaction       = 4,
		ResetTargetHelper = 5,
		MAX               = 6
	};

	/**
	 * Enum TLScheme.ETLPlayLoopMotion_MotionType
	 */
	enum class ETLPlayLoopMotion_MotionType : uint8_t
	{
		kStart                = 0,
		kLoop                 = 1,
		kEnd                  = 2,
		kEndFast              = 3,
		ETLPlayLoopMotion_MAX = 4
	};

	/**
	 * Enum TLScheme.EEndTakeType
	 */
	enum class EEndTakeType : uint8_t
	{
		Case_00  = 0,
		Case_01  = 1,
		Case_02  = 2,
		Case_03  = 3,
		Case_04  = 4,
		Case_MAX = 5
	};

	/**
	 * Enum TLScheme.EUserWidgetClassType
	 */
	enum class EUserWidgetClassType : uint8_t
	{
		None                    = 0,
		ChatBallonPC            = 1,
		ChatBalloonPCHorse      = 2,
		ChatBallonNPC           = 3,
		ChatBallonNPCIntegrated = 4,
		ChatBallonFO            = 5,
		HeadUIItem              = 6,
		HeadUISolo              = 7,
		HeadUIDuo               = 8,
		HeadUIMultiHorse        = 9,
		HeadUIMultiRider        = 10,
		ChatItem                = 11,
		ChatItemMy              = 12,
		ChatItemTime            = 13,
		ChatItemSimple          = 14,
		HeadUISimple            = 15,
		DropFoNameplate         = 16,
		PcNameplate             = 17,
		PcNameplateSimple       = 18,
		PcCasting               = 19,
		CountMax                = 20,
		MAX                     = 21
	};

	/**
	 * Enum TLScheme.EMainMenuType
	 */
	enum class EMainMenuType : uint8_t
	{
		MainMenuInventory            = 0,
		MainMenuCharacter            = 1,
		MainMenuSkill                = 2,
		MainMenuPolymorph            = 3,
		MainMenuGuild                = 4,
		MainMenuUnion                = 5,
		MainMenuWorldmap             = 6,
		MainMenuSavedPlace           = 7,
		MainMenuSystem               = 8,
		MainMenuOption               = 9,
		MainMenuMail                 = 10,
		MainMenuCuration             = 11,
		MainMenuMagicDoll            = 12,
		MainMenuCodex                = 13,
		MainMenuRanking              = 14,
		MainMenuContract             = 15,
		MainMenuPvpHistory           = 16,
		MainMenuItemCollection       = 17,
		MainMenuOpener               = 18,
		MainMenuClose                = 19,
		MainMenuCharacterSelect      = 20,
		MainMenuHelpInfo             = 21,
		MainMenuExit                 = 22,
		MainMenuCraftingBook         = 23,
		MainMenuTrade                = 24,
		MainMenuMemorial             = 25,
		MainMenuWeaponMastery        = 26,
		MainMenuPcRelationship       = 27,
		MainMenuAttend               = 28,
		MainMenuRingMenu             = 29,
		MainMenuEnchant              = 30,
		MainMenuPurchase             = 31,
		MainMenuSeasonPass           = 32,
		MainMenuRotationEvent        = 33,
		MainMenuTimeLimitDungeon     = 34,
		MainMenuEventCalender        = 35,
		MainMenuChatWindow           = 36,
		MainMenuGrowthPass           = 37,
		MainMenuVow                  = 38,
		MainMenuPartyManager         = 39,
		MainMenuTargetScanSetting    = 40,
		MainMenuAutoCombatResult     = 41,
		MainMenuBuff                 = 42,
		MainMenuMagicDollInteraction = 43,
		MainMenuHudCustomize         = 44,
		MainMenuBoutique             = 45,
		MainMenuCoupon               = 46,
		MainMenuRating               = 47,
		None                         = 48,
		MAX                          = 49
	};

	/**
	 * Enum TLScheme.EInteractionState
	 */
	enum class EInteractionState : uint8_t
	{
		kNone                    = 0,
		kOtherUIOpened           = 1,
		kDialogueSequence        = 2,
		kDialogueSelectWait      = 3,
		kInteractionQuery        = 4,
		kInteractionSelectWait   = 5,
		kInteractionExecute      = 6,
		kInteractionCastingStart = 7,
		kInteractionCastingEnd   = 8,
		kInteractionSkillEnd     = 9,
		kCombat                  = 10,
		kDeath                   = 11,
		kShowingPcContext        = 12,
		kInteractionItem         = 13,
		kDisableInteraction      = 14,
		kPcMount                 = 15,
		kShowFailErrorMsg        = 16,
		MAX                      = 17
	};

	/**
	 * Enum TLScheme.EActionBuilderCommandMacro
	 */
	enum class EActionBuilderCommandMacro : uint8_t
	{
		BuilderCommandMacro1  = 0,
		BuilderCommandMacro2  = 1,
		BuilderCommandMacro3  = 2,
		BuilderCommandMacro4  = 3,
		BuilderCommandMacro5  = 4,
		BuilderCommandMacro6  = 5,
		BuilderCommandMacro7  = 6,
		BuilderCommandMacro8  = 7,
		BuilderCommandMacro9  = 8,
		BuilderCommandMacro10 = 9,
		MAX                   = 10
	};

	/**
	 * Enum TLScheme.ETLUIActionType
	 */
	enum class ETLUIActionType : uint8_t
	{
		UIVirtualAccept   = 0,
		UIVirtualBack     = 1,
		UIFaceRight       = 2,
		UIFaceBottom      = 3,
		UIFaceTop         = 4,
		UIFaceLeft        = 5,
		UILeftBumper      = 6,
		UIRightBumper     = 7,
		UILeftTrigger     = 8,
		UIRightTrigger    = 9,
		UILeftStickPush   = 10,
		UIRightStickPush  = 11,
		UIDPadUp          = 12,
		UIDPadDown        = 13,
		UIDPadRight       = 14,
		UIDPadLeft        = 15,
		UILeftStickUp     = 16,
		UILeftStickDown   = 17,
		UILeftStickLeft   = 18,
		UILeftStickRight  = 19,
		UIRightStickUp    = 20,
		UIRightStickDown  = 21,
		UIRightStickLeft  = 22,
		UIRightStickRight = 23,
		kEndOfEnum        = 24,
		MAX               = 25
	};

	/**
	 * Enum TLScheme.EInputTypeUI
	 */
	enum class EInputTypeUI : uint8_t
	{
		Pc      = 0,
		PcPlay  = 1,
		Console = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.EKeyGroup
	 */
	enum class EKeyGroup : uint8_t
	{
		None           = 0,
		Lobby          = 1,
		Play           = 2,
		MapLoading     = 3,
		AvoidKeys      = 4,
		TestUserWidget = 5,
		CustomScene    = 6,
		MAX            = 7
	};

	/**
	 * Enum TLScheme.EInteractionType
	 */
	enum class EInteractionType : uint8_t
	{
		kNone            = 0,
		kInteract        = 1,
		kInstantInteract = 2,
		kEndOfEnum       = 3,
		MAX              = 4
	};

	/**
	 * Enum TLScheme.ETribeRelation
	 */
	enum class ETribeRelation : uint8_t
	{
		kHostile   = 0,
		kFriendly  = 1,
		kNeutral   = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ESkillContextReason
	 */
	enum class ESkillContextReason : uint8_t
	{
		kNone    = 0,
		kContext = 1,
		MAX      = 2
	};

	/**
	 * Enum TLScheme.ESkillContextStatus
	 */
	enum class ESkillContextStatus : uint8_t
	{
		kNormal                    = 0,
		kLock                      = 1,
		kStunned                   = 2,
		kClose                     = 3,
		kUnequipped                = 4,
		kInTheAir                  = 5,
		kInDeactivatedWeaponPreset = 6,
		kInTheWater                = 7,
		kError                     = 8,
		MAX                        = 9
	};

	/**
	 * Enum TLScheme.ETLJsonContractType
	 */
	enum class ETLJsonContractType : uint8_t
	{
		kNone = 0,
		kNpc  = 1,
		kItem = 2,
		kBm   = 3,
		MAX   = 4
	};

	/**
	 * Enum TLScheme.ETLJsonContractGroupType
	 */
	enum class ETLJsonContractGroupType : uint8_t
	{
		kNpc  = 0,
		kItem = 1,
		kBm   = 2,
		MAX   = 3
	};

	/**
	 * Enum TLScheme.ETLJsonContractGrade
	 */
	enum class ETLJsonContractGrade : uint8_t
	{
		kOne   = 0,
		kTwo   = 1,
		kThree = 2,
		kFour  = 3,
		kFive  = 4,
		MAX    = 5
	};

	/**
	 * Enum TLScheme.EGuildContractType
	 */
	enum class EGuildContractType : uint8_t
	{
		kNormal = 0,
		kParty  = 1,
		kEvent  = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.ETLJsonMapRegionType
	 */
	enum class ETLJsonMapRegionType : uint8_t
	{
		kPeace    = 0,
		kConflict = 1,
		kSafety   = 2,
		kFreeDuel = 3,
		kWar      = 4,
		kCombat   = 5,
		MAX       = 6
	};

	/**
	 * Enum TLScheme.ETLJsonMapResurrectionPointType
	 */
	enum class ETLJsonMapResurrectionPointType : uint8_t
	{
		kNone              = 0,
		kResurrectionPoint = 1,
		kDynamicEventPoint = 2,
		kTaxDelivery       = 3,
		kWorldBoss         = 4,
		MAX                = 5
	};

	/**
	 * Enum TLScheme.ETLJsonMapResurrectionType
	 */
	enum class ETLJsonMapResurrectionType : uint8_t
	{
		kNone              = 0,
		kResurrectionPoint = 1,
		kStartPoint        = 2,
		kInstanceDungeon   = 3,
		kGuildRaid         = 4,
		MAX                = 5
	};

	/**
	 * Enum TLScheme.ETLJsonGuildRankedRewardGroup
	 */
	enum class ETLJsonGuildRankedRewardGroup : uint8_t
	{
		kA  = 0,
		kB  = 1,
		kC  = 2,
		kD  = 3,
		kE  = 4,
		kF  = 5,
		kG  = 6,
		kH  = 7,
		kI  = 8,
		kJ  = 9,
		MAX = 10
	};

	/**
	 * Enum TLScheme.ETLJsonRankedRewardGroup
	 */
	enum class ETLJsonRankedRewardGroup : uint8_t
	{
		kA  = 0,
		kB  = 1,
		kC  = 2,
		kD  = 3,
		kE  = 4,
		MAX = 5
	};

	/**
	 * Enum TLScheme.ETLJsonTerrirtoryAbyssType
	 */
	enum class ETLJsonTerrirtoryAbyssType : uint8_t
	{
		kNone = 0,
		kEarn = 1,
		kUse  = 2,
		MAX   = 3
	};

	/**
	 * Enum TLScheme.EHpAbnormalStatus
	 */
	enum class EHpAbnormalStatus : uint8_t
	{
		kNone          = 0,
		kPetrification = 1,
		kBurn          = 2,
		kAddict        = 3,
		MAX            = 4
	};

	/**
	 * Enum TLScheme.EInfluenceOnHorse
	 */
	enum class EInfluenceOnHorse : uint8_t
	{
		kNone            = 0,
		kApplyWith       = 1,
		kUnmountOnly     = 2,
		kUnmountAndApply = 3,
		MAX              = 4
	};

	/**
	 * Enum TLScheme.EInfluenceOnRider
	 */
	enum class EInfluenceOnRider : uint8_t
	{
		kNone                   = 0,
		kInfection              = 1,
		kSeparation             = 2,
		kInfectionAndSeparation = 3,
		MAX                     = 4
	};

	/**
	 * Enum TLScheme.ETLAbnormalSctCategory
	 */
	enum class ETLAbnormalSctCategory : uint8_t
	{
		Aura        = 0,
		Top         = 1,
		Cap         = 2,
		Body        = 3,
		Potion      = 4,
		Root        = 5,
		Animation   = 6,
		System      = 7,
		kEndOfEnums = 8,
		MAX         = 9
	};

	/**
	 * Enum TLScheme.EDurationModifyGroup
	 */
	enum class EDurationModifyGroup : uint8_t
	{
		kNone   = 0,
		kBuff   = 1,
		kDebuff = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.EModifyGroup
	 */
	enum class EModifyGroup : uint8_t
	{
		kNone          = 0,
		kWeaken        = 1,
		kStun          = 2,
		kPetrification = 3,
		kSleep         = 4,
		kSilence       = 5,
		kBind          = 6,
		kBlind         = 7,
		kCollide       = 8,
		MAX            = 9
	};

	/**
	 * Enum TLScheme.EAbnormalStackingPolicyType
	 */
	enum class EAbnormalStackingPolicyType : uint8_t
	{
		kOneByOne         = 0,
		kStackUp          = 1,
		kStackUpPerPlayer = 2,
		kDominance        = 3,
		MAX               = 4
	};

	/**
	 * Enum TLScheme.ETLDurationSettingPolicyType
	 */
	enum class ETLDurationSettingPolicyType : uint8_t
	{
		kReplace     = 0,
		kAddDuration = 1,
		kPickLonger  = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETLCollisionDisableType
	 */
	enum class ETLCollisionDisableType : uint8_t
	{
		None   = 0,
		OnlyPC = 1,
		All    = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.EAbnormalGoodOrBad
	 */
	enum class EAbnormalGoodOrBad : uint8_t
	{
		kGood = 0,
		kBad  = 1,
		kNone = 2,
		MAX   = 3
	};

	/**
	 * Enum TLScheme.EAbnormalDispelTag
	 */
	enum class EAbnormalDispelTag : uint8_t
	{
		kMagic  = 0,
		kPoison = 1,
		kFury   = 2,
		kCurse  = 3,
		MAX     = 4
	};

	/**
	 * Enum TLScheme.ETLAbnormalSctShowOption
	 */
	enum class ETLAbnormalSctShowOption : uint8_t
	{
		All                 = 0,
		CasterAndTargetOnly = 1,
		MyPartyOnly         = 2,
		MAX                 = 3
	};

	/**
	 * Enum TLScheme.EControlTargetOnPartType
	 */
	enum class EControlTargetOnPartType : uint8_t
	{
		kNone    = 0,
		kAllow   = 1,
		kProtect = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.ETLCarrierType
	 */
	enum class ETLCarrierType : uint8_t
	{
		None       = 0,
		Attached   = 1,
		Gigantrite = 2,
		Standalone = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.EUseSkillEventSendTime
	 */
	enum class EUseSkillEventSendTime : uint8_t
	{
		kError        = 0,
		kNone         = 1,
		kSwingTime    = 2,
		kFirstHitTime = 3,
		kFinishTime   = 4,
		kLeave        = 5,
		MAX           = 6
	};

	/**
	 * Enum TLScheme.ESkillTargetObjectType
	 */
	enum class ESkillTargetObjectType : uint8_t
	{
		kNone = 0,
		kPC   = 1,
		kNPC  = 2,
		kFO   = 3,
		MAX   = 4
	};

	/**
	 * Enum TLScheme.ETLSkillTargetExceptionalRule
	 */
	enum class ETLSkillTargetExceptionalRule : uint8_t
	{
		kError                 = 0,
		kNone                  = 1,
		kCasterOnly            = 2,
		kExcludeCaster         = 3,
		kExcludeExecuter       = 4,
		kExcludeCasterExecuter = 5,
		kExcludeMainTarget     = 6,
		MAX                    = 7
	};

	/**
	 * Enum TLScheme.ETransResultType
	 */
	enum class ETransResultType : uint8_t
	{
		kNone        = 0,
		kDespawn     = 1,
		kChangeState = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETransCondType
	 */
	enum class ETransCondType : uint8_t
	{
		kNone     = 0,
		kCooldown = 1,
		kDeath    = 2,
		MAX       = 3
	};

	/**
	 * Enum TLScheme.ETLChallengeCodeCategory
	 */
	enum class ETLChallengeCodeCategory : uint8_t
	{
		kPrologue = 0,
		kNormal   = 1,
		kFinal    = 2,
		EndOfEnum = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.EChatInputMode
	 */
	enum class EChatInputMode : uint8_t
	{
		ChatInputMode_Normal       = 0,
		ChatInputMode_Area         = 1,
		ChatInputMode_Party        = 2,
		ChatInputMode_Guild        = 3,
		ChatInputMode_Union        = 4,
		ChatInputMode_Whisper      = 5,
		ChatInputMode_World        = 6,
		ChatInputMode_Help         = 7,
		ChatInputMode_GuildNotice  = 8,
		ChatInputMode_UnionNotice  = 9,
		ChatInputMode_Group1       = 10,
		ChatInputMode_Group2       = 11,
		ChatInputMode_Group3       = 12,
		ChatInputMode_Group4       = 13,
		ChatInputMode_Group5       = 14,
		ChatInputMode_Group1Notice = 15,
		ChatInputMode_Group2Notice = 16,
		ChatInputMode_Group3Notice = 17,
		ChatInputMode_Group4Notice = 18,
		ChatInputMode_Group5Notice = 19,
		ChatInputMode_MAX          = 20
	};

	/**
	 * Enum TLScheme.ETLChatTabType
	 */
	enum class ETLChatTabType : uint8_t
	{
		ChatAll             = 0,
		ChatNormal          = 1,
		ChatWorld           = 2,
		ChatParty           = 3,
		ChatGuildUnion      = 4,
		ChatSystem          = 5,
		ChatContents        = 6,
		UserCustom          = 7,
		Group1              = 8,
		Group2              = 9,
		Group3              = 10,
		Group4              = 11,
		Group5              = 12,
		GroupMenu           = 13,
		Whisper             = 14,
		GroupExpandButton   = 15,
		WhisperExpandButton = 16,
		FriendList          = 17,
		EndOfEnum           = 18,
		MAX                 = 19
	};

	/**
	 * Enum TLScheme.EChatCommandCategory
	 */
	enum class EChatCommandCategory : uint8_t
	{
		kNone      = 0,
		kChat      = 1,
		kCommunity = 2,
		kAction    = 3,
		kSocial    = 4,
		kEmoticon  = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.EChatMessageCategory
	 */
	enum class EChatMessageCategory : uint8_t
	{
		kNone              = 0,
		kChatNormal        = 1,
		kChatParty         = 2,
		kChatGuild         = 3,
		kChatUnion         = 4,
		kChatArea          = 5,
		kChatWhisper       = 6,
		kChatWorld         = 7,
		kChatGroup1        = 8,
		kChatGroup2        = 9,
		kChatGroup3        = 10,
		kChatGroup4        = 11,
		kChatGroup5        = 12,
		kChatGuildNotice   = 13,
		kSysArea           = 14,
		kSysBroadcast      = 15,
		kSysDice           = 16,
		kSysExp            = 17,
		kSysGuild          = 18,
		kSysUnion          = 19,
		kChatUnionNotice   = 20,
		kSysInfo           = 21,
		kSysItem           = 22,
		kSysItemParty      = 23,
		kSysMoney          = 24,
		kSysNormal         = 25,
		kSysNotice         = 26,
		kSysOperation      = 27,
		kSysParty          = 28,
		kSysSiege          = 29,
		kSysWarning        = 30,
		kSysWorld          = 31,
		kSysCp             = 32,
		kContSpeech        = 33,
		kContDialogue      = 34,
		kContShout         = 35,
		kContMonologue     = 36,
		kContTalk          = 37,
		kContCodex         = 38,
		kSysTaunt          = 39,
		kSysPvp            = 40,
		kSysBroadcastGuild = 41,
		kSysGroup          = 42,
		kSysGroup1         = 43,
		kSysGroup2         = 44,
		kSysGroup3         = 45,
		kSysGroup4         = 46,
		kSysGroup5         = 47,
		kGroupNotice1      = 48,
		kGroupNotice2      = 49,
		kGroupNotice3      = 50,
		kGroupNotice4      = 51,
		kGroupNotice5      = 52,
		kSysTip            = 53,
		kDebug             = 54,
		MAX                = 55
	};

	/**
	 * Enum TLScheme.EChatPortraitType
	 */
	enum class EChatPortraitType : uint8_t
	{
		None              = 0,
		SystemPortrait    = 1,
		GuildPortrait     = 2,
		RewardPortrait    = 3,
		BroadcastPortrait = 4,
		DicePortrait      = 5,
		DialoguePortrait  = 6,
		UserPortrait      = 7,
		MAX               = 8
	};

	/**
	 * Enum TLScheme.EChatMessageFilterGroup
	 */
	enum class EChatMessageFilterGroup : uint8_t
	{
		FilterGroupNone   = 0,
		FilterGroupChat   = 1,
		FilterGroupSystem = 2,
		FilterGroupTake   = 3,
		FilterGroupNpc    = 4,
		EndOfEnum         = 5,
		MAX               = 6
	};

	/**
	 * Enum TLScheme.ETLChatVisibleType
	 */
	enum class ETLChatVisibleType : uint8_t
	{
		Normal = 0,
		Mini   = 1,
		Hide   = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.ETLClientObjectType
	 */
	enum class ETLClientObjectType : uint8_t
	{
		NONE               = 0,
		BOSS_SPAWN_SIGN    = 1,
		DYNAMIC_EVENT_SIGN = 2,
		MAX                = 3
	};

	/**
	 * Enum TLScheme.ECodeDrawLineDirectionType
	 */
	enum class ECodeDrawLineDirectionType : uint8_t
	{
		UpperLine = 0,
		UnderLine = 1,
		MAX       = 2
	};

	/**
	 * Enum TLScheme.ETLConditionalTaskMethod
	 */
	enum class ETLConditionalTaskMethod : uint8_t
	{
		RandomlyOneOfFirstMatchedConditionContents = 0,
		RandomlyOneOfAllMatchedConditionContents   = 1,
		MAX                                        = 2
	};

	/**
	 * Enum TLScheme.ETLContentsOpenPolymorphTypeMask
	 */
	enum class ETLContentsOpenPolymorphTypeMask : uint8_t
	{
		None        = 0,
		Combat      = 1,
		Mobility    = 2,
		SiegeWeapon = 3,
		Social      = 4,
		Temporary   = 5,
		MAX         = 6
	};

	/**
	 * Enum TLScheme.EContractTabType
	 */
	enum class EContractTabType : uint8_t
	{
		ContractableList   = 0,
		BmContractableList = 1,
		ContractedList     = 2,
		MAX                = 3
	};

	/**
	 * Enum TLScheme.ETLCraftingCategoryType
	 */
	enum class ETLCraftingCategoryType : uint8_t
	{
		kDefault = 0,
		kPcClass = 1,
		MAX      = 2
	};

	/**
	 * Enum TLScheme.ETLCraftingBookType
	 */
	enum class ETLCraftingBookType : uint8_t
	{
		None      = 0,
		Weapon    = 1,
		Equip     = 2,
		Accessory = 3,
		Grocery   = 4,
		SkillBook = 5,
		Max       = 6
	};

	/**
	 * Enum TLScheme.ETLCustomizingMakeupItemRaceFilter
	 */
	enum class ETLCustomizingMakeupItemRaceFilter : uint8_t
	{
		Human = 0,
		Count = 1,
		MAX   = 2
	};

	/**
	 * Enum TLScheme.EDialogueType
	 */
	enum class EDialogueType : uint8_t
	{
		kNone                 = 0,
		kTimelineScene        = 1,
		kInteractionScene     = 2,
		kInteractionSceneA    = 3,
		kInteractionSceneB    = 4,
		kInteractionSceneC    = 5,
		kInteractionSceneD    = 6,
		kIntegratedChatBallon = 7,
		MAX                   = 8
	};

	/**
	 * Enum TLScheme.EDynamicEventProgressType
	 */
	enum class EDynamicEventProgressType : uint8_t
	{
		kNone     = 0,
		kPrepare  = 1,
		kProgress = 2,
		MAX       = 3
	};

	/**
	 * Enum TLScheme.ETLDynamicEventWarehouseValueType
	 */
	enum class ETLDynamicEventWarehouseValueType : uint8_t
	{
		MY_COUNT          = 0,
		MAX_COUNT         = 1,
		TOTAL_COUNT       = 2,
		TOP_COUNT         = 3,
		INFINITY_COUNT    = 4,
		ACQUIREABLE_COUNT = 5,
		MAX               = 6
	};

	/**
	 * Enum TLScheme.ETLProjectileType
	 */
	enum class ETLProjectileType : uint8_t
	{
		kOnNav  = 0,
		kDirect = 1,
		MAX     = 2
	};

	/**
	 * Enum TLScheme.EHitSctDir
	 */
	enum class EHitSctDir : uint8_t
	{
		Neutral     = 0,
		LeftToRight = 1,
		RightToLeft = 2,
		BottomToTop = 3,
		TopToBottom = 4,
		FrontToBack = 5,
		BackToFront = 6,
		MAX         = 7
	};

	/**
	 * Enum TLScheme.ERagdollPower
	 */
	enum class ERagdollPower : uint8_t
	{
		Low    = 0,
		Medium = 1,
		High   = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.ERagdollPosition
	 */
	enum class ERagdollPosition : uint8_t
	{
		FromCaster = 0,
		FromPoint  = 1,
		MAX        = 2
	};

	/**
	 * Enum TLScheme.ERagdollType
	 */
	enum class ERagdollType : uint8_t
	{
		Normal        = 0,
		Collapse      = 1,
		CollapseFront = 2,
		CollapseBack  = 3,
		BombEffect    = 4,
		MAX           = 5
	};

	/**
	 * Enum TLScheme.EEffectGroup
	 */
	enum class EEffectGroup : uint8_t
	{
		None                                = 0,
		Abnormal_Propagation                = 1,
		Add_Skill_Cost                      = 2,
		Adjust_Armor_By_Shield_Block_Chance = 3,
		Adjust_Duration                     = 4,
		Adjust_Dynamic_Stat                 = 5,
		Adjust_Gliding_Ability              = 6,
		Adjust_Judgement_To_Causer          = 7,
		Adjust_Sensory_Range                = 8,
		Adjust_Skill_Cooldown               = 9,
		Adjust_Stat                         = 10,
		Adjust_Stealth_Detection_Range      = 11,
		Aoe_Anchored                        = 12,
		Aoe_Projectile                      = 13,
		Aoe_Projectile_Control              = 14,
		Aoe_Tornado                         = 15,
		Apply                               = 16,
		Apply_To_Caster_Friendly_Target     = 17,
		Apply_To_Guild_Members              = 18,
		Attach_Summons                      = 19,
		Attack_Event                        = 20,
		Aura                                = 21,
		Block                               = 22,
		Boost_Stat_By_Abnormal              = 23,
		Boost_Stat_By_Distance              = 24,
		bring_on                            = 25,
		Call_Area                           = 26,
		Call_Child                          = 27,
		CallClan                            = 28,
		Carrier_CallClan                    = 29,
		Carrier_Change_State                = 30,
		Carrier_Move                        = 31,
		Carrier_Polymorph                   = 32,
		Carrier_Rotate                      = 33,
		Caster_Conditional_Branch           = 34,
		Central_Force                       = 35,
		Central_Force_Move_Watcher          = 36,
		change_aggressive                   = 37,
		Change_Position                     = 38,
		Cluster_Bomb                        = 39,
		Collider                            = 40,
		Conditional_Activation              = 41,
		Conditional_Branch                  = 42,
		Continuous_Damage                   = 43,
		Continuous_Heal                     = 44,
		Cooldown                            = 45,
		Cooldown_Reduction                  = 46,
		Crowd_Surfing                       = 47,
		Damage_Accumulation                 = 48,
		Damage_Distribution                 = 49,
		Damage_Imputation                   = 50,
		Damage_Partial_Adjustment           = 51,
		Damage_Shield                       = 52,
		Dash_State_Manager                  = 53,
		Definite_Attack_Result              = 54,
		Detach_Summons                      = 55,
		Direct_Damage                       = 56,
		Directional_Force                   = 57,
		Dispel                              = 58,
		Do_Nothing_Duration                 = 59,
		Do_Nothing_Instant                  = 60,
		Drop_Rider                          = 61,
		Durational_Summon                   = 62,
		Durational_Taunt                    = 63,
		Dynamic_Boost_Stat                  = 64,
		Elemental                           = 65,
		Elemental_Picker                    = 66,
		Environment_Change                  = 67,
		Event_Trigger                       = 68,
		Falling                             = 69,
		Fear                                = 70,
		Fo_Change_State                     = 71,
		Forced_Conditional_Skill            = 72,
		forced_movement                     = 73,
		Forced_Self_Defense_Status          = 74,
		Forced_Teleport                     = 75,
		Fo_Transform                        = 76,
		Give_Item                           = 77,
		Gliding_Float                       = 78,
		Gliding_State_Manager               = 79,
		Global_Cooldown_Reduction           = 80,
		HpLimitControl                      = 81,
		Inexhaustible_Skill_Cost            = 82,
		Instant_Death                       = 83,
		Instant_Drain                       = 84,
		Instant_Heal                        = 85,
		Instant_Taunt                       = 86,
		Intervallic_Damage                  = 87,
		Intervallic_Heal                    = 88,
		Mark                                = 89,
		Move_Watcher                        = 90,
		Npc_Change_Appearance               = 91,
		Npc_Transform                       = 92,
		Override_Skill_Level                = 93,
		Passive_On                          = 94,
		Pattern                             = 95,
		Projectile                          = 96,
		Random_Picker                       = 97,
		Relative_Position                   = 98,
		Resurrection                        = 99,
		Return_To_Caster                    = 100,
		Sensor                              = 101,
		Set_Collision_Size                  = 102,
		Skill_Cost_Accumulation             = 103,
		SkillCost_To_HP                     = 104,
		Spell_Polymorph                     = 105,
		Stamina_Damage                      = 106,
		Stamina_Watcher                     = 107,
		Start_Gliding_On_Jump               = 108,
		Store_Formula                       = 109,
		Summon                              = 110,
		Support                             = 111,
		Swimming_State_Manager              = 112,
		Target_Counter                      = 113,
		Target_Direction_Filter             = 114,
		TransferableBinder                  = 115,
		Wind_Blown                          = 116,
		WithinRangeBinder                   = 117,
		MAX                                 = 118
	};

	/**
	 * Enum TLScheme.EWorldMapListSearchType
	 */
	enum class EWorldMapListSearchType : uint8_t
	{
		Region   = 0,
		Species  = 1,
		Monsters = 2,
		Max      = 3
	};

	/**
	 * Enum TLScheme.ETLSeasonPassStatusType
	 */
	enum class ETLSeasonPassStatusType : uint8_t
	{
		EnableFreePass   = 0,
		EnableTicketPass = 1,
		GracePeriod      = 2,
		MAX              = 3
	};

	/**
	 * Enum TLScheme.ETLContentsViewerNotifyType
	 */
	enum class ETLContentsViewerNotifyType : uint8_t
	{
		CreateNotify    = 0,
		AddRewardNotify = 1,
		NotRewardNotify = 2,
		MAX             = 3
	};

	/**
	 * Enum TLScheme.EPurchaseCurrencyGroupType
	 */
	enum class EPurchaseCurrencyGroupType : uint8_t
	{
		Cash    = 0,
		Diamond = 1,
		Max     = 2
	};

	/**
	 * Enum TLScheme.ETLLanguageTag
	 */
	enum class ETLLanguageTag : uint8_t
	{
		Engine = 0,
		Purple = 1,
		MAX    = 2
	};

	/**
	 * Enum TLScheme.ETLLanguages
	 */
	enum class ETLLanguages : uint8_t
	{
		Korean             = 0,
		English            = 1,
		Japanese           = 2,
		ChineseTraditional = 3,
		French             = 4,
		German             = 5,
		Spanish            = 6,
		SpanishLatAm       = 7,
		Portuguese         = 8,
		Thai               = 9,
		MAX                = 10
	};

	/**
	 * Enum TLScheme.ETLDynamicEventType
	 */
	enum class ETLDynamicEventType : uint8_t
	{
		NormalEvent = 0,
		PeaceEvent  = 1,
		GuildEvent  = 2,
		EndOfEnum   = 3,
		MAX         = 4
	};

	/**
	 * Enum TLScheme.ETLGetROType
	 */
	enum class ETLGetROType : uint8_t
	{
		Mineral  = 0,
		Wood     = 1,
		Herb     = 2,
		Cactus   = 3,
		Mushroom = 4,
		MAX      = 5
	};

	/**
	 * Enum TLScheme.ETLWidgetPlatformBits
	 */
	enum class ETLWidgetPlatformBits : uint8_t
	{
		FLAG_NONE    = 0,
		FLAG_PC      = 1,
		FLAG_CONSOLE = 2,
		FLAG_MOBILE  = 3,
		FLAG_ALL     = 4,
		FLAG_MAX     = 5
	};

	/**
	 * Enum TLScheme.ETLTerritoryFogState
	 */
	enum class ETLTerritoryFogState : uint8_t
	{
		CLOSED  = 0,
		OPENING = 1,
		OPENED  = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.ETLWidgetCreationSetType
	 */
	enum class ETLWidgetCreationSetType : uint8_t
	{
		NONE    = 0,
		CLIENT  = 1,
		PREGAME = 2,
		INGAME  = 3,
		MAX     = 4
	};

	/**
	 * Enum TLScheme.ETLSkillSetType
	 */
	enum class ETLSkillSetType : uint8_t
	{
		None              = 0,
		WeaponSkillSet    = 1,
		PolymorphSkillSet = 2,
		SpecialSkillSet   = 3,
		RankingSkillSet   = 4,
		MAX               = 5
	};

	/**
	 * Enum TLScheme.ETLRewardDistribution
	 */
	enum class ETLRewardDistribution : uint8_t
	{
		kByContribution    = 0,
		kToTerminator      = 1,
		kToTerminatorParty = 2,
		MAX                = 3
	};

	/**
	 * Enum TLScheme.EEmojiTabType
	 */
	enum class EEmojiTabType : uint8_t
	{
		Tab1 = 0,
		Tab2 = 1,
		Tab3 = 2,
		MAX  = 3
	};

	/**
	 * Enum TLScheme.ETLPostCategoryType
	 */
	enum class ETLPostCategoryType : uint8_t
	{
		System  = 0,
		User    = 1,
		Storage = 2,
		MAX     = 3
	};

	/**
	 * Enum TLScheme.EDragScrollingType
	 */
	enum class EDragScrollingType : uint8_t
	{
		RightClick = 0,
		LeftClick  = 1,
		MAX        = 2
	};

	/**
	 * Enum TLScheme.ETLPostUserCategoryType
	 */
	enum class ETLPostUserCategoryType : uint8_t
	{
		Player = 0,
		Guild  = 1,
		Union  = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.ETLMemorialRankingType
	 */
	enum class ETLMemorialRankingType : uint8_t
	{
		kNone                 = 0,
		kPcExpRank            = 1,
		kGuildActivePointRank = 2,
		kWorldCharacterRank   = 3,
		EndOfEnum             = 4,
		MAX                   = 5
	};

	/**
	 * Enum TLScheme.ETLMemorialRecordType
	 */
	enum class ETLMemorialRecordType : uint8_t
	{
		kPersonal = 0,
		kGuild    = 1,
		kServer   = 2,
		EndOfEnum = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ETLGroupChatRole
	 */
	enum class ETLGroupChatRole : uint8_t
	{
		Joiner    = 0,
		Master    = 1,
		SubMaster = 2,
		EndOfEnum = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ETLDeveloperLetterType
	 */
	enum class ETLDeveloperLetterType : uint8_t
	{
		None             = 0,
		SinglePage       = 1,
		BothPages        = 2,
		SmallPicturePage = 3,
		LargePicturePage = 4,
		EndOfEnum        = 5,
		MAX              = 6
	};

	/**
	 * Enum TLScheme.ETLLevelAchievementType
	 */
	enum class ETLLevelAchievementType : uint8_t
	{
		None             = 0,
		BonusStat        = 1,
		BonusNpcContract = 2,
		ContractCommon   = 3,
		ContentsOpen     = 4,
		Reward           = 5,
		MAX              = 6
	};

	/**
	 * Enum TLScheme.ETLGrowthMissionType
	 */
	enum class ETLGrowthMissionType : uint8_t
	{
		None         = 0,
		ContentsOpen = 1,
		Reward       = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETLCodexCollectionPageType
	 */
	enum class ETLCodexCollectionPageType : uint8_t
	{
		None        = 0,
		SinglePage  = 1,
		BothPages   = 2,
		PicturePage = 3,
		EndOfEnum   = 4,
		MAX         = 5
	};

	/**
	 * Enum TLScheme.ETLCodexCollectionType
	 */
	enum class ETLCodexCollectionType : uint8_t
	{
		None      = 0,
		Bundle    = 1,
		Book      = 2,
		Page      = 3,
		EndOfEnum = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.ECastleType
	 */
	enum class ECastleType : uint8_t
	{
		kNone     = 0,
		kStongard = 1,
		kDraco    = 2,
		kTreheim  = 3,
		EndOfEnum = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.ETLFishGrade
	 */
	enum class ETLFishGrade : uint8_t
	{
		kNone      = 0,
		kCommon    = 1,
		kUncommon  = 2,
		kRare      = 3,
		kHeroic    = 4,
		kLegendary = 5,
		EndOfEnum  = 6,
		MAX        = 7
	};

	/**
	 * Enum TLScheme.EEventCalenderRelatedType
	 */
	enum class EEventCalenderRelatedType : uint8_t
	{
		None            = 0,
		SeasonPassUI    = 1,
		RotationEventUI = 2,
		Web             = 3,
		EndOfEnum       = 4,
		MAX             = 5
	};

	/**
	 * Enum TLScheme.ETLSeasonPassRewardType
	 */
	enum class ETLSeasonPassRewardType : uint8_t
	{
		None       = 0,
		Both       = 1,
		FreeOnly   = 2,
		TicketOnly = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.EItemLifeTimeType
	 */
	enum class EItemLifeTimeType : uint8_t
	{
		None     = 0,
		DateTime = 1,
		Usage    = 2,
		Fixed    = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.ETLSeasonPassTaskGroupType
	 */
	enum class ETLSeasonPassTaskGroupType : uint8_t
	{
		Daily  = 0,
		Weekly = 1,
		Season = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.ETLSeasonPassTaskType
	 */
	enum class ETLSeasonPassTaskType : uint8_t
	{
		None        = 0,
		Daily       = 1,
		Weekly      = 2,
		Season      = 3,
		RandomDaily = 4,
		MAX         = 5
	};

	/**
	 * Enum TLScheme.ETLSlateImageType
	 */
	enum class ETLSlateImageType : uint8_t
	{
		SPRITE  = 0,
		TEXTURE = 1,
		MAX     = 2
	};

	/**
	 * Enum TLScheme.ETLWorldEffectType
	 */
	enum class ETLWorldEffectType : uint8_t
	{
		WorldEffect           = 0,
		MapCarrierWorldEffect = 1,
		MapCarrierSafeEffect  = 2,
		MAX                   = 3
	};

	/**
	 * Enum TLScheme.ETLTeamBattleMessageType
	 */
	enum class ETLTeamBattleMessageType : uint8_t
	{
		StartTeamBattle        = 0,
		WarningIntensiveAttack = 1,
		MAX                    = 2
	};

	/**
	 * Enum TLScheme.ETLSpeakDistanceType
	 */
	enum class ETLSpeakDistanceType : uint8_t
	{
		None    = 0,
		Near    = 1,
		Far     = 2,
		NoLimit = 3,
		MAX     = 4
	};

	/**
	 * Enum TLScheme.ETimePhase
	 */
	enum class ETimePhase : uint8_t
	{
		kDay   = 0,
		kNight = 1,
		MAX    = 2
	};

	/**
	 * Enum TLScheme.EWeatherType
	 */
	enum class EWeatherType : uint8_t
	{
		Normal    = 0,
		Rain      = 1,
		Thunder   = 2,
		Snow      = 3,
		Indoor    = 4,
		MagicRain = 5,
		EndOfEnum = 6,
		None      = 7,
		MAX       = 8
	};

	/**
	 * Enum TLScheme.ETLCodexCommonStatusType
	 */
	enum class ETLCodexCommonStatusType : uint8_t
	{
		Closed   = 0,
		Progress = 1,
		Attained = 2,
		Rewarded = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.ETLCodexAchievementActionType
	 */
	enum class ETLCodexAchievementActionType : uint8_t
	{
		None         = 0,
		DynamicEvent = 1,
		Contract     = 2,
		Hunting      = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.ETLContentHolderType
	 */
	enum class ETLContentHolderType : uint8_t
	{
		None           = 0,
		Memorial       = 1,
		Codex          = 2,
		PlayerContract = 3,
		GuildContract  = 4,
		Crafting       = 5,
		MAX            = 6
	};

	/**
	 * Enum TLScheme.ETLTerrirtoryAbyssType
	 */
	enum class ETLTerrirtoryAbyssType : uint8_t
	{
		kNone = 0,
		kEarn = 1,
		kUse  = 2,
		MAX   = 3
	};

	/**
	 * Enum TLScheme.ETLTraceEffectType
	 */
	enum class ETLTraceEffectType : uint8_t
	{
		kNone    = 0,
		kFighter = 1,
		kFloor   = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.EMaterialCategory
	 */
	enum class EMaterialCategory : uint8_t
	{
		kNone                = 0,
		kMaterialFabric      = 1,
		kMaterialIron        = 2,
		kMaterialWood        = 3,
		kMaterialLeather     = 4,
		kMaterialSilver      = 5,
		kMaterialBone        = 6,
		kMaterialBeast       = 7,
		kMaterialAnimal      = 8,
		kMaterialInsect      = 9,
		kMaterialPlant       = 10,
		kMaterialGold        = 11,
		kMaterialFragment    = 12,
		kMaterialElement     = 13,
		kMaterialPlatinum    = 14,
		kMaterialMithril     = 15,
		kMaterialSeed        = 16,
		kMaterialLeaf        = 17,
		kMaterialFruit       = 18,
		kMaterialCactus      = 19,
		kMaterialMushroom    = 20,
		kMaterialFlyMushroom = 21,
		kMaterialMeat        = 22,
		kEndOfEnum           = 23,
		MAX                  = 24
	};

	/**
	 * Enum TLScheme.EContractBoardType
	 */
	enum class EContractBoardType : uint8_t
	{
		kNone     = 0,
		kMemorial = 1,
		kPlayer   = 2,
		kBookmark = 3,
		kArea     = 4,
		kAll      = 5,
		MAX       = 6
	};

	/**
	 * Enum TLScheme.ETLEventScheduleType
	 */
	enum class ETLEventScheduleType : uint8_t
	{
		kNormalEvent = 0,
		kPeaceEvent  = 1,
		kGuildEvent  = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETLTimeTableType
	 */
	enum class ETLTimeTableType : uint8_t
	{
		kNone             = 0,
		kDynamiEvent      = 1,
		kSiegeWarfare     = 2,
		kRegionStone      = 3,
		kBossStone        = 4,
		kWorldBoss        = 5,
		kTaxDelivery      = 6,
		kFieldBoss        = 7,
		kRespawnFieldBoss = 8,
		EndOfEnum         = 9,
		MAX               = 10
	};

	/**
	 * Enum TLScheme.ETLHyperLinkType
	 */
	enum class ETLHyperLinkType : uint8_t
	{
		WorldMap         = 0,
		ItemDropInfoRace = 1,
		ItemDropInfoType = 2,
		DynamicEvent     = 3,
		ItemCollection   = 4,
		CodexAdventure   = 5,
		CodexAchievement = 6,
		Contract         = 7,
		GuildContract    = 8,
		Npc              = 9,
		Fo               = 10,
		Memorial         = 11,
		FieldBoss        = 12,
		ArchBoss         = 13,
		Castle           = 14,
		TaxDelivery      = 15,
		GuildViewer      = 16,
		TradeSearch      = 17,
		Species          = 18,
		Character        = 19,
		Option           = 20,
		EndOfEnum        = 21,
		MAX              = 22
	};

	/**
	 * Enum TLScheme.ETLAbsoluteTimerType
	 */
	enum class ETLAbsoluteTimerType : uint8_t
	{
		ShopReset             = 0,
		FreeRecoverCountReset = 1,
		MAX                   = 2
	};

	/**
	 * Enum TLScheme.EInspectionTargetWidget
	 */
	enum class EInspectionTargetWidget : uint8_t
	{
		Hud       = 0,
		Adventure = 1,
		MAX       = 2
	};

	/**
	 * Enum TLScheme.EContractType
	 */
	enum class EContractType : uint8_t
	{
		kNone = 0,
		kNpc  = 1,
		kItem = 2,
		kBm   = 3,
		MAX   = 4
	};

	/**
	 * Enum TLScheme.ETLSkillClassType
	 */
	enum class ETLSkillClassType : uint8_t
	{
		kNone          = 0,
		kWeaponType    = 1,
		kPolymorph     = 2,
		kSpecial       = 3,
		kRanking       = 4,
		kWeaponMastery = 5,
		MAX            = 6
	};

	/**
	 * Enum TLScheme.ETLCodexObjectiveActionType
	 */
	enum class ETLCodexObjectiveActionType : uint8_t
	{
		kNone         = 0,
		kTalk         = 1,
		kKill         = 2,
		kInteraction  = 3,
		kInspection   = 4,
		kCollection   = 5,
		kContract     = 6,
		kDynamicEvent = 7,
		kTimeLapse    = 8,
		kCutScene     = 9,
		kLock         = 10,
		kRewardable   = 11,
		kRewarded     = 12,
		kEndOfEnum    = 13,
		MAX           = 14
	};

	/**
	 * Enum TLScheme.ECutsceneActionWhenCompleted
	 */
	enum class ECutsceneActionWhenCompleted : uint8_t
	{
		Default       = 0,
		BlackScreen   = 1,
		WhiteScreen   = 2,
		LoadingScreen = 3,
		EndOfEnum     = 4,
		MAX           = 5
	};

	/**
	 * Enum TLScheme.ECodexCodeType
	 */
	enum class ECodexCodeType : uint8_t
	{
		kNone      = 0,
		kPrologue  = 1,
		kNormal    = 2,
		kChallenge = 3,
		kUpdate    = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ECodexCategoryType
	 */
	enum class ECodexCategoryType : uint8_t
	{
		kAdventure   = 0,
		kAchievement = 1,
		kCollection  = 2,
		kEndOfEnum   = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.EContractRefreshListReason
	 */
	enum class EContractRefreshListReason : uint8_t
	{
		kNone                             = 0,
		kInitialize                       = 1,
		kRequestRefreshList               = 2,
		kNpcListRefreshWithAcceptContract = 3,
		kAcceptContract                   = 4,
		kStopContract                     = 5,
		kFinishContract                   = 6,
		kChangeContract                   = 7,
		kRewardContract                   = 8,
		kChangeStateContract              = 9,
		kContractedList                   = 10,
		kBookmarkChange                   = 11,
		kFavoritesChange                  = 12,
		kOnlyFavoritesModeChange          = 13,
		MAX                               = 14
	};

	/**
	 * Enum TLScheme.EInteractionSkillWaitingReason
	 */
	enum class EInteractionSkillWaitingReason : uint8_t
	{
		None      = 0,
		Ownership = 1,
		MAX       = 2
	};

	/**
	 * Enum TLScheme.EInteractionDialogType
	 */
	enum class EInteractionDialogType : uint8_t
	{
		DialogTypeNone        = 0,
		DialogTypeCodexDialog = 1,
		MAX                   = 2
	};

	/**
	 * Enum TLScheme.EInteractionFacilityType
	 */
	enum class EInteractionFacilityType : uint8_t
	{
		None          = 0,
		kShop         = 1,
		kStorage      = 2,
		kCastleKeeper = 3,
		kCraft        = 4,
		kRecovery     = 5,
		kPolymorph    = 6,
		kGuildStorage = 7,
		kMining       = 8,
		kGathering    = 9,
		kLogging      = 10,
		kViewPoint    = 11,
		kContract     = 12,
		MAX           = 13
	};

	/**
	 * Enum TLScheme.EInteractionActionType
	 */
	enum class EInteractionActionType : uint8_t
	{
		kNone     = 0,
		kSkill    = 1,
		kFacility = 2,
		kDialogue = 3,
		kSpeak    = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.EContractGroupType
	 */
	enum class EContractGroupType : uint8_t
	{
		kNpc  = 0,
		kItem = 1,
		kBm   = 2,
		MAX   = 3
	};

	/**
	 * Enum TLScheme.EContractRewardType
	 */
	enum class EContractRewardType : uint8_t
	{
		kGold          = 0,
		kExp           = 1,
		kAligmentPoint = 2,
		kItem          = 3,
		kContractCoin  = 4,
		kActivePoint   = 5,
		MAX            = 6
	};

	/**
	 * Enum TLScheme.EContractGrade
	 */
	enum class EContractGrade : uint8_t
	{
		kOne   = 0,
		kTwo   = 1,
		kThree = 2,
		kFour  = 3,
		kFive  = 4,
		MAX    = 5
	};

	/**
	 * Enum TLScheme.ECustomizeFacialCategory
	 */
	enum class ECustomizeFacialCategory : uint8_t
	{
		kNone      = 0,
		kEyeBrow   = 1,
		kEye       = 2,
		kNose      = 3,
		klip       = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ECustomizeUIDetailCategory
	 */
	enum class ECustomizeUIDetailCategory : uint8_t
	{
		Face_Preset    = 0,
		Face_Shape     = 1,
		Face_Skin      = 2,
		Face_Cheek     = 3,
		Face_Chin      = 4,
		Eyes_Preset    = 5,
		Eyes_Iris      = 6,
		Eyes_Pupil     = 7,
		Eyes_Whole     = 8,
		Eyes_Side      = 9,
		Eyebrow_Preset = 10,
		Eyebrow_Whole  = 11,
		Eyebrow_Side   = 12,
		Nose_Preset    = 13,
		Nose_Whole     = 14,
		Nose_Side      = 15,
		Mouth_Preset   = 16,
		Mouth_Whole    = 17,
		Mouth_Side     = 18,
		Ear_Preset     = 19,
		Ear_Whole      = 20,
		Makeup_Preset  = 21,
		Makeup_Eyes    = 22,
		Makeup_Cheek   = 23,
		Makeup_Mouth   = 24,
		Makeup_Tattoo  = 25,
		Hair_Style     = 26,
		Hair_Color     = 27,
		Hair_Ombre     = 28,
		Beard          = 29,
		Beard_Long     = 30,
		Body_Height    = 31,
		Body_Upper     = 32,
		Body_Middle    = 33,
		Body_Lower     = 34,
		Max            = 35
	};

	/**
	 * Enum TLScheme.ECustomizeUIMiddleCategory
	 */
	enum class ECustomizeUIMiddleCategory : uint8_t
	{
		Face      = 0,
		Eyes      = 1,
		Eyebrow   = 2,
		Nose      = 3,
		Mouth     = 4,
		Ear       = 5,
		Makeup    = 6,
		Hair      = 7,
		Body      = 8,
		Costume   = 9,
		Voice     = 10,
		Facial    = 11,
		Lighting  = 12,
		Polymorph = 13,
		Max       = 14
	};

	/**
	 * Enum TLScheme.ECustomizeUIHighCategory
	 */
	enum class ECustomizeUIHighCategory : uint8_t
	{
		Main      = 0,
		Facial    = 1,
		NonFacial = 2,
		Preview   = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ECustomizeUIPresetBlendPoints
	 */
	enum class ECustomizeUIPresetBlendPoints : uint8_t
	{
		Top    = 0,
		Right  = 1,
		Bottom = 2,
		Left   = 3,
		Max    = 4
	};

	/**
	 * Enum TLScheme.ECustomizeGender
	 */
	enum class ECustomizeGender : uint8_t
	{
		kAll       = 0,
		kMale      = 1,
		kFemale    = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ECustomizeHistoryType
	 */
	enum class ECustomizeHistoryType : uint8_t
	{
		Default        = 0,
		Preset         = 1,
		Randomize      = 2,
		Reset          = 3,
		ArmorPreset    = 4,
		VoicePreset    = 5,
		LoadSnapshot   = 6,
		LoadFile       = 7,
		AICustomize    = 8,
		DesignerPreset = 9,
		MAX            = 10
	};

	/**
	 * Enum TLScheme.ECustomizeType
	 */
	enum class ECustomizeType : uint8_t
	{
		kNone                 = 0,
		kFaceType             = 1,
		kSkinRoughness        = 2,
		kFaceColor            = 3,
		kFaceSpotType         = 4,
		kFaceSpotIntensity    = 5,
		kScarType             = 6,
		kScarIntensity        = 7,
		kWrinkleIntensity     = 8,
		kCheek2Up             = 9,
		kCheek2Side           = 10,
		kCheek2Front          = 11,
		kCheekWidth           = 12,
		kCheek1Front          = 13,
		kCheek1Side           = 14,
		kCheek1Up             = 15,
		kCheekFront           = 16,
		kCheekSide            = 17,
		kTempleSide           = 18,
		kChinLength           = 19,
		kChinWidth            = 20,
		kJawFront             = 21,
		kSideJawUp            = 22,
		kSideJawFront         = 23,
		kSideJawScale         = 24,
		kJawLowerHeight       = 25,
		kJawTipFront          = 26,
		kJawTipScale          = 27,
		kJawTipLength         = 28,
		kIrisColor_Left       = 29,
		kIrisColor_Right      = 30,
		kIrisType             = 31,
		kIrisSize             = 32,
		kIrisBrightness       = 33,
		kPupilSize            = 34,
		kPupilWidth           = 35,
		kEyeSide              = 36,
		kEyeFront             = 37,
		kEyeSize              = 38,
		kEyeHeight            = 39,
		kEyelidOutSide        = 40,
		kEyelidInSide         = 41,
		kEyeRotation          = 42,
		kEyeSlope             = 43,
		kEyelidInUp           = 44,
		kEyelidInUpper        = 45,
		kEyelidOutUpper       = 46,
		kEyelidInLower        = 47,
		kEyelidOutLower       = 48,
		kEyelashIcon          = 49,
		kEyeBrowIntensity     = 50,
		kEyeBrowColor         = 51,
		kEyelashPos           = 52,
		kBrowWide             = 53,
		kBrowFront            = 54,
		kBrowThickness        = 55,
		kBrow1Up              = 56,
		kBrow1Side            = 57,
		kBrow1Front           = 58,
		kBrow2Up              = 59,
		kBrow2Side            = 60,
		kBrow2Front           = 61,
		kNoseUp               = 62,
		kNoseHeight           = 63,
		kNoseFront            = 64,
		kNoseScale            = 65,
		kBrowCFront           = 66,
		kNoseMidScale         = 67,
		kNoseMidFront         = 68,
		kNoseTipScale         = 69,
		kNoseTipUp            = 70,
		kNoseTipFront         = 71,
		kNoseBridgeHeight     = 72,
		kLipHeight            = 73,
		kLipLength            = 74,
		kLipDepth             = 75,
		kLipSlope             = 76,
		kUpperLipFront        = 77,
		kLowerLipFront        = 78,
		kUpperLipUp           = 79,
		kLowerLipUp           = 80,
		kEarType              = 81,
		kEarScale             = 82,
		kEarRotate            = 83,
		kEyelashType          = 84,
		kEyeLineType          = 85,
		kEyeLineIntensity     = 86,
		kEyeDecoIcon          = 87,
		kEyeDecoIntensity1    = 88,
		kEyeDecoIntensity2    = 89,
		kEyeDecoColor1        = 90,
		kEyeDecoColor2        = 91,
		kEyeGlitterIntensity  = 92,
		kBlusherX             = 93,
		kBlusherY             = 94,
		kBlusherIntensity     = 95,
		kBlusherColor         = 96,
		kLipType              = 97,
		kLipIntensity         = 98,
		kLipRoughness         = 99,
		kLipColor             = 100,
		kLipsGlitterIntensity = 101,
		kTattooType3          = 102,
		kTattooIntensity3     = 103,
		kTattooType           = 104,
		kTattooIntensity1     = 105,
		kTattooIntensity2     = 106,
		kTattooColor          = 107,
		kTattooColor2         = 108,
		kHairType             = 109,
		kHairColor            = 110,
		kHairTipType          = 111,
		kHairTipRange         = 112,
		kHairTipIntensity     = 113,
		kHairTipColor         = 114,
		kBeardType            = 115,
		kBeardIntensity       = 116,
		kLongBeardType        = 117,
		kLongBeardIntensity   = 118,
		kBeardColor           = 119,
		kHeight               = 120,
		kHeadSize             = 121,
		kNeckThickness        = 122,
		kShoulderHeight       = 123,
		kShoulderThickness    = 124,
		kShoulderWidth        = 125,
		kUpperBody            = 126,
		kBreastSize           = 127,
		kBreastUp             = 128,
		kUpperArmSize         = 129,
		kForeArmSize          = 130,
		kHandSize             = 131,
		kAbdomenFatSize       = 132,
		kPelvis               = 133,
		kThighSize            = 134,
		kCalfSize             = 135,
		kVoiceType            = 136,
		kEyeUp                = 137,
		kCheekHeight          = 138,
		kCheekboneFront       = 139,
		kEyelashColor         = 140,
		kEyelashIntensity     = 141,
		kEyeLineColor         = 142,
		kEyeRoughness         = 143,
		kTattooColor3         = 144,
		kTattooX              = 145,
		kTattooY              = 146,
		kTattooSize           = 147,
		kTattooRotation       = 148,
		kEndOfEnum            = 149,
		MAX                   = 150
	};

	/**
	 * Enum TLScheme.ECustomizeCategory
	 */
	enum class ECustomizeCategory : uint8_t
	{
		kNone      = 0,
		kFace      = 1,
		kMakeUp    = 2,
		kHair      = 3,
		kBody      = 4,
		kAll       = 5,
		kEndOfEnum = 6,
		MAX        = 7
	};

	/**
	 * Enum TLScheme.ECustomizeUIType
	 */
	enum class ECustomizeUIType : uint8_t
	{
		kNone         = 0,
		kIcon         = 1,
		kSlide        = 2,
		kDefaultColor = 3,
		kSkinColor    = 4,
		MAX           = 5
	};

	/**
	 * Enum TLScheme.EViewMakrType
	 */
	enum class EViewMakrType : uint8_t
	{
		kNone             = 0,
		kCastleOwnerGuild = 1,
		kGuild            = 2,
		MAX               = 3
	};

	/**
	 * Enum TLScheme.EGraphUserType
	 */
	enum class EGraphUserType : uint8_t
	{
		kCitizen = 0,
		kMonster = 1,
		kPlayer  = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.ETLResurrectionLocationType
	 */
	enum class ETLResurrectionLocationType : uint8_t
	{
		DefaultPoint     = 0,
		SiegePoint       = 1,
		SiegeCastlePoint = 2,
		DEPoint          = 3,
		StartPoint       = 4,
		NearPoint        = 5,
		TaxDeliveryPoint = 6,
		InDungeon        = 7,
		OutDungeon       = 8,
		GuildSkillPoint  = 9,
		GuildRaid        = 10,
		GuildHome        = 11,
		WorldBossPoint   = 12,
		MAX              = 13
	};

	/**
	 * Enum TLScheme.ETransformType
	 */
	enum class ETransformType : uint8_t
	{
		kNone    = 0,
		kBase    = 1,
		kDerived = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.EEventRewardType
	 */
	enum class EEventRewardType : uint8_t
	{
		kGold           = 0,
		kExp            = 1,
		kGuildExp       = 2,
		kDiamond        = 3,
		kItem           = 4,
		kGuildRankPoint = 5,
		kBmCoin         = 6,
		kActivePoint    = 7,
		kGuildCoin      = 8,
		MAX             = 9
	};

	/**
	 * Enum TLScheme.ETLDynamicEventUIType
	 */
	enum class ETLDynamicEventUIType : uint8_t
	{
		Type00 = 0,
		Type01 = 1,
		Type02 = 2,
		Type03 = 3,
		Type04 = 4,
		Type05 = 5,
		Type06 = 6,
		Type07 = 7,
		Type08 = 8,
		Type09 = 9,
		None   = 10,
		MAX    = 11
	};

	/**
	 * Enum TLScheme.ETLContextPolymorphType
	 */
	enum class ETLContextPolymorphType : uint8_t
	{
		DASH      = 0,
		SWIM      = 1,
		GLIDE     = 2,
		EndOfEnum = 3,
		NONE      = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.ETLFrameShowType
	 */
	enum class ETLFrameShowType : uint8_t
	{
		None                        = 0,
		HideHud                     = 1,
		HideOtherFocusedFrame       = 2,
		HideHudAndOtherFocusedFrame = 3,
		MAX                         = 4
	};

	/**
	 * Enum TLScheme.ETLWidgetLayout
	 */
	enum class ETLWidgetLayout : uint8_t
	{
		FRAME               = 0,
		WINDOW              = 1,
		FULL_SCREEN         = 2,
		FULL_SCREEN_SERVICE = 3,
		DIALOGUE_BOX        = 4,
		DIALOGUE_INVITE_BOX = 5,
		MAX                 = 6
	};

	/**
	 * Enum TLScheme.ETLWidgetLayer
	 */
	enum class ETLWidgetLayer : uint8_t
	{
		NO_FLAGS   = 0,
		SCREEN     = 1,
		HUD        = 2,
		POPUP      = 3,
		WINDOW     = 4,
		OVERLAY    = 5,
		TOPMOST    = 6,
		FULLSCREEN = 7,
		All        = 8,
		MAX        = 9
	};

	/**
	 * Enum TLScheme.ETLWidgetViewportLayer
	 */
	enum class ETLWidgetViewportLayer : uint8_t
	{
		LAYER_GAME           = 0,
		LAYER_UI             = 1,
		LAYER_TOOLTIP        = 2,
		LAYER_LOADING_SCREEN = 3,
		LAYER_TOPMOST        = 4,
		LAYER_MAX            = 5
	};

	/**
	 * Enum TLScheme.ETLController
	 */
	enum class ETLController : uint8_t
	{
		None = 0,
		PC   = 1,
		PS5  = 2,
		XBOX = 3,
		MAX  = 4
	};

	/**
	 * Enum TLScheme.ETLUIPreLoadType
	 */
	enum class ETLUIPreLoadType : uint8_t
	{
		DO_NOT_PRELOAD                  = 0,
		PREREQUISITES_FOR_START_GAME    = 1,
		PREREQUISITES_FOR_START_IN_GAME = 2,
		NONE                            = 3,
		MAX                             = 4
	};

	/**
	 * Enum TLScheme.ETLUIGameMode
	 */
	enum class ETLUIGameMode : uint8_t
	{
		InGameMode   = 0,
		TestGameMode = 1,
		DontPreload  = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETLUIStage
	 */
	enum class ETLUIStage : uint8_t
	{
		UI_STAGE_GAME       = 0,
		UI_STAGE_GAME_LOBBY = 1,
		UI_STAGE_NONE       = 2,
		UI_STAGE_MAX        = 3
	};

	/**
	 * Enum TLScheme.ETLUICacheLifeType
	 */
	enum class ETLUICacheLifeType : uint8_t
	{
		NONE                  = 0,
		DELETE_WHEN_LOBBY_END = 1,
		MAX                   = 2
	};

	/**
	 * Enum TLScheme.ETLUICacheType
	 */
	enum class ETLUICacheType : uint8_t
	{
		NoCache = 0,
		BPClass = 1,
		Widget  = 2,
		None    = 3,
		MAX     = 4
	};

	/**
	 * Enum TLScheme.ETLUILoadingType
	 */
	enum class ETLUILoadingType : uint8_t
	{
		Synchronous  = 0,
		Asynchronous = 1,
		None         = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETLUIWidgetType
	 */
	enum class ETLUIWidgetType : uint8_t
	{
		RootWidget    = 0,
		LayerWidget   = 1,
		Widget        = 2,
		ManagedWidget = 3,
		None          = 4,
		MAX           = 5
	};

	/**
	 * Enum TLScheme.ELoadingScreenType
	 */
	enum class ELoadingScreenType : uint8_t
	{
		kNormal     = 0,
		kManor      = 1,
		kController = 2,
		MAX         = 3
	};

	/**
	 * Enum TLScheme.ETLSensingOutLineType
	 */
	enum class ETLSensingOutLineType : uint8_t
	{
		NONE   = 0,
		TYPE_A = 1,
		TYPE_B = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.ETLPassiveType
	 */
	enum class ETLPassiveType : uint8_t
	{
		kNone     = 0,
		kAttack   = 1,
		kDefence  = 2,
		kRecovery = 3,
		kSpecial  = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.EStrongholdType
	 */
	enum class EStrongholdType : uint8_t
	{
		kCastleTower       = 0,
		kCastleDoor        = 1,
		kCastleWall        = 2,
		kCastleBarbican    = 3,
		kCastleInsideDoor  = 4,
		kCastleOutsideDoor = 5,
		kEndOfEnum         = 6,
		MAX                = 7
	};

	/**
	 * Enum TLScheme.EPostType
	 */
	enum class EPostType : uint8_t
	{
		kNone               = 0,
		kPlayer             = 1,
		kGm                 = 2,
		kGmMulti            = 3,
		kLevelUpReward      = 4,
		kDynamicEventReward = 5,
		kPvpReward          = 6,
		kGuildContribution  = 7,
		kPlayerToGuild      = 8,
		kPlayerToUnion      = 9,
		kEndOfEnum          = 10,
		MAX                 = 11
	};

	/**
	 * Enum TLScheme.EDamageFloaterType
	 */
	enum class EDamageFloaterType : uint8_t
	{
		kNone  = 0,
		kPrime = 1,
		kSkill = 2,
		MAX    = 3
	};

	/**
	 * Enum TLScheme.ETLNameplateState
	 */
	enum class ETLNameplateState : uint8_t
	{
		kAlwaysShow       = 0,
		kAlwaysHide       = 1,
		kByRule           = 2,
		kContentsMarkOnly = 3,
		MAX               = 4
	};

	/**
	 * Enum TLScheme.ETLItemGroupFilter
	 */
	enum class ETLItemGroupFilter : uint8_t
	{
		kAll        = 0,
		kEquip      = 1,
		kUsable     = 2,
		kMaterials  = 3,
		kMiscs      = 4,
		kWeapon     = 5,
		kArmor      = 6,
		kAccessory  = 7,
		kAutoUse    = 8,
		kReinforcer = 9,
		kEndOfEnum  = 10,
		MAX         = 11
	};

	/**
	 * Enum TLScheme.EItemPackageSortType
	 */
	enum class EItemPackageSortType : uint8_t
	{
		kItemSortGrade    = 0,
		kItemSortCategory = 1,
		kItemSortName     = 2,
		kItemSortCount    = 3,
		kEndOfEnum        = 4,
		MAX               = 5
	};

	/**
	 * Enum TLScheme.EItemSortType
	 */
	enum class EItemSortType : uint8_t
	{
		kItemSortGrade       = 0,
		kItemSortEnchant     = 1,
		kItemSortUid         = 2,
		kItemSortCount       = 3,
		kItemSortWear        = 4,
		kItemSortType        = 5,
		kItemSortCategory    = 6,
		kItemSortWeight      = 7,
		kItemAutoUse         = 8,
		kItemSystemRecommand = 9,
		kEndOfEnum           = 10,
		MAX                  = 11
	};

	/**
	 * Enum TLScheme.ETLDistanceType
	 */
	enum class ETLDistanceType : uint8_t
	{
		MinRange   = 0,
		MaxRange   = 1,
		OutOfRange = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.EFacilityType
	 */
	enum class EFacilityType : uint8_t
	{
		kNone                   = 0,
		kShop                   = 1,
		kStorage                = 2,
		kCastleKeeper           = 3,
		kCraft                  = 4,
		kRecovery               = 5,
		kGuildStorage           = 6,
		kMining                 = 7,
		kGathering              = 8,
		kLogging                = 9,
		kViewPoint              = 10,
		kContract               = 11,
		kTerritoryFogOpening    = 12,
		kBeautyShop             = 13,
		kItemGain               = 14,
		kDungeonWaypoint        = 15,
		kRotationEvent          = 16,
		kGuildRaid              = 17,
		kDungeonWaypointOpening = 18,
		kDeveloperLetter        = 19,
		kCodexCollection        = 20,
		kOpenInstanceDungeonUI  = 21,
		MAX                     = 22
	};

	/**
	 * Enum TLScheme.ESkillElementType
	 */
	enum class ESkillElementType : uint8_t
	{
		kNone     = 0,
		kPhysical = 1,
		kFire     = 2,
		kWater    = 3,
		kEarth    = 4,
		kWind     = 5,
		MAX       = 6
	};

	/**
	 * Enum TLScheme.EItemEnchantTransferGrade
	 */
	enum class EItemEnchantTransferGrade : uint8_t
	{
		kC         = 0,
		kB         = 1,
		kA         = 2,
		kAA        = 3,
		kAAA       = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ETLDamageType
	 */
	enum class ETLDamageType : uint8_t
	{
		kMelee = 0,
		kRange = 1,
		kMagic = 2,
		kError = 3,
		MAX    = 4
	};

	/**
	 * Enum TLScheme.ETLVoiceType
	 */
	enum class ETLVoiceType : uint8_t
	{
		VoiceType1 = 0,
		VoiceType2 = 1,
		VoiceType3 = 2,
		MAX        = 3
	};

	/**
	 * Enum TLScheme.ETLGender
	 */
	enum class ETLGender : uint8_t
	{
		Male   = 0,
		Female = 1,
		MAX    = 2
	};

	/**
	 * Enum TLScheme.ETLPolymorphSlot
	 */
	enum class ETLPolymorphSlot : uint8_t
	{
		ICON_SLOT_01   = 0,
		ICON_SLOT_02   = 1,
		ICON_SLOT_03   = 2,
		ICON_SLOT_04   = 3,
		ICON_SLOT_05   = 4,
		ICON_SLOT_06   = 5,
		ICON_SLOT_07   = 6,
		ICON_SLOT_08   = 7,
		ICON_SLOT_09   = 8,
		ICON_SLOT      = 9,
		ICON_SLOT01    = 10,
		ICON_SLOT02    = 11,
		ICON_SLOT03    = 12,
		ICON_SLOT04    = 13,
		ICON_SLOT05    = 14,
		ICON_SLOT06    = 15,
		ICON_SLOT_MAX  = 16,
		ICON_SLOT_NONE = 17
	};

	/**
	 * Enum TLScheme.ESkillEnchantCategory
	 */
	enum class ESkillEnchantCategory : uint8_t
	{
		kNone     = 0,
		kAttack   = 1,
		kMove     = 2,
		kDebuff   = 3,
		kBuff     = 4,
		kRecovery = 5,
		MAX       = 6
	};

	/**
	 * Enum TLScheme.ESkillSettingSlotType
	 */
	enum class ESkillSettingSlotType : uint8_t
	{
		Active  = 0,
		Passive = 1,
		Special = 2,
		Ranking = 3,
		Enchant = 4,
		MAX     = 5
	};

	/**
	 * Enum TLScheme.EActionSkillType
	 */
	enum class EActionSkillType : uint8_t
	{
		kPrimeSkill = 0,
		kPolymorph  = 1,
		kDash       = 2,
		kWaitRiding = 3,
		kEndOfEnum  = 4,
		MAX         = 5
	};

	/**
	 * Enum TLScheme.ESkillSlotType
	 */
	enum class ESkillSlotType : uint8_t
	{
		kActiveSkill  = 0,
		kPassiveSkill = 1,
		MAX           = 2
	};

	/**
	 * Enum TLScheme.ETLSkillOptionRank
	 */
	enum class ETLSkillOptionRank : uint8_t
	{
		All    = 0,
		Error  = 1,
		Rank1  = 2,
		Rank2  = 3,
		Rank3  = 4,
		Rank4  = 5,
		Rank5  = 6,
		Rank6  = 7,
		Rank7  = 8,
		Rank8  = 9,
		Rank9  = 10,
		Rank10 = 11,
		Rank11 = 12,
		Rank12 = 13,
		Rank13 = 14,
		Rank14 = 15,
		Rank15 = 16,
		Rank16 = 17,
		MAX    = 18
	};

	/**
	 * Enum TLScheme.ETLSkillExclusiveGroup
	 */
	enum class ETLSkillExclusiveGroup : uint8_t
	{
		kGroup_01  = 0,
		kGroup_02  = 1,
		kGroup_03  = 2,
		kGroup_04  = 3,
		kGroup_05  = 4,
		kGroup_06  = 5,
		kGroup_07  = 6,
		kGroup_08  = 7,
		kGroup_09  = 8,
		kGroup     = 9,
		kGroup_Max = 10,
		kEndOfEnum = 11,
		MAX        = 12
	};

	/**
	 * Enum TLScheme.EDayOfWeekScheme
	 */
	enum class EDayOfWeekScheme : uint8_t
	{
		Monday    = 0,
		Tuesday   = 1,
		Wednesday = 2,
		Thursday  = 3,
		Friday    = 4,
		Saturday  = 5,
		Sunday    = 6,
		MAX       = 7
	};

	/**
	 * Enum TLScheme.ESkillGrade
	 */
	enum class ESkillGrade : uint8_t
	{
		kC         = 0,
		kB         = 1,
		kA         = 2,
		kAA        = 3,
		kAAA       = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ESkillPhaseType
	 */
	enum class ESkillPhaseType : uint8_t
	{
		kNone        = 0,
		kSwing       = 1,
		kFollowSwing = 2,
		kFinish      = 3,
		kError       = 4,
		MAX          = 5
	};

	/**
	 * Enum TLScheme.EChangeInitStateType
	 */
	enum class EChangeInitStateType : uint8_t
	{
		kNone            = 0,
		kCodexCollection = 1,
		kDeveloperLetter = 2,
		MAX              = 3
	};

	/**
	 * Enum TLScheme.EUseSpawnCondType
	 */
	enum class EUseSpawnCondType : uint8_t
	{
		kNone    = 0,
		kBase    = 1,
		kDerived = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.ERangeFormulaType
	 */
	enum class ERangeFormulaType : uint8_t
	{
		kRangeOfConstant                  = 0,
		kRangeFromNthRootOfAttackPower    = 1,
		kRangeFromAttackRange             = 2,
		kRangeFromAttackRangeWithWind     = 3,
		kRangeFromDualAttackRange         = 4,
		kRangeFromDualAttackRangeWithWind = 5,
		kRangeFromAuraRadiusModifier      = 6,
		MAX                               = 7
	};

	/**
	 * Enum TLScheme.EHeightFormulaType
	 */
	enum class EHeightFormulaType : uint8_t
	{
		kHeightOfConstant                  = 0,
		kHeightFromAttackRange             = 1,
		kHeightFromAttackRangeWithWind     = 2,
		kHeightFromDualAttackRange         = 3,
		kHeightFromDualAttackRangeWithWind = 4,
		kHeightFromNthRootOfAttackPower    = 5,
		kHeightFromObjectHeight            = 6,
		MAX                                = 7
	};

	/**
	 * Enum TLScheme.EFormulaType
	 */
	enum class EFormulaType : uint8_t
	{
		kAmountFromMinMax                                = 0,
		kAmountFromHpMax                                 = 1,
		kAmountFromCostMax                               = 2,
		kAmountFromAttackRange                           = 3,
		kAmountFromDistance                              = 4,
		kAmountFromNormalAttackDelay                     = 5,
		kAmountFromAttackPower                           = 6,
		kAmountFromAttackPowerWithinMinMax               = 7,
		kAmountFromAttackPowerWithinMinMaxAndTargetHpMax = 8,
		kAmountFromAttackPowerAndCost                    = 9,
		kAmountFromAttackPowerAndTargetHpMax             = 10,
		kAmountFromDamageReduction                       = 11,
		kAmountFromCostRegen                             = 12,
		kAmountFromTargetHpMax                           = 13,
		kAmountFromTargetHpMaxOrMinValue                 = 14,
		kAmountFromTargetHpMaxOrMaxValue                 = 15,
		kAmountFromAuraEffectBoost                       = 16,
		kAmountFromFalling                               = 17,
		kAmountFromAttackPowerForPrimeAttack             = 18,
		kAmountFromAttackPowerForPrimeAttackWithinMinMax = 19,
		kAmountFromAttackSpeedRatioBetweenHands          = 20,
		kAmountFromTargetHpBPWithinLimits                = 21,
		kAmountFromHp                                    = 22,
		kAmountFromTargetHp                              = 23,
		kAmountFromUsableCost                            = 24,
		kAmountFromConsumptionCost                       = 25,
		kAmountFromPassiveHpConsumption                  = 26,
		kAmountFromTailWindSpeed                         = 27,
		kAmountFromWindSpeed                             = 28,
		MAX                                              = 29
	};

	/**
	 * Enum TLScheme.EFilterType
	 */
	enum class EFilterType : uint8_t
	{
		None             = 0,
		HPRange          = 1,
		Codex            = 2,
		Guild            = 3,
		CodexCollection  = 4,
		DeveloperLetter  = 5,
		WayPoint         = 6,
		CodexAchievement = 7,
		MAX              = 8
	};

	/**
	 * Enum TLScheme.ESpawnHitDirectionType
	 */
	enum class ESpawnHitDirectionType : uint8_t
	{
		kNone   = 0,
		kTop    = 1,
		kFront  = 2,
		kBack   = 3,
		kLeft   = 4,
		kRight  = 5,
		kFromFo = 6,
		MAX     = 7
	};

	/**
	 * Enum TLScheme.ETransitResultType
	 */
	enum class ETransitResultType : uint8_t
	{
		kDespawn     = 0,
		kChangeState = 1,
		kTransform   = 2,
		MAX          = 3
	};

	/**
	 * Enum TLScheme.ETransitCondType
	 */
	enum class ETransitCondType : uint8_t
	{
		kNone        = 0,
		kDropCount   = 1,
		kInteraction = 2,
		kCooldown    = 3,
		kDeath       = 4,
		kRevival     = 5,
		MAX          = 6
	};

	/**
	 * Enum TLScheme.EItemDropCondType
	 */
	enum class EItemDropCondType : uint8_t
	{
		kNone         = 0,
		kInteraction  = 1,
		kCurrentState = 2,
		MAX           = 3
	};

	/**
	 * Enum TLScheme.ETLContentCategory
	 */
	enum class ETLContentCategory : uint8_t
	{
		kNone          = 0,
		kMap           = 1,
		kZone          = 2,
		kTerritory     = 3,
		kNpcSpawn      = 4,
		kFoSpawn       = 5,
		kSiegeWarfare  = 6,
		kRegionStone   = 7,
		kBossStone     = 8,
		kWorldBoss     = 9,
		kDynamicEvent  = 10,
		kTaxDelivery   = 11,
		kFieldBoss     = 12,
		kMemorial      = 13,
		kCodex         = 14,
		kChallenge     = 15,
		kContract      = 16,
		kGuildContract = 17,
		kAchievement   = 18,
		EndOfEnum      = 19,
		MAX            = 20
	};

	/**
	 * Enum TLScheme.EGuildRelationship
	 */
	enum class EGuildRelationship : uint8_t
	{
		None            = 0,
		Alliance        = 1,
		Enemy           = 2,
		Observation     = 3,
		RequestAlliance = 4,
		My              = 5,
		MyUnion         = 6,
		MAX             = 7
	};

	/**
	 * Enum TLScheme.EGuildMemeberGrade
	 */
	enum class EGuildMemeberGrade : uint8_t
	{
		None      = 0,
		Master    = 1,
		SubMaster = 2,
		Guardian  = 3,
		Trainee   = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.EGuildSkillType
	 */
	enum class EGuildSkillType : uint8_t
	{
		Active  = 0,
		Passive = 1,
		Max     = 2
	};

	/**
	 * Enum TLScheme.EGuildContractRewardType
	 */
	enum class EGuildContractRewardType : uint8_t
	{
		kGold             = 0,
		kGuildCoin        = 1,
		kExp              = 2,
		kGuildExp         = 3,
		kItem             = 4,
		kReputationPoint  = 5,
		kLostAndFoundCoin = 6,
		kActivePoint      = 7,
		MAX               = 8
	};

	/**
	 * Enum TLScheme.EGuildLockState
	 */
	enum class EGuildLockState : uint8_t
	{
		UnLock     = 0,
		Memorial   = 1,
		Level      = 2,
		RemainTime = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.EGuildContractState
	 */
	enum class EGuildContractState : uint8_t
	{
		Standby   = 0,
		Change    = 1,
		Lock      = 2,
		Progress  = 3,
		Completed = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.EInstanceMapGuideEventLooksType
	 */
	enum class EInstanceMapGuideEventLooksType : uint8_t
	{
		Event          = 0,
		EventStep      = 1,
		EventObjective = 2,
		MAX            = 3
	};

	/**
	 * Enum TLScheme.EGaugeType
	 */
	enum class EGaugeType : uint8_t
	{
		kNone                 = 0,
		kPrivate              = 1,
		kCompetitive          = 2,
		kCooperative          = 3,
		kSkillHitDelay        = 4,
		kPrivateWithHookSkill = 5,
		MAX                   = 6
	};

	/**
	 * Enum TLScheme.EConditionCategory
	 */
	enum class EConditionCategory : uint8_t
	{
		kNone                          = 0,
		kItem                          = 1,
		kEffect                        = 2,
		kEventEffect                   = 3,
		kGuildMaster                   = 4,
		kGuildAdmin                    = 5,
		kGuildManager                  = 6,
		kGuildLevel                    = 7,
		kCastleOwner                   = 8,
		kCastleGuildMember             = 9,
		kCastleAllyGuild               = 10,
		kCastleUnion                   = 11,
		kEnableOwnerGuild              = 12,
		kEnableAllyGuild               = 13,
		kEnableOwnerUnion              = 14,
		kEnableTempOwnerGuild          = 15,
		kTribe                         = 16,
		kCoverTribe                    = 17,
		kEmptyPlunder                  = 18,
		kLevel                         = 19,
		kClosedTerritoryFog            = 20,
		kCodexObjective                = 21,
		kRegionStonePossessionMaxCount = 22,
		kBossStonePossessionMaxCount   = 23,
		kCastlePossessionMaxCount      = 24,
		kDynamicEventSide              = 25,
		kContribution                  = 26,
		kKey                           = 27,
		kRotationEventStart            = 28,
		kMemorial                      = 29,
		kClosedDungeonWaypoint         = 30,
		kPolymorph                     = 31,
		kMaxUserCount                  = 32,
		kAchievement                   = 33,
		kGuildItem                     = 34,
		MAX                            = 35
	};

	/**
	 * Enum TLScheme.EItemAcquisitionType
	 */
	enum class EItemAcquisitionType : uint8_t
	{
		Drop         = 0,
		DynamicEvent = 1,
		Contract     = 2,
		Craft        = 3,
		Shop         = 4,
		Gathering    = 5,
		None         = 6,
		MAX          = 7
	};

	/**
	 * Enum TLScheme.EItemTooltipComponent
	 */
	enum class EItemTooltipComponent : uint8_t
	{
		Title        = 0,
		TopInfos     = 1,
		Stats        = 2,
		Skills       = 3,
		Description  = 4,
		SetEquipment = 5,
		BottomInfos  = 6,
		EndOfEnum    = 7,
		MAX          = 8
	};

	/**
	 * Enum TLScheme.EItemMaterial
	 */
	enum class EItemMaterial : uint8_t
	{
		None         = 0,
		Silver       = 1,
		Mithril      = 2,
		BlackMithril = 3,
		Orichalcon   = 4,
		Magic        = 5,
		Jewel        = 6,
		Iron         = 7,
		Bone         = 8,
		Wood         = 9,
		Leather      = 10,
		Fabric       = 11,
		Plate        = 12,
		EndOfEnum    = 13,
		MAX          = 14
	};

	/**
	 * Enum TLScheme.EEnchantMethod
	 */
	enum class EEnchantMethod : uint8_t
	{
		None   = 0,
		Normal = 1,
		MAX    = 2
	};

	/**
	 * Enum TLScheme.EEnchantCategory
	 */
	enum class EEnchantCategory : uint8_t
	{
		kNone      = 0,
		kWeapon    = 1,
		kArmor     = 2,
		kAccessory = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ETLGachaCategory
	 */
	enum class ETLGachaCategory : uint8_t
	{
		None      = 0,
		Polymorph = 1,
		MagicDoll = 2,
		Equip     = 3,
		Misc      = 4,
		SkillBook = 5,
		Key       = 6,
		Coin      = 7,
		MAX       = 8
	};

	/**
	 * Enum TLScheme.EItemAutoUseType
	 */
	enum class EItemAutoUseType : uint8_t
	{
		kHP      = 0,
		kBuff    = 1,
		kDebuff  = 2,
		kLantern = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.ETLItemCollectionType
	 */
	enum class ETLItemCollectionType : uint8_t
	{
		kC                       = 0,
		kB                       = 1,
		kA                       = 2,
		kAA                      = 3,
		kAAA                     = 4,
		kEndOfItemCollectionType = 5,
		MAX                      = 6
	};

	/**
	 * Enum TLScheme.EItemCollectionOptionType
	 */
	enum class EItemCollectionOptionType : uint8_t
	{
		All       = 0,
		Stat      = 1,
		Attack    = 2,
		Defense   = 3,
		EndOfEnum = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.ETLItemQuickSlotId
	 */
	enum class ETLItemQuickSlotId : uint8_t
	{
		kNormalSlot0               = 0,
		kPcPlatformEnd             = 1,
		kConsoleItemQuickSlotStart = 2,
		kConsoleItemQuickSlotEnd   = 3,
		kConsoleRingMenuSlotStart  = 4,
		kConsoleRingMenuSlotEnd    = 5,
		kEndOfEnum                 = 6,
		MAX                        = 7
	};

	/**
	 * Enum TLScheme.ETLItemSetParts
	 */
	enum class ETLItemSetParts : uint8_t
	{
		kA         = 0,
		kB         = 1,
		kC         = 2,
		kD         = 3,
		kE         = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ETLMagicDollDialogEventType
	 */
	enum class ETLMagicDollDialogEventType : uint8_t
	{
		Idle        = 0,
		Reaction    = 1,
		Nudge       = 2,
		Tutorial    = 3,
		MagicPortal = 4,
		MAX         = 5
	};

	/**
	 * Enum TLScheme.ETLMagicDollStatType
	 */
	enum class ETLMagicDollStatType : uint8_t
	{
		None                        = 0,
		DroppedItemPickable         = 1,
		HpMax                       = 2,
		HpRegen                     = 3,
		CostMax                     = 4,
		CostRegen                   = 5,
		CostConsumptionModifier     = 6,
		BuffCostConsumptionModifier = 7,
		SkillCooldownModifier       = 8,
		MovementSpeedModifier       = 9,
		AdjustExpAcquired           = 10,
		AdjustGoldAcquired          = 11,
		AdjustGoldDrop              = 12,
		AdjustItemDrop              = 13,
		BelongingWeightCap          = 14,
		EarnDungeonPointModifier    = 15,
		SpendDungeonPointModifier   = 16,
		PickExtraMaterialChance     = 17,
		MagicDollHealModifier       = 18,
		EndOfEnum                   = 19,
		MAX                         = 20
	};

	/**
	 * Enum TLScheme.ETLMapDataType
	 */
	enum class ETLMapDataType : uint8_t
	{
		ALL                      = 0,
		ZONE                     = 1,
		REGION                   = 2,
		WAYPOINT                 = 3,
		EVENT_WAYPOINT           = 4,
		RESURRECTION_POINT       = 5,
		GUILD_FLAG               = 6,
		SIEGE_RESURRECTION_POINT = 7,
		SIEGE_PLUNDER_POINT      = 8,
		SIEGE_OUTPOST            = 9,
		SIEGE_THRONE             = 10,
		LINER                    = 11,
		REGION_STONE             = 12,
		BOSS_STONE               = 13,
		MAX                      = 14
	};

	/**
	 * Enum TLScheme.ETLMapContentsType
	 */
	enum class ETLMapContentsType : uint8_t
	{
		NONE       = 0,
		BEGINNING  = 1,
		PERSISTENT = 2,
		INSTANCE   = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ETLMapType
	 */
	enum class ETLMapType : uint8_t
	{
		NONE = 0,
		GAME = 1,
		TEST = 2,
		MAX  = 3
	};

	/**
	 * Enum TLScheme.EWaypointType
	 */
	enum class EWaypointType : uint8_t
	{
		Waypoint      = 0,
		EventWaypoint = 1,
		MAX           = 2
	};

	/**
	 * Enum TLScheme.ETLContentResurrectionType
	 */
	enum class ETLContentResurrectionType : uint8_t
	{
		kNone              = 0,
		kResurrectionPoint = 1,
		kStartPoint        = 2,
		kInstanceDungeon   = 3,
		kGuildRaid         = 4,
		MAX                = 5
	};

	/**
	 * Enum TLScheme.ETLUpdateMapDisplaySource
	 */
	enum class ETLUpdateMapDisplaySource : uint8_t
	{
		Any           = 0,
		FloorList     = 1,
		MapRegionList = 2,
		RegionInfo    = 3,
		MAX           = 4
	};

	/**
	 * Enum TLScheme.ETLMapDisplayType
	 */
	enum class ETLMapDisplayType : uint8_t
	{
		WorldMap         = 0,
		StandaloneIndoor = 1,
		OverlayIndoor    = 2,
		MAX              = 3
	};

	/**
	 * Enum TLScheme.ETLRegionMapDisplayType
	 */
	enum class ETLRegionMapDisplayType : uint8_t
	{
		None       = 0,
		Standalone = 1,
		Overlay    = 2,
		MAX        = 3
	};

	/**
	 * Enum TLScheme.ETLRegionSpaceType
	 */
	enum class ETLRegionSpaceType : uint8_t
	{
		None    = 0,
		OutDoor = 1,
		InDoor  = 2,
		Dungeon = 3,
		MAX     = 4
	};

	/**
	 * Enum TLScheme.ETLCompassHideReason
	 */
	enum class ETLCompassHideReason : uint8_t
	{
		None            = 0,
		OutOfAngle      = 1,
		OutOfRange      = 2,
		NotCreate       = 3,
		EventRange      = 4,
		MapIconHideFlag = 5,
		Clustered       = 6,
		MaxShowCount    = 7,
		HideDistance    = 8,
		MAX             = 9
	};

	/**
	 * Enum TLScheme.ETLCompassDistanceShowType
	 */
	enum class ETLCompassDistanceShowType : uint8_t
	{
		None        = 0,
		InsideRange = 1,
		MAX         = 2
	};

	/**
	 * Enum TLScheme.ETLCompassEventType
	 */
	enum class ETLCompassEventType : uint8_t
	{
		None         = 0,
		DynamicEvent = 1,
		Siege        = 2,
		ArchBoss     = 3,
		Occupation   = 4,
		TaxDelivery  = 5,
		MAX          = 6
	};

	/**
	 * Enum TLScheme.ETLCompassEventShowType
	 */
	enum class ETLCompassEventShowType : uint8_t
	{
		None       = 0,
		Always     = 1,
		ByDistance = 2,
		MAX        = 3
	};

	/**
	 * Enum TLScheme.ETLCompassShowType
	 */
	enum class ETLCompassShowType : uint8_t
	{
		None          = 0,
		Always        = 1,
		ByDistance    = 2,
		Event         = 3,
		CardinalPoint = 4,
		MAX           = 5
	};

	/**
	 * Enum TLScheme.ETLMapIconActionType
	 */
	enum class ETLMapIconActionType : uint8_t
	{
		SHOW = 0,
		HIDE = 1,
		MAX  = 2
	};

	/**
	 * Enum TLScheme.ETLEventStatus
	 */
	enum class ETLEventStatus : uint8_t
	{
		NONE                     = 0,
		SIEGE_WARFARE_STANDBY    = 1,
		SIEGE_WARFARE_INPROGRESS = 2,
		SIEGE_WARFARE_RESULT     = 3,
		SIEGE_WARFARE_NONE       = 4,
		MAX                      = 5
	};

	/**
	 * Enum TLScheme.ETLEventStatusBitFlag
	 */
	enum class ETLEventStatusBitFlag : uint8_t
	{
		SIEGE_WARFARE_STANDBY    = 0,
		SIEGE_WARFARE_INPROGRESS = 1,
		SIEGE_WARFARE_RESULT     = 2,
		SIEGE_WARFARE_NONE       = 3,
		SIEGE_WARFARE_MAX        = 4
	};

	/**
	 * Enum TLScheme.ETLMapIconCreateType
	 */
	enum class ETLMapIconCreateType : uint8_t
	{
		NONE     = 0,
		PRESET   = 1,
		DYNAMIC  = 2,
		TEMPLATE = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.EMapIconState
	 */
	enum class EMapIconState : uint8_t
	{
		Default  = 0,
		On       = 1,
		Off      = 2,
		Friendly = 3,
		Hostile  = 4,
		MAX      = 5
	};

	/**
	 * Enum TLScheme.EMapIconType
	 */
	enum class EMapIconType : uint8_t
	{
		None                        = 0,
		DebugZone                   = 1,
		DebugRegion                 = 2,
		DebugEvent                  = 3,
		DebugEventWarning           = 4,
		DebugSiegeWarning           = 5,
		DynamicEventRegion          = 6,
		SiegeWarfareShape           = 7,
		PathFollowLine              = 8,
		OccupationShape             = 9,
		WorldBossShape              = 10,
		TaxDeliveryShape            = 11,
		MapAreaShape                = 12,
		WorldpinLine                = 13,
		PlayerView                  = 14,
		Player                      = 15,
		Party                       = 16,
		Npc                         = 17,
		Waypoint                    = 18,
		Dungeon                     = 19,
		Town                        = 20,
		Manor                       = 21,
		Region                      = 22,
		Location                    = 23,
		BossNpc                     = 24,
		DynamicEventTarget          = 25,
		GuildFlag                   = 26,
		DynamicEvent                = 27,
		Pin                         = 28,
		InstanceMapTarget           = 29,
		GuildMember                 = 30,
		SavedPlace                  = 31,
		Siege                       = 32,
		WaypointSmall               = 33,
		ContractTarget              = 34,
		WorldUserPin                = 35,
		WorldPartyPin               = 36,
		WorldGuildPin               = 37,
		OtherPlayer                 = 38,
		ViewPoint                   = 39,
		RevengeTarget               = 40,
		WorldTemporaryPin           = 41,
		CodexAdventureWorldTarget   = 42,
		CodexAdventureTarget        = 43,
		CodexAchievementWorldTarget = 44,
		CodexAchievementTarget      = 45,
		GuildContractTarget         = 46,
		NotOpenWaypoint             = 47,
		ResourceObject              = 48,
		TestMapIconArea             = 49,
		RelationFavorite            = 50,
		RelationUnfavorite          = 51,
		WorldUnionPin               = 52,
		CompassCardinalPoint        = 53,
		PlayerAutoCombatRange       = 54,
		TaxDelivery                 = 55,
		TaxDeliveryTarget           = 56,
		TreasureBox                 = 57,
		TreasureBoxArea             = 58,
		LegionGuildHome             = 59,
		GuildHome                   = 60,
		GuildMemberAlram            = 61,
		GuildCallClan               = 62,
		GuildAttackedMember         = 63,
		ChaoticTarget               = 64,
		DungeonWaypoint             = 65,
		CodexAdventureCentroid      = 66,
		CodexAchievementCentroid    = 67,
		ContractCentroid            = 68,
		GuildContractCentroid       = 69,
		GuildSkillResurrectionArea  = 70,
		WorldBoss                   = 71,
		MaxCount                    = 72,
		End                         = 73,
		MAX                         = 74
	};

	/**
	 * Enum TLScheme.SystemMsgType
	 */
	enum class ESystemMsgType : uint8_t
	{
		SystemMsgTypekError            = 0,
		SystemMsgTypeNone              = 1,
		SystemMsgTypeChat              = 2,
		SystemMsgTypeScreen            = 3,
		SystemMsgTypeAll               = 4,
		SystemMsgTypeSound             = 5,
		SystemMsgTypeGuide             = 6,
		SystemMsgTypeSiege             = 7,
		SystemMsgTypeSystemMsgType_MAX = 8
	};

	/**
	 * Enum TLScheme.ETLMessageBoxProgressBarPlayType
	 */
	enum class ETLMessageBoxProgressBarPlayType : uint8_t
	{
		PLAY_TYPE_FIX_VALUE     = 0,
		PLAY_TYPE_TIME_INCREASE = 1,
		PLAY_TYPE_TIME_DECREASE = 2,
		PLAY_TYPE_NONE          = 3,
		PLAY_TYPE_MAX           = 4
	};

	/**
	 * Enum TLScheme.ETLMessageBoxBtnStyle
	 */
	enum class ETLMessageBoxBtnStyle : uint8_t
	{
		BTN_STYLE_OK            = 0,
		BTN_STYLE_OK_CANCEL     = 1,
		BTN_STYLE_YES_NO        = 2,
		BTN_STYLE_YES_NO_CANCEL = 3,
		BTN_STYLE_NONE          = 4,
		BTN_STYLE_MAX           = 5
	};

	/**
	 * Enum TLScheme.ETLMountCondition
	 */
	enum class ETLMountCondition : uint8_t
	{
		kNone      = 0,
		kGuildOnly = 1,
		MAX        = 2
	};

	/**
	 * Enum TLScheme.ETLEventSkipCondition
	 */
	enum class ETLEventSkipCondition : uint8_t
	{
		NONE                     = 0,
		COMPLETE_MAP_CHANGE_STEP = 1,
		MAX                      = 2
	};

	/**
	 * Enum TLScheme.ETLMoviePlaybackType
	 */
	enum class ETLMoviePlaybackType : uint8_t
	{
		PLAY_ONCE               = 0,
		PLAY_LOOP               = 1,
		PLAY_LOADING_LOOP       = 2,
		PLAY_LEVEL_LOADING_LOOP = 3,
		PLAY_MAX                = 4
	};

	/**
	 * Enum TLScheme.ETLMoviePlayerType
	 */
	enum class ETLMoviePlayerType : uint8_t
	{
		BINK_MEDIA_PLAYER    = 0,
		DEFAULT_MOVIE_PLAYER = 1,
		MAX                  = 2
	};

	/**
	 * Enum TLScheme.ETLNpcSectorCondition
	 */
	enum class ETLNpcSectorCondition : uint8_t
	{
		kNormal    = 0,
		kBroken    = 1,
		kDestroyed = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ETLNpcSector
	 */
	enum class ETLNpcSector : uint8_t
	{
		kSector1   = 0,
		kSector2   = 1,
		kSector3   = 2,
		kSector4   = 3,
		kEndOfEnum = 4,
		MAX        = 5
	};

	/**
	 * Enum TLScheme.ENpcSubType
	 */
	enum class ENpcSubType : uint8_t
	{
		None       = 0,
		Shop       = 1,
		kEndOfEnum = 2,
		MAX        = 3
	};

	/**
	 * Enum TLScheme.ENpcRoamingType
	 */
	enum class ENpcRoamingType : uint8_t
	{
		kStraight = 0,
		kCurve    = 1,
		kNatural  = 2,
		MAX       = 3
	};

	/**
	 * Enum TLScheme.EMenuCondition
	 */
	enum class EMenuCondition : uint8_t
	{
		TargetOnline             = 0,
		TargetAlive              = 1,
		Party                    = 2,
		TargetNotParty           = 3,
		TargetPartyMember        = 4,
		TargetNotPartyMember     = 5,
		PartyLeader              = 6,
		Guild                    = 7,
		NotGuild                 = 8,
		TargetGuild              = 9,
		TargetNotGuild           = 10,
		TargetNotGuildMember     = 11,
		TargetQualifyGuildLeader = 12,
		GuildLeader              = 13,
		GuildNotFullGuardian     = 14,
		TargetCanExiledFromGuild = 15,
		CanExileFromGuild        = 16,
		TargetNotGuildLeader     = 17,
		MAX                      = 18
	};

	/**
	 * Enum TLScheme.ETLDynamicStatFormulaType
	 */
	enum class ETLDynamicStatFormulaType : uint8_t
	{
		kSimple   = 0,
		kCompound = 1,
		MAX       = 2
	};

	/**
	 * Enum TLScheme.ETLPolymorphEnchantType
	 */
	enum class ETLPolymorphEnchantType : uint8_t
	{
		kNone                    = 0,
		kPolymorphEnchantControl = 1,
		kPolymorphEnchantAttack  = 2,
		kPolymorphEnchantMove    = 3,
		kPolymorphEnchantDefense = 4,
		kPolymorphEnchantWeak    = 5,
		kPolymorphEnchantStr     = 6,
		kPolymorphEnchantDex     = 7,
		kPolymorphEnchantCon     = 8,
		kPolymorphEnchantInt     = 9,
		kPolymorphEnchantWis     = 10,
		kPolymorphEnchantCha     = 11,
		kEndOfEnum               = 12,
		MAX                      = 13
	};

	/**
	 * Enum TLScheme.ETLBMShopPanelType
	 */
	enum class ETLBMShopPanelType : uint8_t
	{
		None      = 0,
		Promotion = 1,
		GoodsList = 2,
		Warehouse = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ETLBMShopGoodsCategory
	 */
	enum class ETLBMShopGoodsCategory : uint8_t
	{
		None             = 0,
		PackageSpecial   = 1,
		PackageCommon    = 2,
		GrowthEquip      = 3,
		GrowthUsable     = 4,
		EventSpecial     = 5,
		EventCommon      = 6,
		ContractCoin     = 7,
		GuildCoin        = 8,
		SocialCoin       = 9,
		FuncAdditional   = 10,
		FuncLimitary     = 11,
		FuncExpand       = 12,
		FuncSocial       = 13,
		CashCurrency     = 14,
		TicketSeasonPass = 15,
		TicketGrowthPass = 16,
		MAX              = 17
	};

	/**
	 * Enum TLScheme.ETLPurchaseSecondaryCategory
	 */
	enum class ETLPurchaseSecondaryCategory : uint8_t
	{
		None           = 0,
		PackageSpecial = 1,
		PackageCommon  = 2,
		GrowthEquip    = 3,
		GrowthUsable   = 4,
		EventSpecial   = 5,
		EventCommon    = 6,
		ContractCoin   = 7,
		GuildCoin      = 8,
		SocialCoin     = 9,
		FuncAdditional = 10,
		FuncLimitary   = 11,
		FuncExpand     = 12,
		FuncSocial     = 13,
		CashCurrency   = 14,
		CashPass       = 15,
		Max            = 16
	};

	/**
	 * Enum TLScheme.ETLPurchasePrimaryCategory
	 */
	enum class ETLPurchasePrimaryCategory : uint8_t
	{
		None      = 0,
		Package   = 1,
		Growth    = 2,
		Gacha     = 3,
		Event     = 4,
		Coin      = 5,
		Func      = 6,
		Cash      = 7,
		Warehouse = 8,
		Max       = 9
	};

	/**
	 * Enum TLScheme.ETLPVPHistoryMessageType
	 */
	enum class ETLPVPHistoryMessageType : uint8_t
	{
		Kill        = 0,
		Death       = 1,
		Taunt       = 2,
		Restoration = 3,
		Num         = 4,
		MAX         = 5
	};

	/**
	 * Enum TLScheme.FTLDynamicEventStoreValueType
	 */
	enum class EFTLDynamicEventStoreValueType : uint8_t
	{
		FTLDynamicEventStoreValueTypeMY_COUNT                          = 0,
		FTLDynamicEventStoreValueTypeMAX_COUNT                         = 1,
		FTLDynamicEventStoreValueTypeTOTAL_COUNT                       = 2,
		FTLDynamicEventStoreValueTypeTOP_COUNT                         = 3,
		FTLDynamicEventStoreValueTypeINFINITY_COUNT                    = 4,
		FTLDynamicEventStoreValueTypeACQUIREABLE_COUNT                 = 5,
		FTLDynamicEventStoreValueTypeFTLDynamicEventStoreValueType_MAX = 6
	};

	/**
	 * Enum TLScheme.EDynamicEventPointCountType
	 */
	enum class EDynamicEventPointCountType : uint8_t
	{
		RemainPoint  = 0,
		CurrentPoint = 1,
		MAX          = 2
	};

	/**
	 * Enum TLScheme.EStepProgressType
	 */
	enum class EStepProgressType : uint8_t
	{
		kNone     = 0,
		kPrepare  = 1,
		kProgress = 2,
		MAX       = 3
	};

	/**
	 * Enum TLScheme.ETLQuestType
	 */
	enum class ETLQuestType : uint8_t
	{
		DynamicEvent          = 0,
		InstanceMapGuideEvent = 1,
		InfinityDungeonEvent  = 2,
		MAX                   = 3
	};

	/**
	 * Enum TLScheme.EMenuItemSubGroupType
	 */
	enum class EMenuItemSubGroupType : uint8_t
	{
		None     = 0,
		Social   = 1,
		Party    = 2,
		Activity = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.EMenuItemConditionType
	 */
	enum class EMenuItemConditionType : uint8_t
	{
		None                       = 0,
		MyPc                       = 1,
		Online                     = 2,
		Alive                      = 3,
		MyPcIsPartyMember          = 4,
		MyPcIsMaster               = 5,
		TargetPcIsMaster           = 6,
		MyPcHasGuild               = 7,
		TargetIsMyGuildMember      = 8,
		TargetHasGuild             = 9,
		MyPcIsGuildManager         = 10,
		ValidObject                = 11,
		TargetMyParty              = 12,
		PcRelationshipFavorite     = 13,
		PcRelationshipUnfavorite   = 14,
		PcRelationshipFriend       = 15,
		PcRelationshipBlock        = 16,
		PcRelationshipNone         = 17,
		CanMakePartyMap            = 18,
		MyPcSendPcPostLevel        = 19,
		MyPcGroupChatManager       = 20,
		MyPcHasParty               = 21,
		PcRelationshipAddingFriend = 22,
		MAX                        = 23
	};

	/**
	 * Enum TLScheme.ESubMenuItemActionType
	 */
	enum class ESubMenuItemActionType : uint8_t
	{
		None              = 0,
		PartyPinAuthority = 1,
		MAX               = 2
	};

	/**
	 * Enum TLScheme.EMenuItemActionType
	 */
	enum class EMenuItemActionType : uint8_t
	{
		None               = 0,
		Whisper            = 1,
		Follow             = 2,
		InviteParty        = 3,
		PartyChangeMaster  = 4,
		PartyKick          = 5,
		PartyDraw          = 6,
		InviteGuild        = 7,
		ApplyGuild         = 8,
		AddFavorite        = 9,
		AddUnfavorite      = 10,
		RemoveFavorite     = 11,
		RemoveUnfavorite   = 12,
		AddFriend          = 13,
		RemoveFriend       = 14,
		AddBlock           = 15,
		RemoveBlock        = 16,
		SendPost           = 17,
		InviteGroupChat    = 18,
		CancelAddingFriend = 19,
		Report             = 20,
		MAX                = 21
	};

	/**
	 * Enum TLScheme.ERankingRewardType
	 */
	enum class ERankingRewardType : uint8_t
	{
		kExp         = 0,
		kPvp         = 1,
		kGuild       = 2,
		kActivePoint = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.EReportGameSource
	 */
	enum class EReportGameSource : uint8_t
	{
		kChat = 0,
		MAX   = 1
	};

	/**
	 * Enum TLScheme.EReportReasonCode
	 */
	enum class EReportReasonCode : uint8_t
	{
		kSwearWords = 0,
		kEndOfEnum  = 1,
		MAX         = 2
	};

	/**
	 * Enum TLScheme.ERotationEventContentRankingPointCategory
	 */
	enum class ERotationEventContentRankingPointCategory : uint8_t
	{
		kNone         = 0,
		kDynamicEvent = 1,
		EndOfEnum     = 2,
		MAX           = 3
	};

	/**
	 * Enum TLScheme.ERotationEventItemRankingCategory
	 */
	enum class ERotationEventItemRankingCategory : uint8_t
	{
		kNone      = 0,
		kWeapon    = 1,
		kArmor     = 2,
		kAccessory = 3,
		EndOfEnum  = 4,
		MAX        = 5
	};

	/**
	 * Enum TLScheme.ERotationEventItemRankingPointCategory
	 */
	enum class ERotationEventItemRankingPointCategory : uint8_t
	{
		kNone          = 0,
		kItemDecompose = 1,
		kItemEnchant   = 2,
		kItemCraft     = 3,
		EndOfEnum      = 4,
		MAX            = 5
	};

	/**
	 * Enum TLScheme.ERotationEventNpcRankingPointCategory
	 */
	enum class ERotationEventNpcRankingPointCategory : uint8_t
	{
		kNone     = 0,
		kHunting  = 1,
		EndOfEnum = 2,
		MAX       = 3
	};

	/**
	 * Enum TLScheme.ERotationEventRankingType
	 */
	enum class ERotationEventRankingType : uint8_t
	{
		kNone     = 0,
		kNpc      = 1,
		kItem     = 2,
		kContent  = 3,
		EndOfEnum = 4,
		MAX       = 5
	};

	/**
	 * Enum TLScheme.ETLScreenMsgExpire
	 */
	enum class ETLScreenMsgExpire : uint8_t
	{
		kNone      = 0,
		kLoading   = 1,
		kCounter   = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.ETLScreenMsgPriority
	 */
	enum class ETLScreenMsgPriority : uint8_t
	{
		kImmediateOnly = 0,
		kImmediate     = 1,
		kFront         = 2,
		kNormal        = 3,
		MAX            = 4
	};

	/**
	 * Enum TLScheme.ETLScreenMsgGroup
	 */
	enum class ETLScreenMsgGroup : uint8_t
	{
		kUI          = 0,
		kSystem      = 1,
		kNotice      = 2,
		kDialog      = 3,
		kContents    = 4,
		kBroadcast   = 5,
		kMap         = 6,
		kTopMost     = 7,
		kGuildNotice = 8,
		kChat        = 9,
		kEndOfEnum   = 10,
		MAX          = 11
	};

	/**
	 * Enum TLScheme.ETLCastingUIType
	 */
	enum class ETLCastingUIType : uint8_t
	{
		OnHud           = 0,
		PopupMessageBox = 1,
		MAX             = 2
	};

	/**
	 * Enum TLScheme.EEnvironmentalAffected
	 */
	enum class EEnvironmentalAffected : uint8_t
	{
		None  = 0,
		Wind  = 1,
		Night = 2,
		Rain  = 3,
		MAX   = 4
	};

	/**
	 * Enum TLScheme.ETLSkillBuffType
	 */
	enum class ETLSkillBuffType : uint8_t
	{
		LongBuff  = 0,
		ShortBuff = 1,
		Debuff    = 2,
		Normal    = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.EPassiveSkillType
	 */
	enum class EPassiveSkillType : uint8_t
	{
		kNone        = 0,
		kPolymorph   = 1,
		kEnvironment = 2,
		kCommon      = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.ETLChainSkillDirection
	 */
	enum class ETLChainSkillDirection : uint8_t
	{
		kForwardDirection = 0,
		kChangeDirection  = 1,
		kTowardTarget     = 2,
		MAX               = 3
	};

	/**
	 * Enum TLScheme.ETLTargetApproachType
	 */
	enum class ETLTargetApproachType : uint8_t
	{
		None           = 0,
		TargetApproach = 1,
		MAX            = 2
	};

	/**
	 * Enum TLScheme.ESkillAttackSide
	 */
	enum class ESkillAttackSide : uint8_t
	{
		kError         = 0,
		kMainHand      = 1,
		kOffHand       = 2,
		kBothHand      = 3,
		kInvisibleHand = 4,
		MAX            = 5
	};

	/**
	 * Enum TLScheme.ETLDefensibleSkillAttackType
	 */
	enum class ETLDefensibleSkillAttackType : uint8_t
	{
		kError        = 0,
		kNormal       = 1,
		kHeavy        = 2,
		kIndefensible = 3,
		MAX           = 4
	};

	/**
	 * Enum TLScheme.ESkillPcRotateFlag
	 */
	enum class ESkillPcRotateFlag : uint8_t
	{
		kError                   = 0,
		kDefault                 = 1,
		kTargetDir               = 2,
		kMyPcDir                 = 3,
		kInputDir                = 4,
		kCameraDir               = 5,
		kInputOrCameraDir        = 6,
		kInputOrCameraReverseDir = 7,
		MAX                      = 8
	};

	/**
	 * Enum TLScheme.ETargetValidType
	 */
	enum class ETargetValidType : uint8_t
	{
		kError       = 0,
		None         = 1,
		Need_Target  = 2,
		Smart_Target = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.ESkillPriority
	 */
	enum class ESkillPriority : uint8_t
	{
		kError      = 0,
		Trivial     = 1,
		Minor       = 2,
		Normal      = 3,
		Major       = 4,
		Independent = 5,
		MAX         = 6
	};

	/**
	 * Enum TLScheme.ESkillTargetBase
	 */
	enum class ESkillTargetBase : uint8_t
	{
		kError          = 0,
		kCaster         = 1,
		kTarget         = 2,
		kFriendlyTarget = 3,
		kPos            = 4,
		MAX             = 5
	};

	/**
	 * Enum TLScheme.ETLSkillTargetLivingStatus
	 */
	enum class ETLSkillTargetLivingStatus : uint8_t
	{
		kError       = 0,
		kAlive       = 1,
		kDead        = 2,
		kDeadOrAlive = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.ETLSkillRotate
	 */
	enum class ETLSkillRotate : uint8_t
	{
		kError              = 0,
		DontRotate          = 1,
		RotateWhenHit       = 2,
		KeepRotateBeforeHit = 3,
		KeepRotate          = 4,
		MAX                 = 5
	};

	/**
	 * Enum TLScheme.ETLSkillTargetRelation
	 */
	enum class ETLSkillTargetRelation : uint8_t
	{
		kError              = 0,
		kAll                = 1,
		kHostile            = 2,
		kFriendly           = 3,
		kFriendlyAndNeutral = 4,
		kHostileAndFriendly = 5,
		kParty              = 6,
		kFriendlyParty      = 7,
		kPartyAll           = 8,
		MAX                 = 9
	};

	/**
	 * Enum TLScheme.ETLSkillPropensity
	 */
	enum class ETLSkillPropensity : uint8_t
	{
		kError      = 0,
		kHarmful    = 1,
		kBeneficial = 2,
		kNeither    = 3,
		MAX         = 4
	};

	/**
	 * Enum TLScheme.ESkillMoveType
	 */
	enum class ESkillMoveType : uint8_t
	{
		kError      = 0,
		kNone       = 1,
		kFixedSpeed = 2,
		kFixedTime  = 3,
		kCanMove    = 4,
		MAX         = 5
	};

	/**
	 * Enum TLScheme.EProjectileInfo
	 */
	enum class EProjectileInfo : uint8_t
	{
		kError     = 0,
		None       = 1,
		Normal     = 2,
		Chain      = 3,
		Hover      = 4,
		kEndOfEnum = 5,
		MAX        = 6
	};

	/**
	 * Enum TLScheme.ESkillInputType
	 */
	enum class ESkillInputType : uint8_t
	{
		kError    = 0,
		General   = 1,
		Toggle    = 2,
		kTwoDepth = 3,
		MAX       = 4
	};

	/**
	 * Enum TLScheme.ESkillCategory
	 */
	enum class ESkillCategory : uint8_t
	{
		kError   = 0,
		kSkill   = 1,
		kItem    = 2,
		kPassive = 3,
		kFo      = 4,
		MAX      = 5
	};

	/**
	 * Enum TLScheme.EGlobalCooldownGroup
	 */
	enum class EGlobalCooldownGroup : uint8_t
	{
		kError                         = 0,
		kNone                          = 1,
		kSkillGlobal_01                = 2,
		kSkillGlobal_02                = 3,
		kSkillGlobal_03                = 4,
		kSkillGlobal_04                = 5,
		kItemGlobal_01                 = 6,
		kReserved_01                   = 7,
		kPenaltyGlobalStart            = 8,
		kPenaltyGlobal_Equip           = 9,
		kPenaltyGlobal_CombatPolymorph = 10,
		kPenaltyGlobal_MagicDoll       = 11,
		kPenaltyGlobalEnd              = 12,
		MAX                            = 13
	};

	/**
	 * Enum TLScheme.ESocialMotionPlayType
	 */
	enum class ESocialMotionPlayType : uint8_t
	{
		SingleMotion = 0,
		GroupMotion  = 1,
		SetMotion    = 2,
		SetPose      = 3,
		MAX          = 4
	};

	/**
	 * Enum TLScheme.ESocialMotionType
	 */
	enum class ESocialMotionType : uint8_t
	{
		Facial = 0,
		Motion = 1,
		MAX    = 2
	};

	/**
	 * Enum TLScheme.ENpcState
	 */
	enum class ENpcState : uint8_t
	{
		kNone          = 0,
		kSpawn         = 1,
		kIdle          = 2,
		kInteraction   = 3,
		kCombatStart   = 4,
		kCombatSupport = 5,
		kInCombat      = 6,
		kDie           = 7,
		kEndOfEnum     = 8,
		MAX            = 9
	};

	/**
	 * Enum TLScheme.ESpecialDungeonDayOfWeek
	 */
	enum class ESpecialDungeonDayOfWeek : uint8_t
	{
		None      = 0,
		Monday    = 1,
		Tuesday   = 2,
		Wednesday = 3,
		Thursday  = 4,
		Friday    = 5,
		Saturday  = 6,
		Sunday    = 7,
		ALL       = 8,
		MAX       = 9
	};

	/**
	 * Enum TLScheme.ESpecialDungeonType
	 */
	enum class ESpecialDungeonType : uint8_t
	{
		TimeLimit = 0,
		Infinity  = 1,
		Max       = 2
	};

	/**
	 * Enum TLScheme.EWeakness
	 */
	enum class EWeakness : uint8_t
	{
		kSilver    = 0,
		kHoly      = 1,
		kBurn      = 2,
		kEndOfEnum = 3,
		MAX        = 4
	};

	/**
	 * Enum TLScheme.EAdjustStatType
	 */
	enum class EAdjustStatType : uint8_t
	{
		kNone                         = 0,
		kSTRAndAddHp                  = 1,
		kHpMaxAndAddHp                = 2,
		kHpMaxModifierAndAddHp        = 3,
		kCostMaxAndAddCost            = 4,
		kSTR                          = 5,
		kDEX                          = 6,
		kINT                          = 7,
		kPER                          = 8,
		kAttackPowerMainHand          = 9,
		kAttackPowerOffHand           = 10,
		kBonusAttackPowerMainHand     = 11,
		kBonusAttackPowerOffHand      = 12,
		kAttackPowerModifier          = 13,
		kAttackSpeedModifier          = 14,
		kAttackSpeedModifierOffHand   = 15,
		kAttackRangeModifier          = 16,
		kHpMax                        = 17,
		kHpMaxModifier                = 18,
		kHpRegen                      = 19,
		kHpRegenModifier              = 20,
		kPotionHealModifier           = 21,
		kMagicDollHealModifier        = 22,
		kMeleeArmor                   = 23,
		kRangeArmor                   = 24,
		kMagicArmor                   = 25,
		kArmorModifier                = 26,
		kAttackRating                 = 27,
		kShieldBlockChance            = 28,
		kShieldBlockChancePenetration = 29,
		kShieldBlockEfficiency        = 30,
		kCostMax                      = 31,
		kCostRegen                    = 32,
		kCostRegenModifier            = 33,
		kCostSpend                    = 34,
		kCostConsumptionModifier      = 35,
		kMeleeCriticalAttack          = 36,
		kRangeCriticalAttack          = 37,
		kMagicCriticalAttack          = 38,
		kMeleeCriticalDefense         = 39,
		kRangeCriticalDefense         = 40,
		kMagicCriticalDefense         = 41,
		kMeleeDoubleAttack            = 42,
		kRangeDoubleAttack            = 43,
		kMagicDoubleAttack            = 44,
		kMeleeDoubleDefense           = 45,
		kRangeDoubleDefense           = 46,
		kMagicDoubleDefense           = 47,
		kMeleeAccuracy                = 48,
		kRangeAccuracy                = 49,
		kMagicAccuracy                = 50,
		kMeleeEvasion                 = 51,
		kRangeEvasion                 = 52,
		kMagicEvasion                 = 53,
		kBossBonusAttackPower         = 54,
		kBossDamageReduction          = 55,
		kBossMeleeCriticalAttack      = 56,
		kBossRangeCriticalAttack      = 57,
		kBossMagicCriticalAttack      = 58,
		kBossMeleeCriticalDefense     = 59,
		kBossRangeCriticalDefense     = 60,
		kBossMagicCriticalDefense     = 61,
		kBossMeleeDoubleAttack        = 62,
		kBossRangeDoubleAttack        = 63,
		kBossMagicDoubleAttack        = 64,
		kBossMeleeDoubleDefense       = 65,
		kBossRangeDoubleDefense       = 66,
		kBossMagicDoubleDefense       = 67,
		kBossMeleeAccuracy            = 68,
		kBossRangeAccuracy            = 69,
		kBossMagicAccuracy            = 70,
		kBossMeleeEvasion             = 71,
		kBossRangeEvasion             = 72,
		kBossMagicEvasion             = 73,
		kPvPMeleeCriticalAttack       = 74,
		kPvPRangeCriticalAttack       = 75,
		kPvPMagicCriticalAttack       = 76,
		kPvPMeleeCriticalDefense      = 77,
		kPvPRangeCriticalDefense      = 78,
		kPvPMagicCriticalDefense      = 79,
		kPvPMeleeDoubleAttack         = 80,
		kPvPRangeDoubleAttack         = 81,
		kPvPMagicDoubleAttack         = 82,
		kPvPMeleeDoubleDefense        = 83,
		kPvPRangeDoubleDefense        = 84,
		kPvPMagicDoubleDefense        = 85,
		kPvPMeleeAccuracy             = 86,
		kPvPRangeAccuracy             = 87,
		kPvPMagicAccuracy             = 88,
		kPvPMeleeEvasion              = 89,
		kPvPRangeEvasion              = 90,
		kPvPMagicEvasion              = 91,
		kMeleeDamageDealtModifier     = 92,
		kRangeDamageDealtModifier     = 93,
		kMagicDamageDealtModifier     = 94,
		kMeleeDamageTakenModifier     = 95,
		kRangeDamageTakenModifier     = 96,
		kMagicDamageTakenModifier     = 97,
		kCriticalDamageDealtModifier  = 98,
		kPvPDamageDealtModifier       = 99,
		kPvPDamageTakenModifier       = 100,
		kSkillPowerAmplification      = 101,
		kSkillPowerResistance         = 102,
		kBuffGivenDurationModifier    = 103,
		kDebuffTakenDurationModifier  = 104,
		kAuraEffectBoost              = 105,
		kAuraEffectBoostModifier      = 106,
		kAuraRadiusModifier           = 107,
		kDamageReduction              = 108,
		kGrankusDamageReduction       = 109,
		kEinardenDamageReduction      = 110,
		kDragonDamageReduction        = 111,
		kDemonDamageReduction         = 112,
		kUndeadDamageReduction        = 113,
		kCreationDamageReduction      = 114,
		kSpiritDamageReduction        = 115,
		kAnimalDamageReduction        = 116,
		kInsectDamageReduction        = 117,
		kPlantDamageReduction         = 118,
		kDamageReductionPenetration   = 119,
		kBonusGrankusAttackPower      = 120,
		kBonusEinardenAttackPower     = 121,
		kBonusDragonAttackPower       = 122,
		kBonusDemonAttackPower        = 123,
		kBonusUndeadAttackPower       = 124,
		kBonusCreationAttackPower     = 125,
		kBonusSpiritAttackPower       = 126,
		kBonusAnimalAttackPower       = 127,
		kBonusInsectAttackPower       = 128,
		kBonusPlantAttackPower        = 129,
		kWeakenAccuracy               = 130,
		kWeakenTolerance              = 131,
		kStunAccuracy                 = 132,
		kStunTolerance                = 133,
		kPetrificationAccuracy        = 134,
		kPetrificationTolerance       = 135,
		kSleepAccuracy                = 136,
		kSleepTolerance               = 137,
		kSilenceAccuracy              = 138,
		kSilenceTolerance             = 139,
		kBindAccuracy                 = 140,
		kBindTolerance                = 141,
		kBlindAccuracy                = 142,
		kBlindTolerance               = 143,
		kCollideAmplification         = 144,
		kCollideResistance            = 145,
		kWeakenCriticalAttack         = 146,
		kWeakenCriticalDefense        = 147,
		kStunCriticalAttack           = 148,
		kStunCriticalDefense          = 149,
		kPetrificationCriticalAttack  = 150,
		kPetrificationCriticalDefense = 151,
		kSleepCriticalAttack          = 152,
		kSleepCriticalDefense         = 153,
		kSilenceCriticalAttack        = 154,
		kSilenceCriticalDefense       = 155,
		kBindCriticalAttack           = 156,
		kBindCriticalDefense          = 157,
		kBlindCriticalAttack          = 158,
		kBlindCriticalDefense         = 159,
		kWeakenDoubleAttack           = 160,
		kWeakenDoubleDefense          = 161,
		kStunDoubleAttack             = 162,
		kStunDoubleDefense            = 163,
		kPetrificationDoubleAttack    = 164,
		kPetrificationDoubleDefense   = 165,
		kSleepDoubleAttack            = 166,
		kSleepDoubleDefense           = 167,
		kSilenceDoubleAttack          = 168,
		kSilenceDoubleDefense         = 169,
		kBindDoubleAttack             = 170,
		kBindDoubleDefense            = 171,
		kBlindDoubleAttack            = 172,
		kBlindDoubleDefense           = 173,
		kStunImmune                   = 174,
		kPetrificationImmune          = 175,
		kSleepImmune                  = 176,
		kSilenceImmune                = 177,
		kBindImmune                   = 178,
		kBlindImmune                  = 179,
		kCollideImmune                = 180,
		kMoveSpeed                    = 181,
		kMoveSpeedModifier            = 182,
		kBelongingWeightCap           = 183,
		kHealTakenModifier            = 184,
		kAdjustExpAcquired            = 185,
		kAdjustGoldAcquired           = 186,
		kAdjustItemDrop               = 187,
		kAdjustGoldDrop               = 188,
		kAdjustResourceDrop           = 189,
		kEarnWeaponMasteryExpModifier = 190,
		kEarnDungeonPointModifier     = 191,
		kSpendDungeonPointModifier    = 192,
		kGatheringSpeed               = 193,
		kGatheringSpeedModifier       = 194,
		kGatheringDoubleChance        = 195,
		kGatheringCriticalChance      = 196,
		kAggroModifier                = 197,
		kHealModifier                 = 198,
		kSkillHealTakenModifier       = 199,
		kSkillCooldownModifier        = 200,
		kGlobalSkillCooldownModifier  = 201,
		kStaminaMax                   = 202,
		kStaminaRegen                 = 203,
		kStaminaRegenModifier         = 204,
		kStaminaConsumption           = 205,
		kStaminaConsumptionModifier   = 206,
		kHittedStopDurationModifier   = 207,
		kHittedStopPreventChance      = 208,
		kHp                           = 209,
		kCost                         = 210,
		kStamina                      = 211,
		MAX                           = 212
	};

	/**
	 * Enum TLScheme.ETLTreasureBoxType
	 */
	enum class ETLTreasureBoxType : uint8_t
	{
		NORMAL   = 0,
		ADVANCED = 1,
		NONE     = 2,
		MAX      = 3
	};

	/**
	 * Enum TLScheme.ETLTutorialProgressStatus
	 */
	enum class ETLTutorialProgressStatus : uint8_t
	{
		kNone    = 0,
		kReady   = 1,
		kStart   = 2,
		kDisable = 3,
		MAX      = 4
	};

	/**
	 * Enum TLScheme.ETutorialCompleteType
	 */
	enum class ETutorialCompleteType : uint8_t
	{
		kMove                = 0,
		kJump                = 1,
		kControlCamera       = 2,
		kOpenInventory       = 3,
		kOpenSkillCustom     = 4,
		kUseSkill            = 5,
		kUseItem             = 6,
		kDie                 = 7,
		kDelayTime           = 8,
		kPlayCutscene        = 9,
		kServerOperation     = 10,
		kAutoUseQuickSlot    = 11,
		kOpenCharacterWindow = 12,
		MAX                  = 13
	};

	/**
	 * Enum TLScheme.ETutorialPreconditionType
	 */
	enum class ETutorialPreconditionType : uint8_t
	{
		kEnterRegion                = 0,
		kEnterContentsVolume        = 1,
		kCompleteTutorial           = 2,
		kAcquireItem                = 3,
		kLevelUp                    = 4,
		kServerOperation            = 5,
		kChangeSkillSetForSkillSlot = 6,
		MAX                         = 7
	};

	/**
	 * Enum TLScheme.ETLUIGroupActionType
	 */
	enum class ETLUIGroupActionType : uint8_t
	{
		None        = 0,
		ShowAndHide = 1,
		Show        = 2,
		Hide        = 3,
		AlwaysHide  = 4,
		Max         = 5
	};

	/**
	 * Enum TLScheme.ETLCameraUserOption
	 */
	enum class ETLCameraUserOption : uint8_t
	{
		MAX_ZOOM_DISTANCE   = 0,
		WORLD_TARGET_OFFSET = 1,
		PROJECTION_OFFSET   = 2,
		NONE                = 3,
		MAX                 = 4
	};

	/**
	 * Enum TLScheme.ETLUserCameraType
	 */
	enum class ETLUserCameraType : uint8_t
	{
		Center      = 0,
		Shoulder    = 1,
		QuarterView = 2,
		BackView    = 3,
		Gliding     = 4,
		Siege       = 5,
		EndOfEnum   = 6,
		MAX         = 7
	};

	/**
	 * Enum TLScheme.ETLWindGrade
	 */
	enum class ETLWindGrade : uint8_t
	{
		GRADE_ZERO  = 0,
		GRADE_ONE   = 1,
		GRADE_TWO   = 2,
		GRADE_THREE = 3,
		GRADE_COUNT = 4,
		GRADE_MAX   = 5
	};

	/**
	 * Enum TLScheme.ETLWindDirection
	 */
	enum class ETLWindDirection : uint8_t
	{
		DIR_NONE       = 0,
		DIR_NORTH      = 1,
		DIR_NORTH_WEST = 2,
		DIR_WEST       = 3,
		DIR_SOUTH_WEST = 4,
		DIR_SOUTH      = 5,
		DIR_SOUTH_EAST = 6,
		DIR_EAST       = 7,
		DIR_NORTH_EAST = 8,
		END_OF_ENUM    = 9,
		MAX            = 10
	};

	/**
	 * Enum TLScheme.ETLScreenMsgType
	 */
	enum class ETLScreenMsgType : uint8_t
	{
		kSystem                        = 0,
		kNotice                        = 1,
		kDynamicEvent                  = 2,
		kDynamicEvent_Begin            = 3,
		kDynamicEvent_Finished         = 4,
		kDynamicEvent_Success          = 5,
		kDynamicEvent_Failure          = 6,
		kLevel                         = 7,
		kSiege                         = 8,
		kSiegeSide                     = 9,
		kRegion                        = 10,
		kSkill                         = 11,
		kItemAcquireScreen             = 12,
		kGuildLevelUp                  = 13,
		kGuildLevelDown                = 14,
		kWorldEffect_Start             = 15,
		kWorldEffect_End               = 16,
		kItemCollection_Complete       = 17,
		kSystemFullScreen              = 18,
		kPVPTaunt                      = 19,
		kTerritoryFog                  = 20,
		kRegionStone                   = 21,
		kBossStone                     = 22,
		kGuildContractStart            = 23,
		kGuildContractComplete         = 24,
		kGuildNotice                   = 25,
		kCodexAdventureStart           = 26,
		kCodexAdventureComplete        = 27,
		kChallengeComplete             = 28,
		kWorldBossStart                = 29,
		kWorldBossSuccess              = 30,
		kWorldBossFail                 = 31,
		kTeamBattleMessage             = 32,
		kMemorial                      = 33,
		kDialogue                      = 34,
		kTaxDelibery                   = 35,
		kContentsOpen                  = 36,
		kWeaponMasteryOpenConfirm      = 37,
		kTreasureBox                   = 38,
		kCodexAdventureReward          = 39,
		kChallengeReward               = 40,
		kContractReward                = 41,
		kTimeLimitDungeon              = 42,
		kInteractionCameraTitle        = 43,
		kSiegeWarfareSuccess           = 44,
		kSiegeWarfareFailure           = 45,
		kDungeonWaypointOpen           = 46,
		kGuildContractReward           = 47,
		kInfinityDungeonComplete       = 48,
		kCodexCollectionBundleComplete = 49,
		kCodexCollectionBookComplete   = 50,
		kGroupChatInvite               = 51,
		kUndercoverReward              = 52,
		kReward                        = 53,
		kMagicDollCollection_Complete  = 54,
		kPolymorphCollection_Complete  = 55,
		kVowCollection_Complete        = 56,
		kGrowthPassApply               = 57,
		kRotationEventStart            = 58,
		kRotationEventComplete         = 59,
		kRotationEventReward           = 60,
		kEndOfEnum                     = 61,
		MAX                            = 62
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct TLScheme.TLTableRowBase
	 * Size -> 0x0008 (FullSize[0x0010] - InheritedSize[0x0008])
	 */
	struct FTLTableRowBase : public FTableRowBase
	{
	public:
		class FName                                                RowName;                                                 // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLDataTableRowHandle
	 * Size -> 0x0000 (FullSize[0x0010] - InheritedSize[0x0010])
	 */
	struct FTLDataTableRowHandle : public FDataTableRowHandle
	{	};

	/**
	 * ScriptStruct TLScheme.TLSchemePolymorphLevelSkillInfo
	 * Size -> 0x000C
	 */
	struct FTLSchemePolymorphLevelSkillInfo
	{
	public:
		class FName                                                SkillComplexId;                                          // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SkillLevel;                                              // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLUIStatsValueInfo
	 * Size -> 0x0058
	 */
	struct FTLUIStatsValueInfo
	{
	public:
		ETLUIStatsValueType                                        Type;                                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBold;                                                   // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPcStatsType                                               PcStatsType;                                             // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EP6G[0x5];                                   // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                StatText;                                                // 0x0008(0x0018) Edit, NativeAccessSpecifierPublic
		int32_t                                                    Value;                                                   // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MJUR[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                FormatText;                                              // 0x0028(0x0018) Edit, NativeAccessSpecifierPublic
		class FText                                                ValueText;                                               // 0x0040(0x0018) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLSchemePolymorphEnchancedSkill
	 * Size -> 0x000C
	 */
	struct FTLSchemePolymorphEnchancedSkill
	{
	public:
		class FName                                                SkillComplexId;                                          // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              EnhancingLevel;                                          // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D6PO[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct TLScheme.TLPolymorphVeiledInfo
	 * Size -> 0x0038
	 */
	struct FTLPolymorphVeiledInfo
	{
	public:
		struct FSoftObjectPath                                     Portrait;                                                // 0x0000(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHiveEntityData*                                     HiveEntity;                                              // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     ChangeSct;                                               // 0x0020(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLSchemePolymorphGrowUpScts
	 * Size -> 0x0060
	 */
	struct FTLSchemePolymorphGrowUpScts
	{
	public:
		struct FSoftObjectPath                                     LevelUpMaxSct;                                           // 0x0000(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     LevelUpSct;                                              // 0x0018(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     StartLevelUpSct;                                         // 0x0030(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     LevelUnchangedSct;                                       // 0x0048(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLSchemePolymorphCamouflageData
	 * Size -> 0x0040
	 */
	struct FTLSchemePolymorphCamouflageData
	{
	public:
		bool                                                       bShowCamouflageData;                                     // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAggressive;                                             // 0x0001(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZQKE[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                UICamouflageName;                                        // 0x0008(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FText                                                UICamouflageTribeTitle;                                  // 0x0020(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		int32_t                                                    UICamouflageNpcId;                                       // 0x0038(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ODJG[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct TLScheme.TLSchemePolymorph
	 * Size -> 0x04C8 (FullSize[0x04D8] - InheritedSize[0x0010])
	 */
	struct FTLSchemePolymorph : public FTLTableRowBase
	{
	public:
		unsigned char                                              UnknownData_D6IL[0x8];                                   // 0x0010(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    UID;                                                     // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPolymorphGrade                                            Grade;                                                   // 0x001C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RF43[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                UINameText;                                              // 0x0020(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               PolymorphEffectID;                                       // 0x0038(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               PolymorphStatID;                                         // 0x0048(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               SummonGuardianStatID;                                    // 0x0058(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FTLSchemePolymorphLevelSkillInfo>            SkillInfos;                                              // 0x0068(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		ETLPolymorphLayer                                          PolymorphLayer;                                          // 0x0078(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PRM0[0x7];                                   // 0x0079(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UHiveEntityData*                                     HiveEntityForMale;                                       // 0x0080(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHiveEntityData*                                     HiveEntityForFemale;                                     // 0x0088(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            ModelRatationOffset;                                     // 0x0090(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8LQR[0x4];                                   // 0x009C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     UIListSlotPortraitForMale;                               // 0x00A0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     UIListSlotPortraitForFemale;                             // 0x00B8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     UISelectChangeSctForMale;                                // 0x00D0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     UISelectChangeSctForFemale;                              // 0x00E8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           OverwriteHeadUIOffset;                                   // 0x0100(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLUIStatsValueInfo>                         UIStats;                                                 // 0x0108(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      CastingDurationSec;                                      // 0x0118(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DCQN[0x4];                                   // 0x011C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     CastingSct;                                              // 0x0120(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                StoryDescription;                                        // 0x0138(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FName                                                CustomizePresetID_Male;                                  // 0x0150(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CustomizePresetID_Female;                                // 0x0158(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CustomizeLooksTableID_Male;                              // 0x0160(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CustomizeLooksTableID_Female;                            // 0x0168(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    StaySeconds;                                             // 0x0170(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FightingRadius;                                          // 0x0174(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InteractionRadius;                                       // 0x0178(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollisionRadiusRatio;                                    // 0x017C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollisionRadiusRatioMin;                                 // 0x0180(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x0184(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseMyPcCustomMovementCapsule;                           // 0x0188(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_672G[0x3];                                   // 0x0189(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MyPcCustomMovementCapsuleMaxSlopeAngle;                  // 0x018C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MyPcCustomMovementCapsuleRadius;                         // 0x0190(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MyPcCustomMovementCapsuleHalfHeight;                     // 0x0194(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MyPcCustomMovementCapsuleZOffset;                        // 0x0198(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            MyPcCustomMovementCapsuleRotation;                       // 0x019C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       WeaponShow;                                              // 0x01A8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLBodyType                                                BodyType;                                                // 0x01A9(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZUNG[0x6];                                   // 0x01AA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               Species;                                                 // 0x01B0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               CoverTribe;                                              // 0x01C0(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		ECooldownGroup                                             MountCooldownGroup;                                      // 0x01D0(0x0001) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2UHP[0x3];                                   // 0x01D1(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		class FName                                                MountId;                                                 // 0x01D4(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WW56[0x4];                                   // 0x01DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     MyPcTransformLevelSequencePath;                          // 0x01E0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EntryTransformsInfoServerXmlPath;                        // 0x01F8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     OtherPcTransformLevelSequencePath;                       // 0x0208(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     MyPcRestoreLevelSequencePath;                            // 0x0220(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     OtherPcRestoreLevelSequencePath;                         // 0x0238(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanJumpInWater;                                          // 0x0250(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanExistOnGround;                                        // 0x0251(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanMountHorse;                                           // 0x0252(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanInteraction;                                          // 0x0253(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanDispelByUser;                                         // 0x0254(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanTransformOtherPolymorph;                              // 0x0255(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanDispelDuringPolymorphScenario;                        // 0x0256(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLBodySize                                                BodySize;                                                // 0x0257(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanJumpInGliding;                                        // 0x0258(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IOS0[0x3];                                   // 0x0259(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                EventEffectDropStyleId;                                  // 0x025C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LargeObjectAvoidOverlapRadRatio;                         // 0x0264(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLSpecialPolymorphType                                    SpecialPolymorphType;                                    // 0x0268(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MagicdollVisibility;                                     // 0x0269(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLPolymorphMainWeaponType                                 MainWeaponType;                                          // 0x026A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1UUI[0x5];                                   // 0x026B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    AcquireCollectionEXP;                                    // 0x0270(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SkillSet;                                                // 0x0278(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FName>                                        AdditionalSkillSets;                                     // 0x0280(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FTLSchemePolymorphEnchancedSkill>            EnhancedSkillComplexes;                                  // 0x0290(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FName>                                        SkillCustoms;                                            // 0x02A0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                SctConditionName;                                        // 0x02B0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     DeathSct;                                                // 0x02B8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GlidingTurnTimeSec;                                      // 0x02D0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GlidingJumpHeight;                                       // 0x02D4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    GlidingJumpStamina;                                      // 0x02D8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                GlidingJumpEffectID;                                     // 0x02DC(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q9HO[0x4];                                   // 0x02E4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               HittedSlowTimeCoefficient;                               // 0x02E8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		ETLMobiltyType                                             MobilityType;                                            // 0x02F8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLPolymorphCategory                                       Category;                                                // 0x02F9(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLPolymorphPictogramType                                  PictogramType;                                           // 0x02FA(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLPolymorphUICategory                                     UIPolymorphBookCategory;                                 // 0x02FB(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    UISortPriority;                                          // 0x02FC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowOnList;                                             // 0x0300(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUnveiled;                                               // 0x0301(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N99W[0x6];                                   // 0x0302(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLPolymorphVeiledInfo                              VeiledInfo;                                              // 0x0308(0x0038) Edit, NativeAccessSpecifierPublic
		struct FTLSchemePolymorphGrowUpScts                        GrowUpScts;                                              // 0x0340(0x0060) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     PolymorphSceneEnterAT;                                   // 0x03A0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     VowSceneReleaseAT;                                       // 0x03B8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     MaxLevelGrowUpLevelSequencePathForMale;                  // 0x03D0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     MaxLevelGrowUpLevelSequencePathForFemale;                // 0x03E8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     VowIconSpritePath;                                       // 0x0400(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CustomSceneId;                                           // 0x0418(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                UserCameraSetName;                                       // 0x0420(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShowRemainTimeMessage;                                   // 0x0428(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9TAK[0x7];                                   // 0x0429(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLSchemePolymorphCamouflageData                    CamouflageData;                                          // 0x0430(0x0040) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FText                                                Description;                                             // 0x0470(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     MusicPath;                                               // 0x0488(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                AudioTag;                                                // 0x04A0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUsePickingValue;                                        // 0x04A8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JLG6[0x3];                                   // 0x04A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PickingHeight;                                           // 0x04AC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PickingRadius;                                           // 0x04B0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PickingZOffset;                                          // 0x04B4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DCV4[0x20];                                  // 0x04B8(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollLevelSetting
	 * Size -> 0x00D8
	 */
	struct FTLMagicDollLevelSetting
	{
	public:
		int32_t                                                    Level;                                                   // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YOM3[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                DisplayName;                                             // 0x0008(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		bool                                                       Broadcast;                                               // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OOW4[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                PassiveID;                                               // 0x0024(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SpeciesPassiveID;                                        // 0x002C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                HealSkillID;                                             // 0x0034(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_14LG[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               MagicDollStatID;                                         // 0x0040(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		class FName                                                MagicDollExtraMaterialChanceID;                          // 0x0050(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               GrowthResourceID;                                        // 0x0058(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		class UHiveEntityData*                                     HiveEntity;                                              // 0x0068(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            ModelRatationOffset;                                     // 0x0070(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AY0B[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     UIListSlotPortrait;                                      // 0x0080(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     UIDialogPortrait;                                        // 0x0098(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     UISelectChangeSct;                                       // 0x00B0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLUIStatsValueInfo>                         ExtraMaterialChanceByCondition;                          // 0x00C8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLConditionWeight
	 * Size -> 0x0004
	 */
	struct FTLConditionWeight
	{
	public:
		float                                                      Weight;                                                  // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollWeightDialogue
	 * Size -> 0x001C (FullSize[0x0020] - InheritedSize[0x0004])
	 */
	struct FTLMagicDollWeightDialogue : public FTLConditionWeight
	{
	public:
		unsigned char                                              UnknownData_IAI6[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               MagicDollDialogueEvent;                                  // 0x0008(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       IsAllowPlayDialogSCT;                                    // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QOMW[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollReaction
	 * Size -> 0x0030
	 */
	struct FTLMagicDollReaction
	{
	public:
		ETLMagicDollReactionType                                   Type;                                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AFYJ[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint32_t                                                   Priority;                                                // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     SceneContiPath;                                          // 0x0008(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLMagicDollWeightDialogue>                  WeightDialogues;                                         // 0x0020(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollSearchFo
	 * Size -> 0x0048
	 */
	struct FTLMagicDollSearchFo
	{
	public:
		struct FSoftObjectPath                                     FoundFoSceneConti;                                       // 0x0000(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                FoundFoReaction;                                         // 0x0018(0x0030) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollConditionalSubstance
	 * Size -> 0x000C
	 */
	struct FTLMagicDollConditionalSubstance
	{
	public:
		ETLConditionTimeOfDay                                      TimeOfDay;                                               // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLConditionWeather                                        Weather;                                                 // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ECRH[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                substance;                                               // 0x0004(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLConditionComplex
	 * Size -> 0x0028
	 */
	struct FTLConditionComplex
	{
	public:
		ETLConditionTimeOfDay                                      TimeOfDay;                                               // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLConditionWeather                                        Weather;                                                 // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLConditionAlignment                                      Alignment;                                               // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLConditionAnyYesNo                                       IsCastleOwnerGuildMaster;                                // 0x0003(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEquipmentCheck;                                         // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLConditionEquipment                                      Equipment;                                               // 0x0005(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemGrade                                                 EquipmentInclusiveLowerItemGrade;                        // 0x0006(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemGrade                                                 EquipmentInclusiveUpperItemGrade;                        // 0x0007(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              AttainedCodexCodeGuid;                                   // 0x0008(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FInt32Range                                         MyPcLevel;                                               // 0x0018(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollWeightReaction
	 * Size -> 0x0034 (FullSize[0x0038] - InheritedSize[0x0004])
	 */
	struct FTLMagicDollWeightReaction : public FTLConditionWeight
	{
	public:
		ETLMagicDollReactionType                                   Type;                                                    // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Y832[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint32_t                                                   Priority;                                                // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TYNQ[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     SceneContiPath;                                          // 0x0010(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLMagicDollWeightDialogue>                  WeightDialogues;                                         // 0x0028(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLMagicDollConditionalReaction
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	struct FTLMagicDollConditionalReaction : public FTLConditionComplex
	{
	public:
		TArray<struct FTLMagicDollWeightReaction>                  WeightReactions;                                         // 0x0028(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLSchemeMagicDollGrowUpScts
	 * Size -> 0x0060
	 */
	struct FTLSchemeMagicDollGrowUpScts
	{
	public:
		struct FSoftObjectPath                                     LevelUpMaxSct;                                           // 0x0000(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     LevelUpSct;                                              // 0x0018(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     StartLevelUpSct;                                         // 0x0030(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     LevelUnchangedSct;                                       // 0x0048(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLRowMagicDoll
	 * Size -> 0x0A50 (FullSize[0x0A58] - InheritedSize[0x0008])
	 */
	struct FTLRowMagicDoll : public FTableRowBase
	{
	public:
		unsigned char                                              UnknownData_NFBD[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    UID;                                                     // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D7CX[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLMagicDollLevelSetting                            DefaultLevelSetting;                                     // 0x0018(0x00D8) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		EMagicDollGrade                                            Grade;                                                   // 0x00F0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsSystemOnly;                                            // 0x00F1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESpeciesGroup                                              SpeciesGroup;                                            // 0x00F2(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MQEP[0x5];                                   // 0x00F3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               Dialog;                                                  // 0x00F8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       HiveEntityIsNullable;                                    // 0x0108(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NCJZ[0x3];                                   // 0x0109(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InitialOpacity;                                          // 0x010C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreOwnerOpacity;                                     // 0x0110(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCollision;                                              // 0x0111(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RFVC[0x2];                                   // 0x0112(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Scale;                                                   // 0x0114(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETLMagicDollZOffsetApply                                   ZOffsetApply;                                            // 0x0118(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QO62[0x3];                                   // 0x0119(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ZOffset;                                                 // 0x011C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Radius;                                                  // 0x0120(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x0124(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            SkipLoadingHiveDataOnMapEntered;                         // 0x0128(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            SkipEnteringWorldSCTOnMapEntered;                        // 0x0138(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            SkipLoadingDialogOnMapEntered;                           // 0x0148(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      DefaultMoveSpeed;                                        // 0x0158(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinimumMoveSpeedForRunning;                              // 0x015C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      JumpHeight;                                              // 0x0160(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6GN3[0x4];                                   // 0x0164(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat*                                         MoveSpeedByDistanceToOwner;                              // 0x0168(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         MoveSpeedByDistanceToTarget;                             // 0x0170(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         FlySpeedByDistanceToOwner;                               // 0x0178(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         SwimSpeedByDistanceToOwner;                              // 0x0180(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SwimmingTurnSpeed;                                       // 0x0188(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GlidingTurnSpeed;                                        // 0x018C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GroundDistanceFromOwner;                                 // 0x0190(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GroundPositionDegreeRelativeToOwnerDirection;            // 0x0194(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GroundDirectionDegreeRelativeToOwnerDirection;           // 0x0198(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AirDistanceFromOwner;                                    // 0x019C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AirPositionDegreeRelativeToOwnerDirection;               // 0x01A0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingDropItemRadius;                                 // 0x01A4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingDropItemHeight;                                 // 0x01A8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DroppedItemPickableRadius;                               // 0x01AC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DiggingNewItemInterval;                                  // 0x01B0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JIAA[0x4];                                   // 0x01B4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     DiggingNewItemSceneContiPath;                            // 0x01B8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DiggingNewItemSceneContiDurationSec;                     // 0x01D0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DistanceToDropItemPickingAtOnce;                         // 0x01D4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RetryPickingDropItemIntervalSeconds;                     // 0x01D8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ULV6[0x4];                                   // 0x01DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FTLMagicDollReaction>                        PickingUpDropItemReactions;                              // 0x01E0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      SearchingFoRadius;                                       // 0x01F0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingFoHeight;                                       // 0x01F4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FTLMagicDollSearchFo>             SearchFosByTag;                                          // 0x01F8(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TArray<struct FTLDataTableRowHandle>                       SearchingFoRowHandles;                                   // 0x0248(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      SearchingFoLeadingDistance;                              // 0x0258(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingFieldBossRadius;                                // 0x025C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingFieldBossHeight;                                // 0x0260(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingFieldBossCatchingUpDistance;                    // 0x0264(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingFieldBossLeadingDistance;                       // 0x0268(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchingFieldBossWatchingDistance;                      // 0x026C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLMagicDollConditionalSubstance>            OwnerConditionalNormalSubstances;                        // 0x0270(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                ObjectTagName;                                           // 0x0280(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     InformResourceSceneConti;                                // 0x0288(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                InformResourceReaction;                                  // 0x02A0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     InformWarningFieldBossSceneConti;                        // 0x02D0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     EnteringWorldSceneContiPath;                             // 0x02E8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSkipEnteringWorldSctOnCutScene;                         // 0x0300(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CFBW[0x7];                                   // 0x0301(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftObjectPath                                     LeavingWorldSceneContiPath;                              // 0x0308(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FTLMagicDollReaction>             OwnerSubstanceReactions;                                 // 0x0320(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<ESnMovementMode, struct FTLMagicDollReaction>         OwnerMovementModeReactions;                              // 0x0370(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<class FName, struct FTLMagicDollReaction>             OwnerAbnormalReactions;                                  // 0x03C0(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                OwnerResourceAquiringReaction;                           // 0x0410(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<EEnchantResultType, struct FTLMagicDollReaction>      OwnerEnchantResultReactions;                             // 0x0440(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                OwnerCraftingSuccessReaction;                            // 0x0490(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<ETLCraftingResultType, struct FTLMagicDollReaction>   OwnerCraftingSuccessReactions;                           // 0x04C0(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<EItemGrade, struct FTLMagicDollReaction>              AcquiringDropItemReactions;                              // 0x0510(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                OwnerGivingCriticalHitReaction;                          // 0x0560(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                OwnerReceivingCriticalHitReaction;                       // 0x0590(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                OwnerDeathReaction;                                      // 0x05C0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FFloatRange                                         IdleReactionTriggerTimeRangeInSeconds;                   // 0x05F0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLMagicDollConditionalReaction>             SafetyZoneIdleReactions;                                 // 0x0600(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FTLMagicDollConditionalReaction>             CombatZoneIdleReactions;                                 // 0x0610(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                EnterRegionStoneReaction;                                // 0x0620(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                LeaveRegionStoneReaction;                                // 0x0650(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                EnterBossStoneReaction;                                  // 0x0680(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                LeaveBossStoneReaction;                                  // 0x06B0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                EnterSiegeWarfareReaction;                               // 0x06E0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                LeaveSiegeWarfareReaction;                               // 0x0710(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                WeatherNormalReaction;                                   // 0x0740(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                WeatherRainReaction;                                     // 0x0770(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                WeatherEclipseReaction;                                  // 0x07A0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLMagicDollReaction                                MagicPocketNormalReaction;                               // 0x07D0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<ETLMagicPortalDistance, struct FTLMagicDollReaction>  MagicPortalAdvancedReaction;                             // 0x0800(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<ETLMagicDollEmotion, struct FTLMagicDollReaction>     MagicDollEmotions;                                       // 0x0850(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<ETLMagicDollEmotion, struct FTLMagicDollReaction>     OtherPcMagicDollEmotions;                                // 0x08A0(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TMap<class FName, struct FTLMagicDollReaction>             MagicDollSkillReactions;                                 // 0x08F0(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		unsigned char                                              HeadUIUserWidgetClass[0x28];                             // 0x0940(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		class FName                                                CustomSceneId;                                           // 0x0968(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTLSchemeMagicDollGrowUpScts                        GrowUpScts;                                              // 0x0970(0x0060) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     MaxLevelGrowUpLevelSequencePath;                         // 0x09D0(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    UISortPriority;                                          // 0x09E8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUnveiled;                                               // 0x09EC(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A52E[0x3];                                   // 0x09ED(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLPolymorphVeiledInfo                              VeiledInfo;                                              // 0x09F0(0x0038) Edit, NativeAccessSpecifierPublic
		bool                                                       bHideFromList;                                           // 0x0A28(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowStateIcon;                                          // 0x0A29(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowSummonMessage;                                      // 0x0A2A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowDismissMessage;                                     // 0x0A2B(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UKK2[0x4];                                   // 0x0A2C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Description;                                             // 0x0A30(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               VoiceActor;                                              // 0x0A48(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLInfoItem
	 * Size -> 0x0220 (FullSize[0x0228] - InheritedSize[0x0008])
	 */
	struct FTLInfoItem : public FTableRowBase
	{
	public:
		unsigned char                                              UnknownData_7DPG[0x9];                                   // 0x0008(0x0009) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EBool                                                      auto_pick;                                               // 0x0011(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      can_lay_down;                                            // 0x0012(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      decomposable;                                            // 0x0013(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      destructable;                                            // 0x0014(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              equip_category;                                          // 0x0015(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      exchangeable;                                            // 0x0016(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      overwrite_exchangeable;                                  // 0x0017(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemGrade                                                 item_grade;                                              // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETradeCategory                                             trade_category;                                          // 0x0019(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TVWD[0x2];                                   // 0x001A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                trade_price_group_id;                                    // 0x001C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                weapon_unique_skill_set_id;                              // 0x0024(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                use_skill;                                               // 0x002C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                polymorph_id;                                            // 0x0034(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                polymorph_group_id;                                      // 0x003C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                magicdoll_id;                                            // 0x0044(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    max_stack_count;                                         // 0x004C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              misc_category;                                           // 0x0050(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMoneyType                                                 money_type;                                              // 0x0051(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PS7D[0x2];                                   // 0x0052(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    price_gold;                                              // 0x0054(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      quick_slot;                                              // 0x0058(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9BNZ[0x3];                                   // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    required_level;                                          // 0x005C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      sellable;                                                // 0x0060(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              usable_category;                                         // 0x0061(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              key_category;                                            // 0x0062(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MA1Z[0x1];                                   // 0x0063(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    use_level;                                               // 0x0064(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Num;                                                     // 0x0068(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Weight;                                                  // 0x006C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                package_id;                                              // 0x0070(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    dumping_price;                                           // 0x0078(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      storable;                                                // 0x007C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      screen_message;                                          // 0x007D(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      Broadcast;                                               // 0x007E(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V276[0x1];                                   // 0x007F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                skill_complex_id;                                        // 0x0080(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              ammo_category;                                           // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9FFB[0x3];                                   // 0x0089(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                item_passive_id;                                         // 0x008C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    broken_prob;                                             // 0x0094(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    InteractionHeight;                                       // 0x0098(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                group_id;                                                // 0x009C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                item_stat_id;                                            // 0x00A4(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                elixine_id;                                              // 0x00AC(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    weapon_mastery_point;                                    // 0x00B4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                decompose_item_id;                                       // 0x00B8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    decompose_gold;                                          // 0x00C0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                decompose_enchantable;                                   // 0x00C8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                decompose_non_enchantable;                               // 0x00D0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBool                                                      lockable;                                                // 0x00D8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JVRH[0x7];                                   // 0x00D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    dungeon_point;                                           // 0x00E0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    polymorph_level;                                         // 0x00E8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    magicdoll_level;                                         // 0x00EC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    decreasing_lifetime_even_if_logout;                      // 0x00F0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    decreasing_lifetime_only_if_login;                       // 0x00F4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                expiration_time;                                         // 0x00F8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                polymorph_link_id;                                       // 0x0100(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    polymorph_link_exp;                                      // 0x0108(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              ItemCategory;                                            // 0x010C(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EWeaponCategory                                            WeaponCategory;                                          // 0x010D(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8HRD[0x11A];                                 // 0x010E(0x011A) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct TLScheme.TLInfoTutorialPlatformInfo
	 * Size -> 0x0070
	 */
	struct FTLInfoTutorialPlatformInfo
	{
	public:
		ETLUIPlatform                                              UIPlatform;                                              // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JFNL[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Title;                                                   // 0x0008(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class FText                                                Message;                                                 // 0x0020(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		TArray<class FText>                                        HeaderKeyGuide;                                          // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     TutorialImage;                                           // 0x0048(0x0018) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               HelpTableName;                                           // 0x0060(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLTutorialMessageInfo
	 * Size -> 0x0028
	 */
	struct FTLTutorialMessageInfo
	{
	public:
		int32_t                                                    Weight;                                                  // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VX8F[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               StringSystemTableRow;                                    // 0x0008(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FTLDataTableRowHandle>                       HyperLinkRefList;                                        // 0x0018(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLTutorialSystemMessage
	 * Size -> 0x0018
	 */
	struct FTLTutorialSystemMessage
	{
	public:
		ETLUIPlatform                                              UIPlatform;                                              // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_67NA[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FTLTutorialMessageInfo>                      MessageInfo;                                             // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLInfoTutorial
	 * Size -> 0x00C8 (FullSize[0x00D0] - InheritedSize[0x0008])
	 */
	struct FTLInfoTutorial : public FTableRowBase
	{
	public:
		class FName                                                RowName;                                                 // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLInfoTutorialPlatformInfo>                 PlatformInfo;                                            // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       IsSaveNPServer;                                          // 0x0020(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MWNS[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    ServerSaveIndex;                                         // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DisableLevel;                                            // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsStackTutorial;                                         // 0x002C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EHYX[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               SubTutorialName;                                         // 0x0030(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              ConditionBPClass[0x28];                                  // 0x0040(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		int32_t                                                    DelayMs;                                                 // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    InactivateIntervalMs;                                    // 0x006C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CooldownSec;                                             // 0x0070(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                WidgetKey;                                               // 0x0074(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CompleteWidgetKeyOnHide;                                 // 0x007C(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETutorialActiveType                                        TutorialActiveType;                                      // 0x0084(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YMXS[0x3];                                   // 0x0085(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLDataTableRowHandle                               MagicDollDialogActivateEvent;                            // 0x0088(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLDataTableRowHandle                               MagicDollDialogCompleteEvent;                            // 0x0098(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FTLTutorialSystemMessage>                    SystemMessageInfo;                                       // 0x00A8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                Sound;                                                   // 0x00B8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              LogName;                                                 // 0x00C0(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLJsonGuid
	 * Size -> 0x0008
	 */
	struct FTLJsonGuid
	{
	public:
		uint64_t                                                   Value;                                                   // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct TLScheme.TLGuidTableRowHandle
	 * Size -> 0x0008 (FullSize[0x0018] - InheritedSize[0x0010])
	 */
	struct FTLGuidTableRowHandle : public FDataTableRowHandle
	{
	public:
		uint64_t                                                   Guid;                                                    // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLJsonCodexCollectionPage
	 * Size -> 0x000C
	 */
	struct FTLJsonCodexCollectionPage
	{
	public:
		int32_t                                                    UID;                                                     // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ui_table_id;                                             // 0x0004(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLJsonCodexCollectionBook
	 * Size -> 0x0020
	 */
	struct FTLJsonCodexCollectionBook
	{
	public:
		struct FTLJsonGuid                                         Guid;                                                    // 0x0000(0x0008) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ui_table_id;                                             // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLJsonCodexCollectionPage>                  codex_page;                                              // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLJsonCodexCollection
	 * Size -> 0x0020 (FullSize[0x0028] - InheritedSize[0x0008])
	 */
	struct FTLJsonCodexCollection : public FTableRowBase
	{
	public:
		struct FTLJsonGuid                                         Name;                                                    // 0x0008(0x0008) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ui_table_id;                                             // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FTLJsonCodexCollectionBook>                  codex_book;                                              // 0x0018(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLJsonContractFixedReward
	 * Size -> 0x0010 (FullSize[0x0018] - InheritedSize[0x0008])
	 */
	struct FTLJsonContractFixedReward : public FTableRowBase
	{
	public:
		class FName                                                ID;                                                      // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Count;                                                   // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T7CP[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct TLScheme.TLJsonContractReward
	 * Size -> 0x0038 (FullSize[0x0040] - InheritedSize[0x0008])
	 */
	struct FTLJsonContractReward : public FTableRowBase
	{
	public:
		class FName                                                Name;                                                    // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    cost_diamond;                                            // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Exp;                                                     // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    alignment_point;                                         // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    gold;                                                    // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    contract_coin;                                           // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    activity_point;                                          // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EAWM[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FTLJsonContractFixedReward>                  FixedReward;                                             // 0x0030(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct TLScheme.TLJsonContractRefreshCost
	 * Size -> 0x0010 (FullSize[0x0018] - InheritedSize[0x0008])
	 */
