#pragma once

/**
 * Name: TL
 * Version: 0525
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class TLScene.TLCommonGameMode
	 * Size -> 0x0028 (FullSize[0x02F8] - InheritedSize[0x02D0])
	 */
	class ATLCommonGameMode : public AGameModeBase
	{
	public:
		unsigned char                                              UnknownData_9DHH[0x28];                                  // 0x02D0(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.TLCommonGameInstance
	 * Size -> 0x00D0 (FullSize[0x0278] - InheritedSize[0x01A8])
	 */
	class UTLCommonGameInstance : public UGameInstance
	{
	public:
		unsigned char                                              UnknownData_V94N[0xD0];                                  // 0x01A8(0x00D0) Fix size for supers

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AggregatedLandscapeLOD
	 * Size -> 0x00D0 (FullSize[0x0300] - InheritedSize[0x0230])
	 */
	class AAggregatedLandscapeLOD : public AActor
	{
	public:
		class UMaterial*                                           Material;                                                // 0x0230(0x0008) Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UProceduralMeshComponent*                            ProceduralMeshComponent;                                 // 0x0238(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P9BT[0xC0];                                  // 0x0240(0x00C0) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.SystemAnimation
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class USystemAnimation : public UObject
	{
	public:
		TArray<struct FSystemAnimationSequential>                  Sequentials;                                             // 0x0028(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimData
	 * Size -> 0x2B108 (FullSize[0x2B138] - InheritedSize[0x0030])
	 */
	class UAnimData : public UPrimaryDataAsset
	{
	public:
		unsigned char                                              AnimInstanceClass[0x28];                                 // 0x0030(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		unsigned char                                              LocomotionAnimInstanceClass[0x28];                       // 0x0058(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		class UAnimBlueprint*                                      LinkedAnimBlueprint;                                     // 0x0080(0x0008) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimBlueprint*                                      LinkedOverrideLocomotionBP;                              // 0x0088(0x0008) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAnimDataMontageSet                                 MontageSets[0x24];                                       // 0x0090(0x1560) Edit, NativeAccessSpecifierPublic
		struct FStanceAnimationSet                                 LocomotionState[0x24];                                   // 0x15F0(0x286E0) Edit, NativeAccessSpecifierPublic
		struct FAnimDataBlendSpaceSet                              BlendSpaceSets[0x24];                                    // 0x29CD0(0x0B40) Edit, NativeAccessSpecifierPublic
		class UNCIKRig*                                            NCIKRig;                                                 // 0x2A810(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FAnimDataSubstance>                          Substances;                                              // 0x2A818(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FAnimDataSystemAnimation>                    SystemAnimations;                                        // 0x2A828(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FAnimDataSequenceTable                              SequenceTables[0x24];                                    // 0x2A838(0x0900) Edit, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotifyState_AnimDynamics
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_AnimDynamics : public UAnimNotifyState
	{
	public:
		bool                                                       bEnable;                                                 // 0x0030(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0VO0[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SimulationVelocityUpdateScale;                           // 0x0034(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlendInTime;                                             // 0x0038(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlendOutTime;                                            // 0x003C(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotifyState_BoneScaleControl
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_BoneScaleControl : public UAnimNotifyState
	{
	public:
		TArray<struct FBoneScaleControlByAnimSeqenceOption>        TargetOption;                                            // 0x0030(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_CharacterSound
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_CharacterSound : public UAnimNotify
	{
	public:
		class FName                                                CharacterSoundKey;                                       // 0x0038(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_DropLinkedItems
	 * Size -> 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
	 */
	class UAnimNotify_DropLinkedItems : public UAnimNotify
	{
	public:
		bool                                                       bRestore;                                                // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SKA2[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RandomDelay;                                             // 0x003C(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDropAllWeapons;                                         // 0x0040(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESnModelSocketPoint                                        TargetSocket;                                            // 0x0041(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KMTA[0x6];                                   // 0x0042(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_EquipSocket
	 * Size -> 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
	 */
	class UAnimNotify_EquipSocket : public UAnimNotify
	{
	public:
		TArray<struct FHandleEquipSocketInfo>                      HandleSocketInfos;                                       // 0x0038(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotifyState_EquipSocket
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_EquipSocket : public UAnimNotifyState
	{
	public:
		TArray<struct FHandleEquipSocketInfo>                      HandleSocketInfos;                                       // 0x0030(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_FishingEvent
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_FishingEvent : public UAnimNotify
	{
	public:
		ETLAnimNotifyFishingEvent                                  FishingEventType;                                        // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_I26V[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_HitStop
	 * Size -> 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
	 */
	class UAnimNotify_HitStop : public UAnimNotify
	{
	public:
		bool                                                       bMyPcOnly;                                               // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		ESnHitStopAnimationType                                    Type;                                                    // 0x0039(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_0D13[0x2];                                   // 0x003A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Exponent;                                                // 0x003C(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      Duration;                                                // 0x0040(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      ActionSpeedScaleFactor;                                  // 0x0044(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_NameplateUpdateMode
	 * Size -> 0x0018 (FullSize[0x0050] - InheritedSize[0x0038])
	 */
	class UAnimNotify_NameplateUpdateMode : public UAnimNotify
	{
	public:
		ESnNameplateUpdateMode                                     UpdateMode;                                              // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_MVAX[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             OffsetFromRoot;                                          // 0x003C(0x000C) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      HeightOffsetFromHead;                                    // 0x0048(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      BlendingDuration;                                        // 0x004C(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_PhysicalFootprint
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_PhysicalFootprint : public UAnimNotify
	{
	public:
		ESnFootprintSocketPoint                                    FootprintSocket;                                         // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSkipFootstepSound;                                      // 0x0039(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RFJ0[0x6];                                   // 0x003A(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_SystemSct
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_SystemSct : public UAnimNotify
	{
	public:
		ESnAnimNotifyTriggerSystemSct                              SystemSct;                                               // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D2RG[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotifyState_SystemSct
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_SystemSct : public UAnimNotifyState
	{
	public:
		ESnAnimNotifyTriggerSystemSct                              SystemSct;                                               // 0x0030(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TSA9[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                Condition;                                               // 0x0034(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X33N[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_TLPlaySound
	 * Size -> 0x0058 (FullSize[0x0090] - InheritedSize[0x0038])
	 */
	class UAnimNotify_TLPlaySound : public UAnimNotify
	{
	public:
		class UTLSoundEvent*                                       SoundEvent;                                              // 0x0038(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_042H[0x50];                                  // 0x0040(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotify_Trigger
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_Trigger : public UAnimNotify
	{
	public:
		class FName                                                TriggerName;                                             // 0x0038(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.AnimNotifyState_EnableIK
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_EnableIK : public UAnimNotifyState
	{
	public:
		EIKType                                                    IKType;                                                  // 0x0030(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bInverse;                                                // 0x0031(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_IJL5[0x2];                                   // 0x0032(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BlendInTime;                                             // 0x0034(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BlendOutTime;                                            // 0x0038(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FVector                                             HandIKLookAtAxis;                                        // 0x003C(0x000C) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bArmIKProjectile;                                        // 0x0048(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bHandIKProjectile;                                       // 0x0049(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_4LIQ[0x6];                                   // 0x004A(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTService_FindBoidRoamingStartPosition
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UBTService_FindBoidRoamingStartPosition : public UBTService_BlackboardBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTService_FindRunAwayTarget
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UBTService_FindRunAwayTarget : public UBTService_BlackboardBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTService_SelectNextPathSpline
	 * Size -> 0x0008 (FullSize[0x00A0] - InheritedSize[0x0098])
	 */
	class UBTService_SelectNextPathSpline : public UBTService_BlackboardBase
	{
	public:
		bool                                                       bGotoProwling : 1;                                       // 0x0098(0x0001) BIT_FIELD Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_K6XH[0x7];                                   // 0x0099(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTTask_MovingBySpline
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UBTTask_MovingBySpline : public UBTTask_BlackboardBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTTask_MovingDirectFly
	 * Size -> 0x0008 (FullSize[0x00A0] - InheritedSize[0x0098])
	 */
	class UBTTask_MovingDirectFly : public UBTTask_BlackboardBase
	{
	public:
		float                                                      AcceptableRadius;                                        // 0x0098(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XRJZ[0x4];                                   // 0x009C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTTask_MovingReverseBySpline
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UBTTask_MovingReverseBySpline : public UBTTask_BlackboardBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTTask_ProwlingSpline
	 * Size -> 0x0000 (FullSize[0x0070] - InheritedSize[0x0070])
	 */
	class UBTTask_ProwlingSpline : public UBTTaskNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTTask_RoamingSpline
	 * Size -> 0x0000 (FullSize[0x0070] - InheritedSize[0x0070])
	 */
	class UBTTask_RoamingSpline : public UBTTaskNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.BTTask_WaitContiPlay
	 * Size -> 0x0010 (FullSize[0x0080] - InheritedSize[0x0070])
	 */
	class UBTTask_WaitContiPlay : public UBTTaskNode
	{
	public:
		class FName                                                ActionName;                                              // 0x0070(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q8HP[0x8];                                   // 0x0078(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentExternalTrackOverrideData
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UMapEnvironmentExternalTrackOverrideData : public UObject
	{
	public:
		TMap<struct FGuid, struct FMapEnvironmentExternalVolumeData> VolumeDataTable;                                         // 0x0028(0x0050) NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentBlenderManager
	 * Size -> 0x3508 (FullSize[0x3530] - InheritedSize[0x0028])
	 */
	class UMapEnvironmentBlenderManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_05UQ[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UMapEnvironmentObjectBlender*>                SequenceObjectBlenders;                                  // 0x0030(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ZMER[0xA0];                                  // 0x0040(0x00A0) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UMapEnvironmentModuleBlender*>                WeatherModuleBlenders;                                   // 0x00E0(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		TArray<class UMapEnvironmentModuleBlender*>                VolumeModuleBlenders;                                    // 0x00F0(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		TArray<class UMapEnvironmentModuleBlender*>                WeatherIrrelevantBlenders;                               // 0x0100(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		class UMapEnvironmentPostProcessMaterialBlender*           PostProcessMaterialBlender;                              // 0x0110(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KS4G[0x8];                                   // 0x0118(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UMapEnvironmentExternalTrackOverrideData*            ExternalTrackOverrideData;                               // 0x0120(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_7ORI[0x3408];                                // 0x0128(0x3408) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentBlender
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class UMapEnvironmentBlender : public UObject
	{
	public:
		unsigned char                                              UnknownData_AM60[0x10];                                  // 0x0028(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentObjectBlender
	 * Size -> 0x0068 (FullSize[0x00A0] - InheritedSize[0x0038])
	 */
	class UMapEnvironmentObjectBlender : public UMapEnvironmentBlender
	{
	public:
		unsigned char                                              UnknownData_HJPP[0x68];                                  // 0x0038(0x0068) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentMaterialParameterCollectionBlender
	 * Size -> 0x0048 (FullSize[0x00E8] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentMaterialParameterCollectionBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_SPM7[0x48];                                  // 0x00A0(0x0048) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentDirectionalLightBlender
	 * Size -> 0x0EC8 (FullSize[0x0F68] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentDirectionalLightBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_ALTY[0xEC8];                                 // 0x00A0(0x0EC8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentSpotLightBlender
	 * Size -> 0x0138 (FullSize[0x01D8] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentSpotLightBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_4PPB[0x138];                                 // 0x00A0(0x0138) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentPointLightBlender
	 * Size -> 0x0138 (FullSize[0x01D8] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentPointLightBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_HYMO[0x138];                                 // 0x00A0(0x0138) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentSkyLightBlender
	 * Size -> 0x0850 (FullSize[0x08F0] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentSkyLightBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_28B4[0x850];                                 // 0x00A0(0x0850) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentSkyAtmosphereBlender
	 * Size -> 0x0B98 (FullSize[0x0C38] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentSkyAtmosphereBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_KQPU[0xB98];                                 // 0x00A0(0x0B98) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentVolumetricCloudBlender
	 * Size -> 0x0208 (FullSize[0x02A8] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentVolumetricCloudBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_U8LY[0x208];                                 // 0x00A0(0x0208) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentTLSkyBlender
	 * Size -> 0x3D48 (FullSize[0x3DE8] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentTLSkyBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_SOJG[0x3D48];                                // 0x00A0(0x3D48) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentExponentialHeightFogBlender
	 * Size -> 0x0C18 (FullSize[0x0CB8] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentExponentialHeightFogBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_VKND[0xC18];                                 // 0x00A0(0x0C18) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentPostProcessVolumeBlender
	 * Size -> 0x4E30 (FullSize[0x4ED0] - InheritedSize[0x00A0])
	 */
	class UMapEnvironmentPostProcessVolumeBlender : public UMapEnvironmentObjectBlender
	{
	public:
		unsigned char                                              UnknownData_RR73[0x4E30];                                // 0x00A0(0x4E30) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentModuleBlender
	 * Size -> 0x0018 (FullSize[0x0050] - InheritedSize[0x0038])
	 */
	class UMapEnvironmentModuleBlender : public UMapEnvironmentBlender
	{
	public:
		unsigned char                                              UnknownData_PBMC[0x18];                                  // 0x0038(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentWeatherParticleBlenderV2
	 * Size -> 0x00A8 (FullSize[0x00F8] - InheritedSize[0x0050])
	 */
	class UMapEnvironmentWeatherParticleBlenderV2 : public UMapEnvironmentModuleBlender
	{
	public:
		unsigned char                                              UnknownData_8WFH[0xA8];                                  // 0x0050(0x00A8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentPostProcessMaterialBlender
	 * Size -> 0x0128 (FullSize[0x0178] - InheritedSize[0x0050])
	 */
	class UMapEnvironmentPostProcessMaterialBlender : public UMapEnvironmentModuleBlender
	{
	public:
		unsigned char                                              UnknownData_6GMQ[0x128];                                 // 0x0050(0x0128) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentMaterialSetBlender
	 * Size -> 0x0050 (FullSize[0x00A0] - InheritedSize[0x0050])
	 */
	class UMapEnvironmentMaterialSetBlender : public UMapEnvironmentModuleBlender
	{
	public:
		unsigned char                                              UnknownData_V9JK[0x50];                                  // 0x0050(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentCharacterWindBlender
	 * Size -> 0x0018 (FullSize[0x0068] - InheritedSize[0x0050])
	 */
	class UMapEnvironmentCharacterWindBlender : public UMapEnvironmentModuleBlender
	{
	public:
		unsigned char                                              UnknownData_4W05[0x18];                                  // 0x0050(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentLightingModuleBlender
	 * Size -> 0x00A8 (FullSize[0x00F8] - InheritedSize[0x0050])
	 */
	class UMapEnvironmentLightingModuleBlender : public UMapEnvironmentModuleBlender
	{
	public:
		unsigned char                                              UnknownData_DJ4D[0xA8];                                  // 0x0050(0x00A8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapEnvironmentScabilityModuleBlender
	 * Size -> 0x0018 (FullSize[0x0068] - InheritedSize[0x0050])
	 */
	class UMapEnvironmentScabilityModuleBlender : public UMapEnvironmentModuleBlender
	{
	public:
		unsigned char                                              UnknownData_144W[0x18];                                  // 0x0050(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.FadingGroupActorConfig
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UFadingGroupActorConfig : public UObject
	{
	public:
		float                                                      FadeDuration;                                            // 0x0028(0x0004) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FadeOpacity;                                             // 0x002C(0x0004) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.FadingGroupActor
	 * Size -> 0x0010 (FullSize[0x0240] - InheritedSize[0x0230])
	 */
	class AFadingGroupActor : public AActor
	{
	public:
		TArray<class AActor*>                                      FadingGroupActors;                                       // 0x0230(0x0010) Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.GameplayTask_AttachMagicDoll
	 * Size -> 0x0090 (FullSize[0x00F8] - InheritedSize[0x0068])
	 */
	class UGameplayTask_AttachMagicDoll : public UGameplayTask
	{
	public:
		struct FSnActionAttachObjectData                           AttachObjectData;                                        // 0x0068(0x0080) NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_6YF4[0x10];                                  // 0x00E8(0x0010) MISSED OFFSET (PADDING)

	public:
		void OnMasterCharacterMovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
		class UGameplayTask_AttachMagicDoll* Attach(const struct FSnActionAttachObjectData& AttachObjectData, unsigned char Priority);
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.GameplayTask_AttachWorldObject
	 * Size -> 0x00A0 (FullSize[0x0108] - InheritedSize[0x0068])
	 */
	class UGameplayTask_AttachWorldObject : public UGameplayTask
	{
	public:
		class FScriptMulticastDelegate                             OnAttached;                                              // 0x0068(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FSnActionAttachObjectData                           AttachObjectData;                                        // 0x0078(0x0080) NativeAccessSpecifierPrivate
		class AActor*                                              AttachedParent;                                          // 0x00F8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_YZ46[0x8];                                   // 0x0100(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnAttachedParentEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
		void OnAttachedCollisionActorEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
		class UGameplayTask_AttachWorldObject* Attach(const struct FSnActionAttachObjectData& AttachObjectData, unsigned char Priority);
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.GameplayTask_Mount
	 * Size -> 0x0148 (FullSize[0x01B0] - InheritedSize[0x0068])
	 */
	class UGameplayTask_Mount : public UGameplayTask
	{
	public:
		unsigned char                                              UnknownData_ZYB4[0x148];                                 // 0x0068(0x0148) MISSED OFFSET (PADDING)

	public:
		void OnMasterCharacterMovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.HiveEntityData
	 * Size -> 0x0178 (FullSize[0x01A8] - InheritedSize[0x0030])
	 */
	class UHiveEntityData : public UPrimaryDataAsset
	{
	public:
		unsigned char                                              UnknownData_MDOI[0x158];                                 // 0x0030(0x0158) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTLCommonModelDefinition*                            Hatchling;                                               // 0x0188(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FGuid                                               PackageGuid;                                             // 0x0190(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_TZ2X[0x8];                                   // 0x01A0(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.TLCommonModelDefinition
	 * Size -> 0x0088 (FullSize[0x0230] - InheritedSize[0x01A8])
	 */
	class UTLCommonModelDefinition : public UHiveEntityData
	{
	public:
		class UHiveEntityData*                                     MotherHiveEntity;                                        // 0x01A8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              CameraPersonalization[0x28];                             // 0x01B0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		float                                                      DefaultScale;                                            // 0x01D8(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESnDecalReceiveType                                        DecalReceiveType;                                        // 0x01DC(0x0001) ELEMENT_SIZE_MISMATCH Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZZTB[0x3];                                   // 0x01DD(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		bool                                                       ForceMipStreaming;                                       // 0x01E0(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       NameplatePositionOffsetEnabled;                          // 0x01E1(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NSNM[0x2];                                   // 0x01E2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             NameplatePositionOffset;                                 // 0x01E4(0x000C) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       NameplatePositionOffsetFromHeadEnabled;                  // 0x01F0(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EDPI[0x3];                                   // 0x01F1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      NameplatePositionOffsetFromHead;                         // 0x01F4(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ControlledObjectNameplatePositionOffset;                 // 0x01F8(0x000C) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ControlledObjectNameplatePositionOffsetFromHead;         // 0x0204(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             UIFloaterPositionOffset;                                 // 0x0208(0x000C) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VirtualSocketHeightScale;                                // 0x0214(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       FindClosestSocketEnabled;                                // 0x0218(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_70DL[0x3];                                   // 0x0219(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HitSocketAdditionalRangeRadius;                          // 0x021C(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOutlineDisabled;                                        // 0x0220(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreSelfOutline;                                       // 0x0221(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       NoSelfOutline;                                           // 0x0222(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       TargetOutlineDepthTest;                                  // 0x0223(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESnEffectBudgetCategory                                    FxBudget;                                                // 0x0224(0x0001) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H4P5[0x3];                                   // 0x0225(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BlockOpacityForSeconds;                                  // 0x0228(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B3XW[0x4];                                   // 0x022C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.HiveEntitiyHatchlingMap
	 * Size -> 0x0050 (FullSize[0x0280] - InheritedSize[0x0230])
	 */
	class UHiveEntitiyHatchlingMap : public UTLCommonModelDefinition
	{
	public:
		struct FSoftObjectPath                                     basemodel;                                               // 0x0230(0x0018) Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MapTrueSkyIgnoreFreeze;                                  // 0x0248(0x0004) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_34RW[0x4];                                   // 0x024C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              MapEventEnvironmentVolumeRank1;                          // 0x0250(0x0010) Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              MapEventEnvironmentVolumeRank2;                          // 0x0260(0x0010) Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              MapEventEnvironmentVolumeRank3;                          // 0x0270(0x0010) Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.HiveEntitiyHatchlingContent
	 * Size -> 0x0018 (FullSize[0x0248] - InheritedSize[0x0230])
	 */
	class UHiveEntitiyHatchlingContent : public UTLCommonModelDefinition
	{
	public:
		TArray<class FString>                                      EnvironmentVolumeGuids;                                  // 0x0230(0x0010) Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic
		class FName                                                CueSheetSubLevelPackageName;                             // 0x0240(0x0008) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.ImageAttachmentComponent
	 * Size -> 0x0008 (FullSize[0x0200] - InheritedSize[0x01F8])
	 */
	class UImageAttachmentComponent : public USceneComponent
	{
	public:
		unsigned char                                              UnknownData_DHQ4[0x8];                                   // 0x01F8(0x0008) Fix Super Size

	public:
		void AttachImage(const class FString& ImagePath);
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.LandscapeBlendableAssetUserData
	 * Size -> 0x0028 (FullSize[0x0050] - InheritedSize[0x0028])
	 */
	class ULandscapeBlendableAssetUserData : public UAssetUserData
	{
	public:
		unsigned char                                              LandscapeBlendedActor[0x28];                             // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.LandscapeBlendedActor
	 * Size -> 0x0078 (FullSize[0x02B8] - InheritedSize[0x0240])
	 */
	class ALandscapeBlendedActor : public AStaticMeshActor
	{
	public:
		TWeakObjectPtr<class ALandscapeProxy>                      WeakLandscape;                                           // 0x0240(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture2DArray*                                     Texture2DArray;                                          // 0x0248(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture2D*                                          DefaultTexture;                                          // 0x0250(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanPassTextures;                                        // 0x0258(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M5PB[0x7];                                   // 0x0259(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FString, class UTexture2DArray*>                LandscapeMIToTextures;                                   // 0x0260(0x0050) Edit, NativeAccessSpecifierPublic
		bool                                                       bButtonToSave;                                           // 0x02B0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7KSS[0x7];                                   // 0x02B1(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.TLMapUserData
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UTLMapUserData : public UAssetUserData
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.LandscapeProxyUserData
	 * Size -> 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
	 */
	class ULandscapeProxyUserData : public UTLMapUserData
	{
	public:
		TLazyObjectPtr<class ALandscapeProxy>                      LandscapeProxy;                                          // 0x0028(0x001C) IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_03I0[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.LevelStreamingAlwaysLoadedMod
	 * Size -> 0x0000 (FullSize[0x0150] - InheritedSize[0x0150])
	 */
	class ULevelStreamingAlwaysLoadedMod : public ULevelStreamingAlwaysLoaded
	{
	public:
		void HandleOnLevelLoaded();
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.LevelStreamingExternLoadable
	 * Size -> 0x0030 (FullSize[0x0180] - InheritedSize[0x0150])
	 */
	class ULevelStreamingExternLoadable : public ULevelStreamingDynamic
	{
	public:
		unsigned char                                              UnknownData_WUXO[0x30];                                  // 0x0150(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapController
	 * Size -> 0x0178 (FullSize[0x01A0] - InheritedSize[0x0028])
	 */
	class UMapController : public UObject
	{
	public:
		unsigned char                                              UnknownData_A4PR[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UMapActorManager*                                    ActorManager;                                            // 0x0030(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMapEnvironmentManager*                              EnvironmentManager;                                      // 0x0038(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMapRouteManager*                                    RouteManager;                                            // 0x0040(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMapWaterManager*                                    WaterManager;                                            // 0x0048(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMapActivationManager*                               ActivationManager;                                       // 0x0050(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMapFadingManager*                                   FadingManager;                                           // 0x0058(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMapAreaVolumeManager*                               AreaManager;                                             // 0x0060(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KY3Z[0x138];                                 // 0x0068(0x0138) MISSED OFFSET (PADDING)

	public:
		void OnLevelStreamingCompleted();
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapActivationManager
	 * Size -> 0x0418 (FullSize[0x0440] - InheritedSize[0x0028])
	 */
	class UMapActivationManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_AD0D[0x418];                                 // 0x0028(0x0418) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapActorManager
	 * Size -> 0x0280 (FullSize[0x02A8] - InheritedSize[0x0028])
	 */
	class UMapActorManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_5W8G[0x58];                                  // 0x0028(0x0058) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FName, struct FMapHiveActorGroup>               HiveActorGroupByTag;                                     // 0x0080(0x0050) NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_1UM5[0x1D8];                                 // 0x00D0(0x01D8) MISSED OFFSET (PADDING)

	public:
		void OnActorDestroyed(class AActor* DestroyedActor);
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapAreaVolumeComponent
	 * Size -> 0x0038 (FullSize[0x04D0] - InheritedSize[0x0498])
	 */
	class UMapAreaVolumeComponent : public UMeshComponent
	{
	public:
		unsigned char                                              UnknownData_19PM[0x8];                                   // 0x0498(0x0008) Fix Super Size
		TArray<struct FVector2D>                                   AreaPoints;                                              // 0x04A0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YZFP[0x10];                                  // 0x04B0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UBodySetup*                                          AreaBodySetup;                                           // 0x04C0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LAMY[0x8];                                   // 0x04C8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapAreaWallComponent
	 * Size -> 0x0028 (FullSize[0x04C0] - InheritedSize[0x0498])
	 */
	class UMapAreaWallComponent : public UMeshComponent
	{
	public:
		class UMaterialInterface*                                  WallMaterial;                                            // 0x0498(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XUAO[0x18];                                  // 0x04A0(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UBodySetup*                                          WallBodySetup;                                           // 0x04B8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLScene.MapAreaVolume
	 * Size -> 0x0158 (FullSize[0x0388] - InheritedSize[0x0230])
	 */
	class AMapAreaVolume : public AActor
	{
	public:
		struct FGuid                                               Guid;                                                    // 0x0230(0x0010) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              ActivationTags[0x50];                                    // 0x0240(0x0050) UNKNOWN PROPERTY: SetProperty
		float                                                      WallVisibleDistance;                                     // 0x0290(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WallTextureScale;                                        // 0x0294(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WallTileScale;                                           // 0x0298(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBlockingWall;                                           // 0x029C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDeactivated;                                            // 0x029D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
