#pragma once

/**
 * Name: TL
 * Version: 0525
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class TLUI.TLViewModelBase
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UTLViewModelBase : public UDataAsset
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TextLayoutWidgetTL
	 * Size -> 0x0090 (FullSize[0x0198] - InheritedSize[0x0108])
	 */
	class UTextLayoutWidgetTL : public UWidget
	{
	public:
		unsigned char                                              UnknownData_WK49[0x8];                                   // 0x0108(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FShapedTextOptions                                  ShapedTextOptions;                                       // 0x0110(0x0003) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		ETextJustifyTL                                             Justification;                                           // 0x0113(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ETextWrappingPolicy                                        WrappingPolicy;                                          // 0x0114(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       AutoWrapText : 1;                                        // 0x0115(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_RRU5[0x2];                                   // 0x0116(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WrapTextAt;                                              // 0x0118(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       DynamicAutoWrapText : 1;                                 // 0x011C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bUseWrapScaling;                                         // 0x011D(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_XBE6[0x2];                                   // 0x011E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MinWrapLimitOverFontSize;                                // 0x0120(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_J2D0[0x4];                                   // 0x0124(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FString, int32_t>                               LanguageMinWrapLimitOverFontSizeMap;                     // 0x0128(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected
		ETLTextWrapLimitOverRule                                   WrapLimitOverRule;                                       // 0x0178(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_CZTT[0x3];                                   // 0x0179(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WrapTextHeight;                                          // 0x017C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      RollingSpeed;                                            // 0x0180(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FMargin                                             Margin;                                                  // 0x0184(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		float                                                      LineHeightPercentage;                                    // 0x0194(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetJustification(ETextJustifyTL InJustification);
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLAdvancedMarkupHelper
	 * Size -> 0x0028 (FullSize[0x0050] - InheritedSize[0x0028])
	 */
	class UTLAdvancedMarkupHelper : public UObject
	{
	public:
		unsigned char                                              UnknownData_2AQU[0x28];                                  // 0x0028(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLCanvasPanel
	 * Size -> 0x0130 (FullSize[0x0268] - InheritedSize[0x0138])
	 */
	class UTLCanvasPanel : public UCanvasPanel
	{
	public:
		unsigned char                                              UnknownData_NT9X[0x68];                                  // 0x0138(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x01A0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x01A4(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetFocusableData                              TLFocusableData;                                         // 0x01B0(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		bool                                                       bUseExplicitChildZOrder;                                 // 0x01C8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OC3J[0x17];                                  // 0x01C9(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x01E0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0220(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                       ChildDisableHitTestAll;                                  // 0x0260(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MM4Q[0x7];                                   // 0x0261(0x0007) MISSED OFFSET (PADDING)

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLAttachPanel
	 * Size -> 0x0018 (FullSize[0x0280] - InheritedSize[0x0268])
	 */
	class UTLAttachPanel : public UTLCanvasPanel
	{
	public:
		TArray<struct FTLAttachedWidget>                           PreviewFrameList;                                        // 0x0268(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected
		ETLUIPlatform                                              PreviewUIPlatform;                                       // 0x0278(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FU9Z[0x7];                                   // 0x0279(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLBackgroundBlur
	 * Size -> 0x00F0 (FullSize[0x02C8] - InheritedSize[0x01D8])
	 */
	class UTLBackgroundBlur : public UBackgroundBlur
	{
	public:
		unsigned char                                              UnknownData_RGVA[0x60];                                  // 0x01D8(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0238(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x023C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x0248(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0288(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLBorder
	 * Size -> 0x0100 (FullSize[0x0370] - InheritedSize[0x0270])
	 */
	class UTLBorder : public UBorder
	{
	public:
		unsigned char                                              UnknownData_J5H0[0x60];                                  // 0x0270(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x02D0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x02D4(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x02E0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0320(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_15BI[0x10];                                  // 0x0360(0x0010) MISSED OFFSET (PADDING)

	public:
		void SetContentColorWithColorTable(const class FName& InTableColorKey);
		void SetBrushTintColorWithColorTable(const class FName& InTableColorKey);
		void SetBrushFromSprite(class UPaperSprite* Sprite);
		void SetBrushFromSoftObjectPath(const struct FSoftObjectPath& Path, bool bInAsyncLoad);
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLButton
	 * Size -> 0x0120 (FullSize[0x0548] - InheritedSize[0x0428])
	 */
	class UTLButton : public UButton
	{
	public:
		unsigned char                                              UnknownData_C8PU[0x60];                                  // 0x0428(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0488(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x048C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x0498(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x04D8(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnClickWEvent;                                           // 0x0518(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnPressWEvent;                                           // 0x0520(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnReleaseWEvent;                                         // 0x0528(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnHoverWEvent;                                           // 0x0530(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnUnhoverWEvent;                                         // 0x0538(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4OQ1[0x8];                                   // 0x0540(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnUnhoverHandler();
		void OnReleaseHandler();
		void OnPressHandler();
		void OnHoverHandler();
		void OnClickHandler();
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLCheckBox
	 * Size -> 0x0128 (FullSize[0x0898] - InheritedSize[0x0770])
	 */
	class UTLCheckBox : public UCheckBox
	{
	public:
		unsigned char                                              UnknownData_FG8X[0x60];                                  // 0x0770(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x07D0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x07D4(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x07E0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0820(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnCheckSound;                                            // 0x0860(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnUncheckSound;                                          // 0x0868(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnHoverSound;                                            // 0x0870(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnUnhoverSound;                                          // 0x0878(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnChecked;                                               // 0x0880(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AJ5K[0x8];                                   // 0x0890(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnTLCheckStateChangedCallback(bool IsChecked);
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLCircularThrobber
	 * Size -> 0x00F0 (FullSize[0x02B0] - InheritedSize[0x01C0])
	 */
	class UTLCircularThrobber : public UCircularThrobber
	{
	public:
		unsigned char                                              UnknownData_NN8J[0x60];                                  // 0x01C0(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0220(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x0224(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x0230(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0270(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLComboBoxString
	 * Size -> 0x0D38 (FullSize[0x1B38] - InheritedSize[0x0E00])
	 */
	class UTLComboBoxString : public UComboBoxString
	{
	public:
		unsigned char                                              UnknownData_J4NV[0x60];                                  // 0x0E00(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0E60(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x0E64(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x0E70(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0EB0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnSelectionChangedSound;                                 // 0x0EF0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTLSoundEvent*                                       OnOpeningSound;                                          // 0x0EF8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsCustomScrollbar;                                       // 0x0F00(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SRYF[0x7];                                   // 0x0F01(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FScrollBarStyle                                     WidgetScrollbarStyle;                                    // 0x0F08(0x05E0) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		bool                                                       bCustomScrollBarStyle;                                   // 0x14E8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8V5Q[0x7];                                   // 0x14E9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FScrollBarStyle                                     ScrollBarStyleConsole;                                   // 0x14F0(0x05E0) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		bool                                                       bCustomScrollBarStyleConsole;                            // 0x1AD0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IB0O[0x3];                                   // 0x1AD1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           ScrollbarThickness;                                      // 0x1AD4(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FMargin                                             ScrollbarPadding;                                        // 0x1ADC(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FMargin                                             ScrollbarTrackPadding;                                   // 0x1AEC(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FMargin                                             ScrollbarPaddingConsole;                                 // 0x1AFC(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector2D                                           ScrollbarThicknessConsole;                               // 0x1B0C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FMargin                                             ScrollbarTrackPaddingConsole;                            // 0x1B14(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CUAI[0x14];                                  // 0x1B24(0x0014) MISSED OFFSET (PADDING)

	public:
		void SetSelectedOptionIndex(int32_t Index);
		void SetMenuPlacement(EMenuPlacement InMenuPlacement);
		void OnSelectionChangedHandler(const class FString& SelectedItem, ESelectInfo SelectionType);
		void OnOpeningHandler();
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		int32_t GetSelectedOptionIndex();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLContentsSlot
	 * Size -> 0x0048 (FullSize[0x0150] - InheritedSize[0x0108])
	 */
	class UTLContentsSlot : public UWidget
	{
	public:
		unsigned char                                              UnknownData_PGHH[0x10];                                  // 0x0108(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              ContentsWidgetClass[0x28];                               // 0x0118(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		bool                                                       bWidgetSyncLoad;                                         // 0x0140(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_P6FZ[0x7];                                   // 0x0141(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUserWidget*                                         ContentsWidget;                                          // 0x0148(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLDynamicEntryBox
	 * Size -> 0x0128 (FullSize[0x0308] - InheritedSize[0x01E0])
	 */
	class UTLDynamicEntryBox : public UDynamicEntryBox
	{
	public:
		unsigned char                                              UnknownData_54OC[0x68];                                  // 0x01E0(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0248(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x024C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x0258(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0298(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetFocusableData                              TLFocusableData;                                         // 0x02D8(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WWQK[0x10];                                  // 0x02F0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WrapWidth;                                               // 0x0300(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bExplicitWrapWidth;                                      // 0x0304(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AKN6[0x3];                                   // 0x0305(0x0003) MISSED OFFSET (PADDING)

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLEditableText
	 * Size -> 0x00F0 (FullSize[0x0550] - InheritedSize[0x0460])
	 */
	class UTLEditableText : public UEditableText
	{
	public:
		unsigned char                                              UnknownData_3AMI[0x60];                                  // 0x0460(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x04C0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x04C4(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x04D0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0510(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLEditableTextBox
	 * Size -> 0x0DD0 (FullSize[0x0ED8] - InheritedSize[0x0108])
	 */
	class UTLEditableTextBox : public UWidget
	{
	public:
		unsigned char                                              UnknownData_ZFES[0x68];                                  // 0x0108(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Text;                                                    // 0x0170(0x0018) Edit, NativeAccessSpecifierPublic
		class FScriptDelegate                                      TextDelegate;                                            // 0x0188(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		struct FEditableTextBoxStyle                               WidgetStyle;                                             // 0x0198(0x0908) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class USlateWidgetStyleAsset*                              Style;                                                   // 0x0AA0(0x0008) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                HintText;                                                // 0x0AA8(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FScriptDelegate                                      HintTextDelegate;                                        // 0x0AC0(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		struct FSlateFontInfo                                      Font;                                                    // 0x0AD0(0x0058) Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        ForegroundColor;                                         // 0x0B28(0x0010) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BackgroundColor;                                         // 0x0B38(0x0010) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        ReadOnlyForegroundColor;                                 // 0x0B48(0x0010) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsReadOnly;                                              // 0x0B58(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsPassword;                                              // 0x0B59(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CLGX[0x2];                                   // 0x0B5A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinimumDesiredWidth;                                     // 0x0B5C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FMargin                                             Padding;                                                 // 0x0B60(0x0010) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       IsCaretMovedWhenGainFocus;                               // 0x0B70(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SelectAllTextWhenFocused;                                // 0x0B71(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       RevertTextOnEscape;                                      // 0x0B72(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ClearKeyboardFocusOnCommit;                              // 0x0B73(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       SelectAllTextOnCommit;                                   // 0x0B74(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AllowContextMenu;                                        // 0x0B75(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreFocusLostCommited;                                 // 0x0B76(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVirtualKeyboardType                                       KeyboardType;                                            // 0x0B77(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVirtualKeyboardOptions                             VirtualKeyboardOptions;                                  // 0x0B78(0x0001) Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		EVirtualKeyboardDismissAction                              VirtualKeyboardDismissAction;                            // 0x0B79(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETextJustifyTL                                             Justification;                                           // 0x0B7A(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FShapedTextOptions                                  ShapedTextOptions;                                       // 0x0B7B(0x0003) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HAVI[0x2];                                   // 0x0B7E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnTextChanged;                                           // 0x0B80(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTextCommitted;                                         // 0x0B90(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTextFocusReceived;                                     // 0x0BA0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTextFocusLost;                                         // 0x0BB0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTextMouseButtonDown;                                   // 0x0BC0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		TArray<class UTLTextBlockDecorator*>                       DecoratorObjects;                                        // 0x0BD0(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_AWJR[0x238];                                 // 0x0BE0(0x0238) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0E18(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x0E1C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetFocusableData                              TLFocusableData;                                         // 0x0E28(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KXSS[0x10];                                  // 0x0E40(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x0E50(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0E90(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		int32_t                                                    MaxChar;                                                 // 0x0ED0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bCustomWidgetStyle;                                      // 0x0ED4(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ETLEditableBoxEscapeAction                                 EscapeAction;                                            // 0x0ED5(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_J5B1[0x2];                                   // 0x0ED6(0x0002) MISSED OFFSET (PADDING)

	public:
		void SetText(const class FText& InText);
		void SetMaxChar(int32_t InMaxChar);
		void SetIsReadOnly(bool bReadOnly);
		void SetIsPassword(bool bIsPassword);
		void SetIgnoreFocusLostCommited(bool InIsIgnore);
		void SetHintText(const class FText& InText);
		void SetEscapeAction(ETLEditableBoxEscapeAction InEscapeAction);
		void SetError(const class FText& InError);
		void SelectAllText();
		void OnEditableTextMouseButtonDownEvent__DelegateSignature(const struct FGeometry& MyGeometry, const struct FPointerEvent& InMouseEvent);
		void OnEditableTextFocusReceivedEvent__DelegateSignature(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
		void OnEditableTextFocusLostEvent__DelegateSignature(const struct FFocusEvent& InFocusEvent);
		void OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
		void OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
		bool HasError();
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		class FText GetText();
		void ClearError();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLExpandableArea
	 * Size -> 0x00F0 (FullSize[0x0428] - InheritedSize[0x0338])
	 */
	class UTLExpandableArea : public UExpandableArea
	{
	public:
		unsigned char                                              UnknownData_20KN[0x60];                                  // 0x0338(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0398(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x039C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x03A8(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x03E8(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLImageBase
	 * Size -> 0x0128 (FullSize[0x0230] - InheritedSize[0x0108])
	 */
	class UTLImageBase : public UWidget
	{
	public:
		struct FSlateBrush                                         Brush;                                                   // 0x0108(0x0088) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		class FScriptDelegate                                      BrushDelegate;                                           // 0x0190(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		struct FLinearColor                                        ColorAndOpacity;                                         // 0x01A0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptDelegate                                      ColorAndOpacityDelegate;                                 // 0x01B0(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bFlipForRightToLeftFlowDirection;                        // 0x01C0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseDisableColorAndOpacity;                              // 0x01C1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CQ6Q[0x2];                                   // 0x01C2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLinearColor                                        DisabledTint;                                            // 0x01C4(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptDelegate                                      DisabledTintDelegate;                                    // 0x01D4(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		class FScriptDelegate                                      OnMouseButtonDownEvent;                                  // 0x01E4(0x0010) Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AY9R[0x3C];                                  // 0x01F4(0x003C) MISSED OFFSET (PADDING)

	public:
		void SetOpacity(float InOpacity);
		void SetColorWithColorTable(const class FName& InTableColorKey);
		void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
		void SetBrushTintColorWithColorTable(const class FName& InTableColorKey);
		void SetBrushTintColor(const struct FSlateColor& TintColor);
		void SetBrushSize(const struct FVector2D& DesiredSize);
		void SetBrushResourceObject(class UObject* ResourceObject);
		void SetBrushFromTextureDynamic(class UTexture2DDynamic* Texture, bool bMatchSize);
		void SetBrushFromTexture_MaintainRatio(class UTexture2D* Texture, const struct FVector2D& DefaultSize);
		void SetBrushFromTexture(class UTexture2D* Texture, bool bMatchSize);
		void SetBrushFromSoftTexture(bool bMatchSize);
		void SetBrushFromSoftMaterial();
		void SetBrushFromRenderTarget(class UTextureRenderTarget2D* Texture, bool bMatchSize);
		void SetBrushFromMediaTexture(class UBinkMediaTexture* Texture);
		void SetBrushFromMaterial(class UMaterialInterface* Material);
		void SetBrushFromAtlasInterface(bool bMatchSize);
		void SetBrushFromAsset(class USlateBrushAsset* Asset);
		void SetBrush(const struct FSlateBrush& InBrush);
		void PlayOrCloseBinkMediaPlayer(bool bInPlay);
		class UMaterialInstanceDynamic* GetDynamicMaterial();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLFlipBookImage
	 * Size -> 0x0158 (FullSize[0x0388] - InheritedSize[0x0230])
	 */
	class UTLFlipBookImage : public UTLImageBase
	{
	public:
		unsigned char                                              UnknownData_33YV[0x68];                                  // 0x0230(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0298(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x029C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x02A8(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x02E8(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UObject*                                             CustomMaterial;                                          // 0x0328(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPaperFlipbook*                                      flipbook;                                                // 0x0330(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    FramesPerSecond;                                         // 0x0338(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    CurrentFrame;                                            // 0x033C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    TotalFrames;                                             // 0x0340(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    LoopCount;                                               // 0x0344(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       AutoPlay;                                                // 0x0348(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_PB5V[0xF];                                   // 0x0349(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FKeyFrameBrush>                              KeyFrameBrushes;                                         // 0x0358(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_8WDZ[0x20];                                  // 0x0368(0x0020) MISSED OFFSET (PADDING)

	public:
		void Stop();
		void SetFlipbookFromSoftObjectPath(const struct FSoftObjectPath& Path);
		void SetCurrentFrame(int32_t Frame);
		void Play();
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLGridPanel
	 * Size -> 0x0120 (FullSize[0x0270] - InheritedSize[0x0150])
	 */
	class UTLGridPanel : public UGridPanel
	{
	public:
		unsigned char                                              UnknownData_T39G[0x68];                                  // 0x0150(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x01B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x01BC(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetFocusableData                              TLFocusableData;                                         // 0x01C8(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UO3S[0x10];                                  // 0x01E0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x01F0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0230(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLHorizontalBox
	 * Size -> 0x0120 (FullSize[0x0250] - InheritedSize[0x0130])
	 */
	class UTLHorizontalBox : public UHorizontalBox
	{
	public:
		unsigned char                                              UnknownData_AUYB[0x68];                                  // 0x0130(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0198(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x019C(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetFocusableData                              TLFocusableData;                                         // 0x01A8(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7RZN[0x10];                                  // 0x01C0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x01D0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x0210(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void HandleUpdateVisible();
		void HandleUpdateEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class TLUI.TLImage
	 * Size -> 0x02B0 (FullSize[0x04E0] - InheritedSize[0x0230])
	 */
	class UTLImage : public UTLImageBase
	{
	public:
		unsigned char                                              UnknownData_Y598[0x60];                                  // 0x0230(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTLVisibility                                       TLVisibility;                                            // 0x0290(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTooltipPositionData                                TooltipPositionData;                                     // 0x0294(0x000C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FTLWidgetBindingVisible                             VisibleBinding;                                          // 0x02A0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingEnabled                             EnabledBinding;                                          // 0x02E0(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingImageBrush                          ImageBrushBinding;                                       // 0x0320(0x0048) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTLWidgetBindingImageColorAndOpacity                ColorAndOpacityBinding;                                  // 0x0368(0x0040) Transient, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UObject*                                             CustomMaterial;                                          // 0x03A8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        HslShift;                                                // 0x03B0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Colorize;                                                // 0x03C0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M2L2[0x3];                                   // 0x03C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Opacity;                                                 // 0x03C4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture*                                            MaskTexture;                                             // 0x03C8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptDelegate                                      RenderedCustomMaterialBrushDelegate;                     // 0x03D0(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		struct FSlateBrush                                         RenderedCustomMaterialBrush;                             // 0x03E0(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		TMap<class FName, struct FSlateBrush>                      NamedSlateBrushes;                                       // 0x0468(0x0050) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class FName                                                CurrentSlateBrushName;                                   // 0x04B8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WU65[0x8];                                   // 0x04C0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UObject*                                             ResrouceObject;                                          // 0x04C8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WYUY[0x10];                                  // 0x04D0(0x0010) MISSED OFFSET (PADDING)

	public:
		void SetMaskTexture(class UTexture* InMaskTexture);
		void SetHslShift(const struct FLinearColor& InHslShift);
		void SetBrushFromSprite(class UPaperSprite* Sprite, bool bMatchSize);
		void SetBrushFromSoftObjectPath(const struct FSoftObjectPath& Path, bool bInAsyncLoad, bool bInAutoShowAfterBrushLoading, bool bMatchSize);
		void SetBrushFromCustomMaterial(class UObject* InObject);
